import 'package:bokhari_shorif/app/data/models/hadis_number.dart';
import 'package:bokhari_shorif/app/data/models/poriched.dart';
import 'package:get/get.dart';

class hadisProvider extends GetConnect {
  @override
  void onInit() {
    httpClient.baseUrl = 'YOUR-API-URL';
  }

  List<PorichedModel> chapterOne = [
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১',
        name: 'রাসুলুল্লাহ (ﷺ) এর প্রতি কিভাবে ওহী শুরু হয়েছিল',
        hadisNumberList: [
          HadisNumberModel(
            id: '১।',
            name:
                ' হুমায়দী (রহঃ) ... আলকামা ইবনু ওয়াক্কাস আল-লায়সী (রহঃ) থেকে বর্ণিত, আমি উমর ইবনুল খাত্তাব (রাঃ)-কে মিম্বরের ওপর দাঁড়িয়ে বলতে শুনেছিঃ আমি রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছিঃ প্রত্যেক কাজ নিয়তের সাথে সম্পর্কিত। আর মানুষ তার নিয়ত অনুযায়ী ফল পাবে। তাই যার হিজরত হবে দুনিয়া লাভের অথবা নারীকে বিয়ে করার উদ্দেশ্যে- সেই উদ্দেশ্যেই হবে তার হিজরতের প্রাপ্য।',
            ref:
                'তাহক্বীক: মারফু হাদিস। তাখরীজ : বুখারীঃ তাওহীদ.পাবলিকেশান্স ১, ৫৪, ২৫২৯, ৩৮৯৮, ৫০৭০, ৬৬৮৯, ৬৯৫৩; মুসলিমঃ ৫০৩৬; আবূ দাউদঃ ২২০৩; তিরমিযীঃ ১৭৪৮; দারাকুতনীঃ ১৩৪; নাসাঈঃ ৭৫, ৩৪৫০, ৩৮১০; আহমাদঃ ১৭০, ৩০৭। মুসলিম ২৩/৪৫ হা: ১৯০৭ , (আধুনিক প্রকাশনী. ১ , ইসলামিক ফাউন্ডেশন. ১)',
          ),
          HadisNumberModel(
              id: '২। ',
              name:
                  'আবদুল্লাহ ইবনু ইউসুফ (রহঃ) ... আয়িশা (রাঃ) থেকে বর্ণিত, হারিস ইবনু হিশাম (রাঃ) রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে জিজ্ঞাসা করলেন, ইয়া রাসুলুল্লাহ! আপনার প্রতি ওহী কিভাবে আসে? রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ কোন সময় তা ঘন্টাধ্বনির ন্যায় আমার নিকট আসে। আর এটি-ই আমার উপর সবচাইতে কষ্টদায়ক হয় এবং তা সমাপ্ত হতেই ফিরিশতা যা বলেন আমি তা মুখস্থ করে নিই, আবার কখনো ফিরিশতা মানুষের আকৃতিতে আমার সঙ্গে কথা বলেন। তিনি যা বলেন আমি তা মুখস্থ করে ফেলি। আয়িশা (রাঃ) বলেন, আমি প্রচন্ড শীতের দিনে ওহী নাযিলরত অবস্থায় তাঁকে দেখেছি। ওহী শেষ হলেই তাঁর কপাল থেকে ঘাম ঝরে পড়ত।',
              ref:
                  'তাহক্বীক: মারফু হাদিস। তাখরীজ: ( বুখারীঃ তা.পা ২, ৩২১৫; তিরমিযীঃ ৩৯৯৪; নাসাঈঃ ৯৪২; আহমাদঃ ২৬৯৫২; মুয়াত্তাঃ ৪৭৯। মুসলিম ৪৩/২৩, হা: ২৩৩৩ , আহমাদ ২৫৩০৭ ( আধুনিক প্রকাশনী. ২ , ই.ফা. ২)শরীআহর মূল উৎস হচ্ছে ওয়াহী। ওয়াহী ২ প্রকার । ওয়াহী মাতলু (আল-কুরআন) ও ওয়াহী গাইরে মাতলু (সুন্নাহ ও হাদীস) । এবং দ্বীনে ইলাহীর ভিত্তি শুধু ২ টি জিনিসের উপর প্রতিষ্ঠিত । ইজমা ও কিয়াস কোন শারঈ দলীল নয়। বরং ইজমা ও কিয়াস ওয়াহীর পক্ষে অর্থাৎ কুরআন ও সুন্নাহ মুতাবিক হবে তা গ্রহণযোগ্য এবং যেটা বিপক্ষে যারে সেটা পরিত্যাজ্য ও অগ্রহণযোগ্য। এ প্রসঙ্গে আল্লাহর বানী :[يَا أَيُّهَا الَّذِينَ آمَنُوا أَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ وَأُولِي الْأَمْرِ مِنكُمْ ۖ فَإِن تَنَازَعْتُمْ فِي شَيْءٍ فَرُدُّوهُ إِلَى اللَّهِ وَالرَّسُولِ إِن كُنتُمْ تُؤْمِنُونَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ ۚ ذَٰلِكَ خَيْرٌ وَأَحْسَنُ تَأْوِيلًا [٤:٥٩]][يَا أَيُّهَا الَّذِينَ آمَنُوا أَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ وَلَا تُبْطِلُوا أَعْمَالَكُمْ [٤٧:٣٣]][ওহে যারা ঈমান এনেছ! আল্লাহকে অনুসরণ করো, ও রসূলের অনুগমন করো, আর তোমাদের মধ্যে যাদের হুকুম দেবার ভার আছে। তারপর যদি কোনো বিষয়ে তোমরা মতভেদ করো তবে তা পেশ করো আল্লাহ ও রসূলের কাছে, যদি তোমরা আল্লাহতে ও আখেরাতের দিনে বিশ্বাস করে থাকো। এটিই হচ্ছে শ্রেষ্ঠ ও সর্বাঙ্গ সুন্দর সমাপ্তিকরণ। (নিসাঃ ৪ : ৫৯)ওহে যারা ঈমান এনেছ! আল্লাহকে মেনে চলো ও রসূলের আজ্ঞা পালন করো, আর তোমাদের ক্রিয়াকর্ম বিফল করো না (মুহাম্মাদঃ ৪৭ : ৩৩)]কিন্তু বাতিলি ফির্কার লোকেরা ইজমা ও কিয়াসকে ওয়াহীর আসনে বসিয়েছে এবং বলে থাকে : শরীআহর ভিত্তি ভিত্তি ৪ টি বিষয়ের উপর । কুরআন , সুন্নাহ , ইজমা, কিয়াস । বড় আশ্চর্জের বিষয় এই যে, সাহাবায়ে কেরাম যাদের উপর আল্লাহ তা’আলা তার সন্তুষ্টির ঘোষনা দিয়েছেন, তাদেরকে সত্যবাদী বলে স্বীকৃতি দেয়া হয়েছে এবং মুসলিম উম্মাহ এ ব্যপারে সকলেই একমত। অথচ তারা সাহবায়ে কেরামকে ২ ভাগে ভাগ করেছেন। [১] ফকীগ [২] গাইরে ফকীহ। আর বলেছেন যে সকল সাহাবী ফকীহ ছিলেন তার আযদি কিয়াসের বীপরীতে হাদীস বর্ণনা করেন তবে তা গ্রহণযোগ্য কিন্তু যে সকল সাহাবী গাইরে ফকীহ অর্থাৎ ফকীহ নন তাঁরা যদি কিয়াসের খেলাফ হাদীস বর্ণনা করেন তাহলে তা গ্রহণযোগ্য বলে বিবেচিত হবে না।প্রকৃতপক্ষে এটা উম্মতে মুহাম্মাদিয়াকে সিরাতে মুস্তাকীমের পথ হতে সরিয়ে দেয়ার একটা বড় অস্ত্র এবং পরিকল্পনা। কেননা তারা কিয়াসকে মূল আর হাদীসকে ২য় স্থানে রেখেছেন। সকল সাহাবীর উপর আল্লাহ তা’আলা সন্তুষ্ট কিন্তু তারা খুশী নন। সকল সাহাবীর ব্যাপারে উম্মতের ঐক্যমত রয়েছে। কিন্তু তাদের নিকট গাইরে ফকীহ সাহাবীগণ ‘আদীল নন।ধোকাঁবাজির কিছু নমুনা : তারা বলেন, ফকীহ সাহাবীগণ কিয়াসের খেলাফ হাদীস বর্ণনা করলে তা গ্রহণীয় হবে। কিন্তু গাইরে ফকীহ সাহাবীগণ কিয়াসের খেলাফ হাদীস বর্ণনা করলে তা গ্রহণীয় হবে না এবং কিয়াসের উপর আ‘মাল করতে হবে। বাই’য়ি মুসারাহ এর হাদীস আবূ হুরাইরাহ হতে বর্ণিত এবং কিয়াসের খেলাফ। এই জন্য তা বাতিল। এবং কিয়াসের উপর আ‘মালযোগ্য। অথচ এই হাদীস ‘আবদুল্লাহ ইবনু মাসঊদ হতেও বর্ণিত হয়েছে। (দেখুন সহীহ বুখারী ২৮৮ পৃষ্ঠা রশিদিয়া ছাপা)'),
          HadisNumberModel(
              id: '4',
              name:
                  '৩। ইয়াহ্ইয়া ইবনু বুকায়র (রহঃ) আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেন, রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর প্রতি সর্বপ্রথম যে ওহী আসে, তা ছিল ঘুমের মধ্যে সত্য স্বপ্নরূপে। যে স্বপ্নই তিনি দেখতেন তা একেবারে ভোরের আলোর ন্যায় প্রকাশ পেত। তারপর তাঁর কাছে নির্জনতা প্রিয় হয়ে পড়ে এবং তিনি হেরার গুহায় নির্জনে থাকতেন। আপন পরিবারের কাছে ফিরে আসা এবং কিছু খাদ্যসামগ্রী সঙ্গে নিয়ে যাওয়া এইভাবে সেখানে তিনি একাধারে বেশ কয়েক রাত ইবাদতে নিমগ্ন থাকতেন।তারপর খাদীজা (রাঃ)-এর কাছে ফিরে এসে আবার অনুরূপ সময়ের জন্য কিছু খাদ্যসামগ্রী নিয়ে যেতেন। এমনিভাবে হেরা’ গুহায় অবস্থানকালে একদিন তাঁর কাছে ওহী এলো। তাঁর কাছে ফিরিশতা এসে বললেন, পড়ুন’। রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ “আমি বললাম, আমি পড়িনা’। তিনি বলেনঃ তারপর তিনি আমাকে জড়িয়ে ধরে এমন ভাবে চাপ দিলেন যে, আমার অত্যন্ত কষ্ট হল। তারপর তিনি আমাকে ছেড়ে দিয়ে বললেন, পড়ুন’। আমি বললামঃ আমি তো পড়ি না। তিনি দ্বিতীয়বার আমাকে জড়িয়ে ধরে এমন ভাবে চাপ দিলেন যে, আমার অত্যন্ত কষ্ট হল। এরপর তিনি আমাকে ছেড়ে দিয়ে বললেনঃ পড়ুন’। আমি জবাব দিলাম, আমিতো পড়িনা’। রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, তারপর তৃতীয়বার তিনি আমাকে জড়িয়ে ধরে চাপ দিলেন। এরপর ছেড়ে দিয়ে বললেন, “পড়ুন আপনার রবের নামে যিনি সৃষ্টি করেছেন। সৃষ্টি করেছেন মানুষকে আলাক থেকে। পড়ুন আর আপনার রব্ মহামহিমান্বিত।” (৯৬: ১-৩)তারপর এ আয়াত নিয়ে রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফিরে এলেন। তাঁর অন্তর তখন কাঁপছিল। তিনি খাদীজা বিন্‌ত খুওয়ালিদের কাছে এসে বললেন, আমাকে চাঁদর দিয়ে ঢেকে দাও, আমাকে চাঁদর দিয়ে ঢেকে দাও। ’ তাঁরা তাঁকে চাঁদর দিয়ে ঢেকে দিলেন। অবশেষে তাঁর ভয় দূর হল। তখন তিনি খাদীজা (রাঃ) এর কাছে সকল ঘটনা জানিয়ে তাঁকে বললেন, আমি নিজের উপর আশংকা বোধ করছি। খাদীজা (রাঃ) বললেন, আল্লাহ্‌র কসম, কক্ষনো না। আল্লাহ্ আপনাকে কক্ষনো অপমানিত করবেন না। আপনিতো আত্মীয়-স্বজনের সাথে সদ্ব্যবহার করেন, অসহায় দুর্বলের দায়িত্ব বহন করেন, নিঃস্বকে সাহায্য করেন, মেহমানের মেহমানদারী করেন এবং দুর্দশাগ্রস্তকে সাহায্য করেন।এরপর তাঁকে নিয়ে খাদীজা (রাঃ) তাঁর চাচাতো ভাই ওয়ারাকা ইবনু নাওফিল ইবনু আবদুল আসা’দ ইবনু আবদুল উযযার কাছে গেলেন, যিনি জাহিলী যুগে ঈসায়ী ধর্ম গ্রহণ করেছিলেন। তিনি ইবরানী ভাষা লিখতে জানতেন এবং আল্লাহ্‌র তওফীক অনুযায়ী ইবরানী ভাষায় ইনজীল থেকে অনুবাদ করতেন। তিনি ছিলেন অত্যন্ত বয়োবৃদ্ধ এবং অন্ধ হয়ে গিয়েছিলেন। খাদীজা (রাঃ) তাঁকে বললেন, হে চাচাতো ভাই! আপনার ভাতিজার কথা শুনুন। ওয়ারাকা তাঁকে জিজ্ঞেস করলেন, ভাতিজা! তুমি কী দেখ?’ রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যা দেখেছিলেন, সবই খুলে বললেন।তখন ওয়ারাকা তাঁকে বললেন, ইনি সে দূত যাঁকে আল্লাহ্ মূসা আলাইহিস সালাম এর কাছে পাঠিয়েছিলেন। আফসোস! আমি যদি সেদিন যুবক থাকতাম। আফসোস! আমি যদি সেদিন জীবিত থাকতাম, যেদিন তোমার কাওম তোমাকে বের করে দেবে। রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তাঁরা কি আমাকে বের করে দিবে? তিনি বললেন, হ্যাঁ, অতীতে যিনই তোমার মত কিছু নিয়ে এসেছেন তাঁর সঙ্গেই শত্রুতা করা হয়েছে। সেদিন যদি আমি থাকি, তবে তোমাকে প্রবলভাবে সাহায্য করব। এর কিছুদিন পর ওয়ারাকা (রাঃ) ইন্তেকাল করেন। আর ওহী স্থগিত থাকে।ইবনু শিহাব (রহঃ) ... জাবির ইবনু আবদুল্লাহ আনসারী (রাঃ) ওহী স্থগিত হওয়া প্রসঙ্গে বর্ণনা করেন যে, রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ একদা আমি হেঁটে চলেছি, হঠাৎ আকাশ থেকে একটি আওয়াজ শুনতে পেয়ে চোখ তুলে তাকালাম। দেখলাম, সেই ফিরিশতা, যিনি হেরায় আমার কাছে এসেছিলেন, আসমান ও যমিনের মাঝখানে একটি কুরসীতে বসে আছেন। এতে আমি ভয় পেয়ে গেলাম। তৎক্ষণাৎ আমি ফিরে এসে বললাম, আমাকে বস্ত্রাবৃত কর, আমাকে বস্ত্রাবৃত কর। তারপর আল্লাহ তা আলা নাযিল করলেন, হে বস্ত্রাচ্ছাদিত! উঠুন, সতর্কবানী প্রচার করুন এবং আপনার রবের শ্রেষ্ঠত্ব ঘোষণা করুন। আপনার পোশাক পবিত্র রাখুন। অপবিত্রতা থেকে দূরে থাকুন (৭৪: ১-৪)। এরপর ব্যাপকভাবে পর পর ওহী নাযিল হতে লাগল।আবদুল্লাহ ইবনু ইউসুফ (রহঃ) ও আবূ সালেহ (রহঃ) অনুরুপ বর্ণনা করেছেন। হেলাল ইবনু রাদদাদ (রহঃ) যুহরী (রহঃ) থেকেও অনুরুপ বর্ণনা করেছেন। ইউনুস ও মা মার فؤاده এর স্থলেبَوَادِرُهُ শব্দ উল্লেখ করেছেন।',
              ref:
                  'তাখরীজ: ( বুখারীঃ তা.পা ৩, ৩৩৯২, ৪৯৫৩, ৪৯৫৫, ৪৯৫৬, ৪৯৫৭, ৬৯৮২; মুসলিম ১/৭৩ হাঃ ১৬০, আহমদ ২৬০১৮ ( আ.প্রঃ ৩, ইঃফাঃ ৩)।'),
          HadisNumberModel(
              id: '৪।',
              name:
                  ' মূসা ইবনু ইসমাঈল (রহঃ) ... ইবনু আব্বাস (রাঃ) থেকে বর্ণিত, মহান আল্লাহর বাণীঃ তাড়াতাড়ি ওহী আয়ত্ত করার জন্য আপনার জিহ্বা তার সাথে নাড়বেন না’ (৭৫:১৬) এর ব্যাখ্যায় তিনি বলেন, রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ওহী নাযিলের সময় তা আয়ত্ত করতে বেশ কষ্ট স্বীকার করতেন এবং প্রায়ই তিনি তাঁর উভয় ঠোঁট নাড়াতেন। ইবনু আব্বাস (রাঃ) বলেন, আমি তোমাকে দেখানোর জন্য ঠোঁট দুটি নাড়ছি যেভাবে রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নাড়াতেন। ’সা’ঈদ (রহঃ) (তাঁর শাগরিদদের) বললেন, আমি ইবনু ’আব্বাস (রাঃ)-কে যেভাবে তাঁর ঠোঁট দুটি নাড়াতে দেখেছি, সেভাবেই আমার ঠোঁট দুটি নাড়াচ্ছি। ’ এই বলে তিনি তাঁর ঠোঁট দুটি নাড়ালেন। এ সম্পর্কে আল্লাহ্ তা’আলা নাযিল করলেনঃ “তাড়াতাড়ি ওহী আয়ত্ত করার জন্য আপনি আপনার জিহবা তার সাথে নাড়াবেন না। এর সংরক্ষণ ও পাঠ করানোর দায়িত্ব আমারই। ” (৭৫:১৬-১৮)ইবনু আব্বাস (রাঃ) বলেন এর অর্থ হলঃ আপনার অন্তরে তা সংরক্ষণ করা এবং আপনার দ্বারা তা পাঠ করানো। সুতরাং যখন আমি তা পাঠ করি আপনি সে পাঠের অনুসরণ করুন (৭৫:১৯) ইবনু আব্বাস (রাঃ) বলেন অর্থাৎ মনোযোগ সহকারে শুনুন এবং চুপ থাকুন। এরপর এর বিশদ ব্যাখ্যার দায়িত্ব আমারই (৭৫:১৯)। ’ অর্থাৎ আপনি তা পাঠ করবেন এটাও আমার দায়িত্ব। তারপর যখন রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে জিবরাঈল আলাইহি ওয়া সাল্লাম আসতেন, তখন তিনি মনোযোগ সহকারে কেবল শুনতেন। জিবরাঈল আলাইহি ওয়া সাল্লাম চলে গেলে তিনি যেমন পড়েছিলেন, রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও ঠিক তেমনি পড়তেন।',
              ref: ''),
          HadisNumberModel(
              id: '4',
              name:
                  '৫। আবদান (রহঃ) ও বিশর ইবনু মুহাম্মদ (রহঃ) ... ইবনু আব্বাস (রাঃ) থেকে বর্ণিত, তিনি বলেন, রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ছিলেন সর্বশ্রেষ্ঠ দাতা। রমযানে তিনি আরো বেশী দানশীল হতেন, যখন জিবরীল (আঃ) তাঁর সাথে সাক্ষাৎ করতেন। আর রমযানের প্রতি রাতেই জিবরীল (আঃ) তাঁর সাথে সাক্ষাৎ করতেন এবং তাঁরা পরস্পর কুরআন তিলাওয়াত করে শোনাতেন। নিশ্চয়ই রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রহমতের বাতাস থেকেও অধিক দানশীল ছিলেন।',
              ref: ''),
          HadisNumberModel(
              id: '4',
              name:
                  '৬। আবূল ইয়ামান হাকাম ইবনু নাফি (রহঃ) ... আবদুল্লাহ ইবনু আব্বাস (রাঃ) থেকে বর্ণনা করেন যে, আবূ সুফিয়ান ইবনু হরব তাকে বলেছেন, বাদশাহ হিরাকল একবার তাঁর কাছে লোক পাঠালেন। তিনি কুরাইশদের কাফেলায় তখন ব্যবসা উপলক্ষে সিরিয়ায় ছিলেন। সে সময় রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আবূ সুফিয়ান ও কুরাইশদের সাথে নির্দিষ্ট সময়ের জন্য সন্ধিবদ্ধ ছিলেন। আবূ সুফিয়ান তার সঙ্গীদের সহ হিরাকলের কাছে এলেন এবং তখন হিরাকল জেরুযালেমে অবস্থান করছিলেন। হিরাকল তাদেরকে তাঁর নিকটে ডাকলেন। তার পাশে তখন রোমের নেত্রীস্থানীয় ব্যাক্তিগন উপস্থিত ছিল। এরপর তাদের কাছে ডেকে নিলেন এবং দোভাষীকে ডাকলেন।তারপর জিজ্ঞাসা করলেন, এই যে ব্যাক্তি নিজেকে নবী বলে দাবী করে — তোমাদের মধ্যে বংশের দিক দিয়ে তাঁর সবচেয়ে নিকটাত্মীয় কে? আবূ সুফিয়ান বললেন, আমি বললাম, বংশের দিক দিয়ে আমিই তাঁর নিকটাত্মীয়। তিনি বললেন, তাঁকে আমার খুব কাছে নিয়ে এস এবং তাঁর সঙ্গীদেরও কাছে এনে পেছনে বসিয়ে দাও। এরপর তাঁর দোভাষীকে বললেন, তাদের বলে দাও, আমি এর কাছে সে ব্যাক্তি সম্পর্কে কিছু জিজ্ঞাসা করবো, সে যদি আমার কাছে মিথ্যা বলে, তবে সাথে সাথে তোমরা তাকে মিথ্যাবাদী বলে প্রকাশ করবে। আবূ সুফিয়ান বলেন, আল্লাহ্‌র কসম! তারা আমাকে মিথ্যাবাদী বলে প্রচার করবে-এ লজ্জা যদি আমার না থাকত, তবে অবশ্যই আমি তাঁর সম্পর্কে মিথ্যা বলতাম।এরপর তিনি তাঁর সম্পর্কে আমাকে প্রথম প্রশ্ন যে করেন তা হচ্ছে, তোমাদের মধ্যে তাঁর বংশমর্যাদা কেমন?’ আমি বললাম, তিনি আমাদের মধ্যে অতি সম্ভ্রান্ত বংশের। তিনি বললেন, তোমাদের মধ্যে এর আগে আর কখনো কি কেউ একথা বলেছে? আমি বললাম, না। তিনি বললেন, তাঁর বাপ-দাদাদের মধ্যে কি কেউ বাদশাহ ছিলেন? আমি বললাম, না। তিনি বললেন, তারা কি সংখ্যায় বাড়ছে, না কমছে? আমি বললাম, তারা বেড়েই চলেছে। তিনি বললেন, তাঁর দ্বীন গ্রহণ করার পর কেউ কি নারায হয়ে তা পরিত্যাগ করে? আমি বললাম, না। তিনি বললেন, নবূয়তের দাবীর আগে তোমরা কি কখনো তাঁকে মিথ্যার দায়ে অভিযুক্ত করেছ? আমি বললাম, না। তিনি বললেন, তিনি কি চুক্তি ভঙ্গ করেন?’ আমি বললাম, না। তবে আমরা তাঁর সঙ্গে একটি নির্দিষ্ট সময়ের চুক্তিতে আবদ্ধ আছি। জানিনা, এর মধ্যে তিনি কি করবেন।আবূ সুফিয়ান বলেন, এ কথাটুকু ছাড়া নিজের পক্ষ থেকে আর কোন কথা সংযোজনের সুযোগই আমি পাইনি। তিনি বললেন, তোমরা কি তাঁর সাথে কখনো যুদ্ধ করেছ?’ আমি বললাম, হাঁ। তিনি বললেন, তাঁর সঙ্গে তোমাদের যুদ্ধ কেমন হয়েছে?’ আমি বললাম, তাঁর ও আমাদের মধ্যে যুদ্ধের ফলাফল কুয়ার বালতির ন্যায়। কখনো তাঁর পক্ষে যায়, আবার কখনো আমাদের পক্ষে আসে। ’ তিনি বললেন, তিনি তোমাদের কিসের আদেশ দেন?’ আমি বললাম, তিনি বলেনঃ তোমরা এক আল্লাহ্‌র ইবাদত কর এবং তাঁর সঙ্গে কোন কিছুর শরীক করো না এবং তোমাদের বাপ-দাদার ভ্রান্ত মতবাদ ত্যাগ কর। আর তিনি আমাদের সালাত (নামায/নামাজ) আদায় করার, সত্য কথা বলার, নিষ্কলুষ থাকার এবং আত্মীয়দের সাথে সদ্ব্যবহার করার আদেশ দেন।তারপর তিনি দোভাষীকে বললেন, তুমি তাকে বল, আমি তোমার কাছে তাঁর বংশ সম্পর্কে জিজ্ঞাসা করেছি। তুমি তার জওয়াবে উল্লেখ করেছ যে, তিনি তোমাদের মধ্যে সম্ভ্রান্ত বংশের। প্রকৃতপক্ষে রাসূল গণকে তাঁদের কওমের উচ্চ বংশেই প্রেরণ করা হয়ে থাকে। তোমাকে জিজ্ঞাসা করেছি, এ কথা তোমাদের মধ্যে ইতিপূর্বে আর কেউ বলেছে কিনা? তুমি বলেছ, না। তাই আমি বলছি যে, আগে যদি কেউ এ কথা বলে থাকত, তবে অবশ্যই আমি বলতে পারতাম, এ এমন ব্যাক্তি, যে তাঁর পূর্বসূরীর কথারই অনুসরণ করছে। আমি তোমাকে জিজ্ঞাসা করেছি, তাঁর পূর্বপুরুষের মধ্যে কোন বাদশাহ ছিলেন কি না? তুমি তার জবাবে বলেছ, না। তাই আমি বলছি যে, তাঁর পূর্বপুরুষের মধ্যে যদি কোন বাদশাহ থাকতেন, তবে আমি বলতাম, ইনি এমন এক ব্যাক্তি যিনি তাঁর বাপ-দাদার বাদশাহী ফিরে পেতে চান।আমি তোমাকে জিজ্ঞাসা করেছি- এর আগে কখনো তোমরা তাঁকে মিথ্যার দায়ে অভিযুক্ত করেছ কি না? তুমি বলেছ, না। এতে আমি বুঝলাম, এমনটি হতে পারে না যে, কেউ মানুষের ব্যাপারে মিথ্যা ত্যাগ করবে অথচ আল্লাহ্‌র ব্যাপারে মিথ্যা কথা বলবে। আমি তোমাকে জিজ্ঞাসা করেছি, শরীফ লোক তাঁর অনুসরন করে, না সাধারণ লোক? তুমি বলেছ, সাধারণ লোকই তাঁর অনুসরণ করে। আর বাস্তবেও এরাই হন রাসূল গণের অনুসারী। আমি তোমাকে জিজ্ঞাসা করেছি, তারা সংখ্যায় বাড়ছে না কমছে? তুমি বলেছ বাড়ছে। প্রকৃতপক্ষে ঈমানে পূর্ণতা লাভ করা পর্যন্ত এ রকমই হয়ে থাকে। আমি তোমাকে জিজ্ঞাসা করেছি, তাঁরা দ্বীনে দাখিল হওয়ার পর নারায হয়ে কেউ কি তা ত্যাগ করে? তুমি বলেছ, না। ঈমানের স্নিগ্ধতা অন্তরের সাথে মিশে গেলে ঈমান এরূপই হয়। আমি তোমাকে জিজ্ঞাসা করেছি তিনি চুক্তি ভঙ্গ করেন কি না? তুমি বলেছ, না। প্রকৃতপক্ষে রাসূলগণ এরূপই, চুক্তি ভঙ্গ করেন না।আমি তোমাকে জিজ্ঞাসা করেছি তিনি তোমাদের কিসের নির্দেশ দেন। তুমি বলেছ, তিনি তোমাদের এক আল্লাহ্‌র ইবাদত করা ও তাঁর সাথে অন্য কিছুকে শরীক না করার নির্দেশ দেন। তিনি তোমাদের নিষেধ করেন মূর্তিপূজা করতে আর তোমাদের আদেশ করেন সালাত (নামায/নামাজ) আদায় করতে, সত্য কথা বলতে ও কলুষমুক্ত থাকতে। তুমি যা বলেছ তা যদি সত্য হয়, তবে শীঘ্রই তিনি আমার এ দু’পায়ের নীচের জায়গার মালিক হবেন। আমি নিশ্চিত জানতাম, তাঁর আবির্ভাব হবে; কিন্তু তিনি যে তোমাদের মধ্যে থেকে হবেন, এ কথা ভাবিনি। যদি জানতাম, আমি তাঁর কাছে পৌঁছাতে পারব, তাঁর সঙ্গে সাক্ষাৎ করার জন্য আমি যে কোন কষ্ট স্বীকার করতাম। আর আমি যদি তাঁর কাছে থাকতাম তবে অবশ্যই তাঁর দু’খানা পা ধুয়ে দিতাম। এরপর তিনি রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সেই পত্রখানি আনতে বললেন, যা তিনি দিহয়াতুল কালবীর মাধ্যমে বসরার শাসকের কাছে পাঠিয়েছিলেন। তিনি তা পাঠ করলেন। তাতে লেখা ছিলঃবিসমিল্লাহির রাহমানির রাহীম (দয়াময় পরম দয়ালু আল্লাহ্‌র নামে)। আল্লাহ্‌র বান্দা ও তাঁর রাসুল মুহাম্মদএর পক্ষ থেকে রোম সম্রাট হিরাকল এর প্রতি। --শান্তি (বর্ষিত হোক) তার প্রতি, যে হিদায়াতের অনুসরণ করে। তারপর আমি আপনাকে ইসলামের দাওয়াত দিচ্ছি। ইসলাম গ্রহণ করুন, নিরাপদে থাকবেন। আল্লাহ্ আপনাকে দ্বিগুণ পুরষ্কার দান করবেন। আর যদি মুখ ফিরিয়ে নেন, তবে সব প্রজার পাপই আপনার উপর বর্তাবে। হে আহলে কিতাব! এস সে কথার দিকে, যা আমাদের ও তোমাদের মধ্যে একই; যেন আমরা আল্লাহ্ ব্যতীত আর কারো ইবাদত না করি, কোন কিছুকেই তাঁর শরীক না করি এবং আমাদের কেউ কাউকে আল্লাহ্ ব্যতীত রব রূপে গ্রহণ না করি। যদি তারা মুখ ফিরিয়ে নেয়, তবে বলো, তোমরা সাক্ষী থাক, আমরা মুসলিম’ (৩:৬৪)।আবূ সুফিয়ান বলেন, হিরাকল যখন তাঁর বক্তব্য শেষ করলেন এবং পত্র পাঠও শেষ করলেন, তখন সেখানে শোরগোল পড়ে গেল, চীৎকার ও হৈ-হল্লা তুঙ্গে উঠল এবং আমাদের বের করে দেওয়া হল। আমাদের বের করে দিলে আমি আমার সঙ্গীদের বললাম, আবূ কাবশার ছেলের বিষয়তো শক্তিশালী হয়ে উঠেছে, বনূ আসফার (রোম)-এর বাদশাহও তাকে ভয় পাচ্ছে। তখন থেকে আমি বিশ্বাস করতে লাগলাম, তিনি শীঘ্রই জয়ী হবেন। অবশেষে আল্লাহ্ তা’আলা আমাকে ইসলাম গ্রহণের তওফীক দান করলেন।ইবনু নাতূর ছিলেন জেরুযালেমের শাসনকর্তা এবং হিরাকলের বন্ধু ও সিরিয়ার খৃষ্টানদের পাদ্রী। তিনি বলেন, হিরাকল যখন জেরুযালেম আসেন, তখন একদিন তাঁকে বিমর্ষ দেখাচ্ছিল। তাঁর একজন বিশিষ্ট সহচর বলল, আমরা আপনার চেহারা আজ বিবর্ণ দেখতে পাচ্ছি, ইবনু নাতূর বলেন, হিরাকল ছিলেন জ্যোতিষী, জ্যোতির্বিদ্যায় তাঁর দক্ষতা ছিল। তারা জিজ্ঞাসা করলে তিনি তাদের বললেন, আজ রাতে আমি তারকারাজির দিকে তাকিয়ে দেখতে পেলাম, খতনাকারীদের বাদশাহ আবির্ভূত হয়েছেন। বর্তমান যুগে কোন্ জাতি খতনা করে?’ তারা বলল, ইয়াহূদী ছাড়া কেউ খতনা করে না। কিন্তু তাদের ব্যাপার যেন আপনাকে মোটেই চিন্তিত না করে। আপনার রাজ্যের শহরগুলোতে লিখে পাঠান, তারা যেন সেখানকার সকল ইয়াহূদীকে হত্যা করে ফেলে। তারা যখন এ ব্যাপারে ব্যতিব্যস্ত ছিল, তখন হিরাকলের কাছে এক ব্যাক্তিকে উপস্থিত করা হল, যাকে গাসসানের শাসনকর্তা পাঠিয়েছিল। সে রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সম্পর্কে খবর দিচ্ছিল। হিরাকল তার কাছ থেকে খবর জেনে নিয়ে বললেন, তোমরা একে নিয়ে গিয়ে দেখ, তার খতনা হয়েছে কি-না। তারা তাকে নিয়ে দেখে এসে সংবাদ দিল, তার খতনা হয়েছে।হিরাকল তাকে আরবদের সম্পর্কে জিজ্ঞাসা করলেন। সে জওয়াব দিল, তারা খতনা করে। তারপর হিরাকল তাদের বললেন, ইনি [রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম] এ উম্মতের বাদশাহ। তিনি আবির্ভূত হয়েছেন। এরপর হিরাকল রোমে তাঁর বন্ধুর কাছে লিখলেন। তিনি জ্ঞানে তাঁর সমকক্ষ ছিলেন। পরে হিরাকল হিমস চলে গেলেন। হিমসে থাকতেই তাঁর কাছে তাঁর বন্ধুর চিঠি এলো, যা রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর আবির্ভাব এবং তিনই যে প্রকৃত নবী, এ ব্যাপারে হিরাকলের মতকে সমর্থন করছিল। তারপর হিরাকল তাঁর হিমসের প্রাসা’দ রোমের নেতৃস্থানীয় ব্যাক্তিদের ডাকলেন এবং প্রাসা’দর সব দরজা বন্ধ করে দেওয়ার নির্দেশ দিলেন। দরজা বন্ধ করা হল। তারপর তিনি সামনে এসে বললেন, হে রোমবাসী! তোমরা কি কল্যাণ, হিদায়ত এবং তোমাদের রাষ্ট্রের স্থায়িত্ব চাও? তাহলে এই নবী র রায় আত গ্রহণ কর।এ কথা শুনে তারা জংলী গাধার মত ঊর্ধ্বশ্বাসে দরজার দিকে ছুটল, কিন্তু তারা তা বন্ধ অবস্থায় পেল। হিরাকল যখন তাদের অনীহা লক্ষ্য করলেন এবং তাদের ঈমান থেকে নিরাশ হয়ে গেলেন, তখন বললেন, ওদের আমার কাছে ফিরিয়ে আন। তিনি বললেন, আমি একটু আগে যে কথা বলেছি, তা দিয়ে তোমরা তোমাদের দ্বীনের উপর কতটুকু অটল, কেবল তার পরীক্ষা করেছিলাম। এখন আমি তা দেখে নিলাম। একথা শুনে তারা তাঁকে সিজদা করল এবং তাঁর প্রতি সন্তুষ্ট হল। এই ছিল হিরাকল এর শেষ অবস্থা।আবূ আবদুল্লাহ [বুখারী (রহঃ)] বলেন, সালেহ ইবনু কায়সান (রহঃ), ইউনুস (রহঃ) ও মা’মার (রহঃ) এ হাদীস যুহরী (রহঃ) থেকে রিওয়ায়েত করেছেন।',
              ref: ''),
        ]),
  ];
  List<PorichedModel> chapterTwo = [
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২',
        name: 'রাসুলুল্লাহ (ﷺ) এর বাণীঃ ইসলামের ভিত্তি পাঁচটি',
        hadisNumberList: [
          HadisNumberModel(
              id: '৭',
              name:
                  'রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর বাণীঃ ইসলামের ভিত্তি পাঁচটিঃ মৌখিক স্বীকৃতি (ইয়াকীনসহ) এবং কর্মই ঈমান এবং তা বাড়ে ও কমে। আল্লাহ্‌ তা\'আলা ইরশাদ করেনঃ যাতে তারা তাদের ঈমানের সাথে ঈমান দৃঢ় করে নেয় (৪৮ : ৪)। আমরা তাদের সৎ পথে চলার শক্তি বাড়িয়ে দিয়েছিলাম। (১৮ঃ ১৩)। এবং যারা সৎপথে চলে আল্লাহ্‌ তাদের অধিক হেদায়াত দান করেন (১৯ঃ ৭৬)। এবং যারা সৎপথ অবলম্বন করে আল্লাহ্‌ তাদের অধিক হেদায়াত বাড়িয়ে দেন এবং তাদের সৎপথে চলার শক্তি বাড়িয়ে দেন (৪৭ঃ ১৭), যাতে মু মিনদের ঈমান বেড়ে যায় (৭৪ঃ ৩১)। আল্লাহ্‌ তা\'আলা আরো ইরশাদ করেন, এটা তোমাদের মধ্যে কার ঈমান বাড়িয়ে দিল? যারা মু\'মিন এ তো তাদের ঈমান বাড়িয়ে দেয়। (৯ঃ ১২৪) এবং তাঁর বাণীঃ (فَاخْشَوْهُمْ فَزَادَهُمْ إِيمَانًا) "সুতরাং তোমরা তাদের ভয় কর; আর এটা তাদের ঈমান বাড়িয়ে দিয়েছিল" (৩ঃ ২৭৩)। (وَمَا زَادَهُمْ إِلاَّ إِيمَانًا وَتَسْلِيمًا) "আর এতে তাদের ঈমান ও আনুগত্য বাড়লো।" (৩৩ঃ ২২)। আর আল্লাহ্‌র জন্য ভালবাসা ও আল্লাহ্‌র জন্য ঘৃণা করা ঈমানের অংশ।উমর ইবনু আবদুল আযীয (রহঃ) আদী ইবনু আদী (রহঃ) এর কাছে এক পত্রে লিখেছিলেন, ‘ঈমানের কতকগুলো ফরয, কতকগুলো হুকুম-আহকাম, বিধি-নিষেধ এবং সুন্নাত রয়েছে। যে এগুলো পরিপূর্ণরূপে আদায় করে তার ঈমান পূর্ণ হয়। আর যে এগুলো পূর্ণভাবে আদায় করে না, তার ঈমান পূর্ণ হয় না। আমি যদি বেঁচে থাকি তবে অচিরেই এগুলো তোমাদের নিকট বর্ণনা করব, যাতে তোমরা তার উপর ‘আমল করতে পার। আর যদি আমার মৃত্যু হয় তাহলে জেনে রাখ, তোমাদের সাহচর্যে থাকার জন্য আমি লালায়িত নই।ইবরাহীম (‘আ.) বলেন, (وَلَكِنْ لِيَطْمَئِنَّ قَلْبِي) ‘তবে এ তো কেবল চিত্ত প্রশান্তির জন্য’- (২ঃ ২৬০)। মু‘আয (রাঃ) বলেন, ‘এসো আমাদের সঙ্গে বস, কিছুক্ষণ ঈমানের আলোচনা করি।’ ইবনু মাস‘ঊদ (রাঃ) বলেন, ‘ইয়াকীন হল পূর্ণ ঈমান।’ ইবনু ‘উমার (রাঃ) বলেন, ‘বান্দা প্রকৃত তাকওয়ায় পৌঁছতে পারে না, যতক্ষণ পর্যন্ত সে, মনে যে বিষয় সন্দেহের সৃষ্টি করে, তা পরিত্যাগ না করে।’ মুজাহিদ (রহঃ) এ আয়াতের ব্যাখ্যায় বলেন, অর্থাৎ হে মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম! আমি আপনাকে এবং নূহকে একই ধর্মের আদেশ করেছি। ইবনু ‘আব্বাস (রাঃ) বলেন, (شِرْعَةً وَمِنْهَاجًا) অর্থাৎ পথ ও পন্থা—এবং তোমাদের দু\'আ অর্থাৎ তোমাদের ঈমান।৭। উবায়দুল্লাহ্ ইবনু মূসা (রহঃ) ... ইবনু উমর (রাঃ) থেকে বর্ণিত, তিনি বলেন, রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেন, ইসলামের ভিত্তি পাঁচটি।১। আল্লাহ্ ছাড়া ইলাহ্ নেই এবং নিশ্চয় মুহাম্মদ আল্লাহ্‌র রাসূল-এ কথার সাক্ষ্য দান।২। সালাত (নামায/নামাজ) কায়েম করা৩। যাকাত দেওয়া৪। হাজ্জ (হজ্জ) করা এবং ৫। রামাদান এর সিয়াম পালন করা।',
              ref: 'ref'),
        ]),
    PorichedModel(id: 'পরিচ্ছেদঃ ৩', name: 'ঈমানের বিষয়সমূহ', hadisNumberList: [
      HadisNumberModel(
          id: '৮। ',
          name:
              'আল্লাহ্ তা‘আলার বাণীঃ পূর্ব এবং পশ্চিম দিকে তোমাদের মুখ ফেরানোতে কোন কল্যাণ নেই; কিন্তু কল্যাণ আছে কেউ ঈমান আনলে আল্লাহ তা\'আলার উপর, আখিরাত, ফেরেশতাগণ, কিতাবসমূহ ও নবীগণের উপর ঈমান আনলে এবং আল্লাহ্‌র মুহাব্বতে আত্মীয়-স্বজন, ইয়াতিম, অভাভগ্রস্থ, মুসাফির, সাহায্য-প্রার্থীদের এবং দাসত্ব মোচনের জন্য সম্পদ দান করলে, সালাত কায়িম করলে ও যাকাত দিলে এবং ওয়াদা দিয়ে তা পূরণ করলে, অর্থসংকটে, দুঃখ-কষ্টে ও যুদ্ধকালে ধৈর্য ধারণ করলে। তারাই সত্যপরায়ণ, ও তারা মুত্তাকী’’- (২ঃ ১৭৭)। (... قَدْ أَفْلَحَ الْمُؤْمِنُونَ) ‘‘অবশ্যই সফলকাম হয়েছে মু\'মিনগণ, যারা বিনয়-নম্র নিজেদের সালাতে ... (২৩ঃ ১-২)আবদুল্লাহ ইবনু জু’ফী (রহঃ) ... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, রাসুল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেন, ঈমানের শাখা রয়েছে ষাটের কিছু বেশি। আর লজ্জা ঈমানের একটি শাখা।',
          ref: ''),
    ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৪',
        name:
            'প্রকৃত মুসলিম সে-ই, যার জিহ্বা ও হাত থেকে অন্য মুসলিম নিরাপদ থাকে',
        hadisNumberList: [
          HadisNumberModel(
              id: '৯।',
              name:
                  ' আদম ইবনু ইয়াস (রহঃ) ... আবদুল্লাহ ইবনু আমর (রাঃ) থেকে বর্ণিত, রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেন, প্রকৃত মুসলিম সে-ই, যার জিহ্বা ও হাত থেকে সকল মুসলিম নিরাপদ থাকে এবং প্রকৃত মুহাজির সে-ই, যে আল্লাহ্ তা’আলার নিষিদ্ধ কাজ ত্যাগ করে।আবূ আবদুল্লাহ (রহঃ) বলেন, আবূ মু’আবিয়া (রহঃ) বলেছেন, আমার কাছে দাউদ ইবনু আবূ হিন্দ (রহঃ) আমির (রহঃ) সূত্রে বর্ণনা করেছেনঃ তিনি বলেছেন যে, আমি আবদুল্লাহ ইবনু আমর (রাঃ) কে রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে হাদীস বর্ণনা করতে শুনেছি এবং আবদুল আ’লা (রহঃ) দাউদ (রহঃ) থেকে, দাউদ (রহঃ) আমির (রহঃ) থেকে, আমির (রহঃ) আবদুল্লাহ (রাঃ) থেকে, তিনি রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে হাদীস বর্ণনা করেছেন।',
              ref: ''),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৫',
        name: ' ইসলামে কোন কাজটি উত্তম',
        hadisNumberList: [
          HadisNumberModel(
              id: '১০।',
              name:
                  ' সা’ঈদ ইবনু ইয়াহ্ইয়া ইবনু সা’ঈদ আল উমাবী আল কুরাশী (রহঃ) ... আবূ মূসা (রাঃ) থেকে বর্ণিত, তিনি বলেন, সাহাবায়ে কিরাম জিজ্ঞাসা করলেন, ইয়া রাসুলাল্লাহ! ইসলামে কোন্ কাজটি উত্তম? তিনি বললেনঃ যার জিহ্বা ও হাত থেকে মুসলিমগণ নিরাপদ থাকে।',
              ref: ''),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৬  ',
        name: 'খাবার খাওয়ানো ইসলামী গুন',
        hadisNumberList: [
          HadisNumberModel(
              id: '১১।',
              name:
                  '  অমর ইবনু খালিদ (রহঃ) ... আবদুল্লাহ ইবনু আমর (রাঃ) থেকে বর্ণনা করেন, এক ব্যাক্তি রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে জিজ্ঞাসা করল, ইসলামের কোন কাজটি উত্তম? তিনি বললেন, তুমি খাবার খাওয়াবে ও পরিচিত অপরিচিত সবাইকে সালাম দিবে।',
              ref: ''),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৭ ',
        name: ' নিজের জন্য যা পছন্দনীয়, ভাইয়ের জন্যও তা পছন্দ করা ঈমানের অংশ',
        hadisNumberList: [
          HadisNumberModel(
              id: '১২। ',
              name:
                  'মূসা’দ্দাদ (রহঃ) ও হুসাইন আল মু\'আল্লিম (রহঃ) ... আনাস (রাঃ) থেকে বর্ণিত, রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেনঃ তোমাদের কেউ প্রকৃত মু’মিন হবে না, যতক্ষণ না সে তার ভাইয়ের জন্য তা-ই পছন্দ করবে, যা নিজের জন্য পছন্দ করে। ',
              ref: ''),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৮ ',
        name: ' রাসুলুল্লাহ (ﷺ)-কে ভালোবাসা ঈমানের অঙ্গ',
        hadisNumberList: [
          HadisNumberModel(
              id: '১৩।',
              name:
                  ' আবূল ইয়ামান (রহঃ) ... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেনঃ সেই পবিত্র সত্তার কসম, যাঁর হাতে আমার প্রাণ, তোমাদের কেউ প্রকৃত মু’মিন হতে পারবে না, যতক্ষণ না আমি তার কাছে তার পিতা ও সন্তানের চেয়ে বেশি প্রিয় হই। ',
              ref: ''),
          HadisNumberModel(
              id: '১৪।',
              name:
                  ' ইয়া’কুব ইবনু ইবরাহীম ও আদম (রহঃ) ... আনাস (রাঃ) থেকে বর্ণিত, রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেনঃ তোমাদের কেউ মু’মিন হতে পারবে না, যতক্ষন না আমি তার কাছে তার পিতা, সন্তান ও সব মানুষের চেয়ে বেশী প্রিয় হই। ',
              ref: ''),
        ]),
    PorichedModel(id: 'পরিচ্ছেদঃ ৯ ', name: ' ঈমানের স্বাদ', hadisNumberList: [
      HadisNumberModel(
          id: '১৫।',
          name:
              ' মুহাম্মদ ইবনুল মূসান্না (রহঃ) ... আনাস (রাঃ) থেকে বর্ণিত, রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেনঃ তিনটি গুণ যার মধ্যে থাকে, সে ঈমানের স্বাদ পায়। ১। আল্লাহ্ ও তাঁর রাসূল তার কাছে অন্য সব কিছুর থেকে প্রিয় হওয়া; ২। কাউকে খালিস আল্লাহ্‌র জন্যই মুহব্বত করা; ৩। কুফ্‌রীতে ফিরে যাওয়াকে আগুনে নিক্ষিপ্ত হওয়ার মত অপছন্দ করা। ',
          ref: ''),
    ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১০ ',
        name: ' আনসারকে ভালোবাসা ঈমানের লক্ষণ',
        hadisNumberList: [
          HadisNumberModel(
              id: '১৬।',
              name:
                  ' আবূল ওয়ালীদ (রহঃ) ... আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত, রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেনঃ ঈমানের চিহ্ন হল আনসারকে ভালবাসা এবং মুনাফিকীর চিহ্ন হল আনসারদের প্রতি বিদ্বেষ পোষণ করা। ',
              ref: ''),
        ]),
    PorichedModel(id: 'পরিচ্ছেদঃ ১১ ', name: ' পরিচ্ছদ নেই', hadisNumberList: [
      HadisNumberModel(
          id: '১৭।',
          name:
              ' আবূল ইয়ামান (রহঃ) ... ‘আয়িনুল্লাহ্ ইবনু আবদুল্লাহ (রহঃ) বলেন, বদর যুদ্ধে অংশগ্রহণকারী ও লায়লাতুল ‘আকাবার একজন নকীব ‘উবাদা ইবনুস সামিত (রাঃ) বর্ণনা করেন, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর পার্শ্বে একজন সাহাবীর উপস্থিতিতে তিনি ইরশাদ করেনঃ তোমরা আমার কাছে এই মর্মে বায়’আত গ্রহণ কর যে, আল্লাহ্‌র সঙ্গে কিছু শরীক করবে না, চুরি করবে না, যিনা করবে না, তোমাদের সন্তানদের হত্যা করবে না, কাউকে মিথ্যা অপবাদ দেবে না এবং নেক কাজে নাফরমানী করবে না। তোমাদের মধ্যে যে তা পূরণ করবে, তার বিনিময় আল্লাহ্‌র কাছে। আর কেউ এর কোন একটিতে লিপ্ত হয়ে পড়লে এবং দুনিয়াতে তার শাস্তি পেয়ে গেলে, তবে তা হবে তার জন্য কাফ্‌ফারা। আর কেউ এর কোন একটিতে লিপ্ত হয়ে পড়লে এবং আল্লাহ্ তা অপ্রকাশিত রাখলে, তবে তা আল্লাহ্‌র ইচ্ছাধীন। তিনি যদি চান, তাকে মাফ করে দেবেন আর যদি চান, তাকে শাস্তি দেবেন। আমরা এর উপর বায়’আত গ্রহণ করলাম। ',
          ref: ''),
    ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১২  ',
        name: 'ফিতনা থেকে পলায়ন দ্বীনের অংশ',
        hadisNumberList: [
          HadisNumberModel(
              id: ' ১৮।',
              name:
                  ' আবদুল্লাহ ইবনু মাসলামা (রহঃ) ... আবূ সা’ঈদ খুদরী (রাঃ) থেকে বর্ণিত, তিনি বলেন, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ সেদিন দূরে নয়, যেদিন মুসলিমের উত্তম সম্পদ হবে কয়েকটি বকরী, যা নিয়ে সে পাহাড়ের চুড়ায় অথবা বৃষ্টিপাতের স্থানে চলে যাবে। ফিতনা থেকে বাঁচতে সে তার দ্বীন নিয়ে পালিয়ে যাবে।',
              ref: ''),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১৩ ',
        name:
            ' নাবী করীম (ﷺ) এর বাণী, আমি তোমাদের তুলনায় আল্লাহকে সম্পর্কে অধিক জ্ঞানী। আর মারেফাত (আল্লাহ্‌র পরিচয়) অন্তরের কাজ। যেমন আল্লাহ্‌ ইরশাদ করেছেনঃ কিন্তু তিনি তোমাদের অন্তরের সংকল্পের জন্য দায়ী করবেন। (২ঃ ২২৫)',
        hadisNumberList: [
          HadisNumberModel(
              id: '১৯।',
              name:
                  ' মুহাম্মদ ইবনু সালাম (রহঃ) ... ‘আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেন, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সাহাবীদের যখন কোন আমলের নির্দেশ দিতেন তখন তাঁরা যতটুকু সমর্থ্য রাখতেন ততটুকুরই নির্দেশ দিতেন। একবার তাঁরা বললেন, হে আল্লাহ্‌র রাসূল! আমরা তো আপনার মত নই। আল্লাহ্ তা’আলা আপনার পূর্ববর্তী এবং পরবর্তী সকল ত্রুটি মাফ করে দিয়েছেন। একথা শুনে তিনি রাগ করলেন, এমনকি তাঁর চেহারা মুবারকে রাগের চিহ্ন প্রকাশ পাচ্ছিল। এরপর তিনি বললেনঃ তোমাদের চাইতে আল্লাহকে আমিই বেশি ভয় করি ও বেশি জানি। ',
              ref: ''),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১৪ ',
        name:
            ' কুফরীতে ফিরে যাওয়াকে আগুনে নিক্ষিপ্ত হবার ন্যায় অপছন্দ করা ঈমানের অঙ্গ',
        hadisNumberList: [
          HadisNumberModel(
            id: '২০।',
            name:
                ' সুলায়মান ইবনু হারব (রহঃ) ... আনাস (রাঃ) থেকে বর্ণিত, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তিনটি গুণ যার মধ্যে থাকে, সে ঈমানের স্বাদ পায়—(১) যার কাছে আল্লাহ্ ও তাঁর রাসূল অন্য সব কিছু থেকে প্রিয়; (২) যে একমাত্র আল্লাহ্‌রই জন্য কোন বান্দাকে মুহব্বত করে এবং (৩) আল্লাহ্ তা’আলা কুফর থেকে মুক্তি দেওয়ার পর যে কুফর-এ ফিরে যাওয়াকে আগুনে নিক্ষিপ্ত হওয়ার মতোই অপছন্দ করে। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১৫ ',
        name: ' আমলের দিক থেকে ঈমানদারদের শ্রেষ্ঠত্বের স্তরভেদ',
        hadisNumberList: [
          HadisNumberModel(
            id: '২১। ',
            name:
                ' ইসমা’ঈল (রহঃ) ... আবূ সাঈদ খুদরী (রাঃ) থেকে বর্ণিত, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ জান্নাতীগণ জান্নাতে এবং জাহান্নামীরা জাহান্নামে প্রবেশ করবেন। পরে আল্লাহ্ তা’আলা (ফিরিশতাদের) বলবেন, যার অন্তরে একটি সরিষা পরিমানও ঈমান রয়েছে, তাকে দোযখ থেকে বের করে নিয়ে আস। তারপর তাদের দোযখ থেকে বের করা হবে এমন অবস্থায় যে, তারা (পুড়ে) কালো হয়ে গেছে। এরপর তাদের বৃষ্টিতে বা হায়াতের [বর্ণনাকারী মালিক (রহঃ) শব্দ দু’টির কোনটি এ সম্পর্কে সন্দেহ পোষণ করেছেন] নদীতে ফেলা হবে। ফলে তারা সতেজ হয়ে উঠবে, যেমন নদীর পাশে ঘাসের বীজ গজিয়ে উঠে। তুমি কি দেখতে পাওনা সেগুলো কেমন হলুদ রঙের হয় ও ঘন হয়ে গজায়? উহাইব (রহঃ) বলেন, ‘আমর (রহঃ) আমাদের কাছেحيا এর স্থলেحياة এবং خردل من ايمان এর স্থলেخردل من خير বর্ণনা করেছেন।',
            ref: '',
          ),
          HadisNumberModel(
            id: '২২।',
            name:
                '  মুহাম্মদ ইবনু উবায়দুল্লাহ্ (রহঃ) ... আবূ উমামা ইবনু সাহল ইবনু হুনাইফ (রহঃ) থেকে বর্ণিত, তিনি আবূ সাঈদ খুদরী (রাঃ)-কে বলতে শুনেছেন, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ একবার আমি ঘুমন্ত অবস্থায় (স্বপ্নে) দেখলাম যে, লোকদেরকে আমার সামনে হাযির করা হচ্ছে। আর তাদের পরণে রয়েছে জামা। কারো জামা বুক পর্যন্ত আর কারো জামা এর নীচ পর্যন্ত। আর উমর ইবনুল খাত্তাব (রাঃ)-কে আমার সামনে হাযির করা হল এমন অবস্থায় যে, তিনি তাঁর জামা (এত লম্বা যে) টেনে নিয়ে যাচ্ছিলেন। সাহাবায়ে কিরাম বললেন, ইয়া রাসূলাল্লাহ! আপনি',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১৬ ',
        name: ' লজ্জা ঈমানের অঙ্গ',
        hadisNumberList: [
          HadisNumberModel(
            id: '২৩।',
            name:
                ' আবদুল্লাহ ইবনু ইউসুফ (রহঃ) ... আবদুল্লাহ ইবনু উমর (রাঃ) থেকে বর্ণিত যে, একদিন রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক আনসারীর পাশ দিয়ে যাচ্ছিলেন। তিনি তাঁর ভাইকে তখন (অধিক) লজ্জা ত্যাগের জন্য নসীহত করছিলেন। রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে বললেনঃ ওকে ছেড়ে দাও। কারন লজ্জা ঈমানের অঙ্গ। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১৭',
        name:
            ' যদি তারা তওবা করে, সালাত কায়েম করে ও যাকাত দেয়, তবে তাদের পথ ছেড়ে দেবে (৯:৫)',
        hadisNumberList: [
          HadisNumberModel(
            id: '২৪।',
            name:
                ' আবদুল্লাহ ইবনু মুহাম্মদ আল-মুসনাদী (রহঃ) ... ইবনু উমর (রাঃ) থেকে বর্ণিত যে, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেনঃ আমি লোকদের সাথে যুদ্ধ চালিয়ে যাবার জন্য আদিষ্ট হয়েছে, যতক্ষন না তারা সাক্ষ্য দেয় যে, আল্লাহ্ ছাড়া কোন ইলাহ্ নেই ও মুহাম্মদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আল্লাহ্‌র রাসূল, আর সালাত (নামায/নামাজ) কায়েম করে ও যাকাত দেয়। তারা যদি এ কাজগুলো করে, তবে আমার পক্ষ থেকে তাদের জান ও মালের ব্যাপারে নিরাপত্তা লাভ করল; অবশ্য ইসলামের বিধান অনুযায়ী যদি কোন কারন থাকে, তাহলে স্বতন্ত্র কথা। আর তাদের হিসাবের ভার আল্লাহ্‌র ওপর ন্যাস্ত। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১৮/ ',
        name: ' যে বলে ঈমান আমলেরই নাম',
        hadisNumberList: [
          HadisNumberModel(
            id: '',
            name:
                ' আল্লাহ্ তা‘আলার এ বাণীর পরিপ্রেক্ষিতেঃ وَتِلْكَ الْجَنَّةُ الَّتِي أُورِثْتُمُوهَا بِمَا كُنْتُمْ تَعْمَلُونَ এটাই জান্নাত, তোমাদেরকে যার অধিকারী করা হয়েছে তোমাদের কর্মের ফলস্বরূপ। (সূরা যুখরুফঃ ৭২) فَوَرَبِّكَ لَنَسْأَلَنَّهُمْ أَجْمَعِينَ عَمَّا كَانُوا يَعْمَلُونَসুতরাং কসম আপনার রবের। আমি তাদের সবাইকে প্রশ্ন করবই সে বিষয়ে, যা তারা করে- (সূরাহ্ হিজরঃ ৯০)। আল্লাহ তা\'আলার এ বাণী সম্পর্কে আলিমদের এক দল বলেন, لآ إِلَهَ إِلاَّ اللهُ এর স্বীকারোক্তি সম্পর্কে প্রশ্ন করা হবে।আল্লাহ্ তা‘আলার বাণীঃ لِمِثْلِ هَذَا فَلْيَعْمَلِ الْعَامِلُونَ এরূপ সাফল্যের জন্য ‘আমলকারীদের উচিত ‘আমল করা। (সূরাহ্ সাফফাতঃ ৬১)২৫। আহমদ ইবনু ইউনুস ও মূসা ইবনু ইসমা’ঈল (রহঃ) ... আবূ হুরায়রা (রাঃ) থেকে বর্ণনা করেন, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে জিজ্ঞাসা করা হল, ‘কোন্ আমলটি উত্তম?’ তিনি বললেনঃ আল্লাহ্ ও তাঁর রাসূলের ওপর ঈমান আনা। প্রশ্ন করা হল, তারপর কোনটি? তিনি বললেনঃ আল্লাহ্‌র রাস্তায় জিহাদ করা। প্রশ্ন করা হল, তারপর কোনটি। তিনি বললেনঃ মকবূল হাজ্জ (হজ্জ)।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১৯',
        name:
            'ইসলাম গ্রহন যদি খাঁটি না হয় বরং বাহ্যিক আনুগত্য প্রদর্শনের জন্য বা হত্যার ভয়ে হয়।',
        hadisNumberList: [
          HadisNumberModel(
            id: '',
            name:
                'তবে তাঁর ইসলাম গ্রহণ মহান আল্লাহর এ বাণী অনুযায়ী হবেঃقَالَتِ الأَعْرَابُ آمَنَّا قُلْ لَمْ تُؤْمِنُوا وَلَكِنْ قُولُوا أَسْلَمْنَا ‘‘আরব মরুবাসীরা বলে, আমরা ঈমান আনলাম; আপনি বলে দিন, তোমরা ঈমান আন নি; বরং তোমরা বল, ‘আমরা বাহ্যত মুসলিম হয়েছি। (সূরা হুজরাতঃ ১৪) আর ইসলাম গ্রহণ খাঁটি হলে তা হবে আল্লাহ্ তা‘আলার এ বাণী অনুযায়ীঃ (إِنَّ الدِّينَ عِنْدَ اللَّهِ الإِسْلاَمُ) ‘‘নিশ্চয়ই ইসলাম আল্লাহর নিকট একমাত্র দ্বীন’’- (সূরাহ্ আলে ‘ইমরানঃ ১৯)। ২৬। আবূল ইয়ামান (রহঃ) ... সা’দ (রাঃ) থেকে বর্ণিত, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একদল লোককে কিছু দান করলেন। সা’দ (রাঃ) সেখানে বসা ছিলেন। সা’দ (রাঃ) বললেন, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের এক ব্যাক্তিকে কিছু দিলেন না। সে ব্যাক্তি আমার কাছে তাদের চেয়ে অধিক পছন্দনীয় ছিল। তাই আমি বললাম, ইয়া রাসূলল্লাহ্‌! অমুক ব্যাক্তিকে আপনি বাদ দিলেন কেন? আল্লাহ্‌র কসম! আমিতো তাকে মু’মিন বলেই জানি। তিনি বললেনঃ (মু’মিন) না মুসলিম? তখন আমি কিছুক্ষণ চুপ থাকলাম। তারপর আমি তার সম্পর্কে যা জানি, তা প্রবল হয়ে উঠল। তাই আমি আমার বক্তব্য আবার বললাম, আপনি অমুককে দানের ব্যপারে বিরত রইলেন? আল্লাহ্‌র কসম! আমিতো তাকে মু’মিন বলেই জানি। তিনি বললেনঃ ‘না মুসলিম?’ তখন আমি কিছুক্ষণ চুপ থাকলাম। তারপর তার সম্পর্কে যা জানি তা প্রবল হয়ে উঠল। তাই আমি আমার বক্তব্য আবার বললাম। রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আবারও সেই জবাব দিলেন। তারপর বললেনঃ ‘সা’দ! আমি কখনো ব্যাক্তি বিশেষকে দান করি, অথচ অন্য লোক আমার কাছে তার চাইতে বেশি প্রিয়। তা এ আশঙ্কায় যে (সে ঈমান থেকে ফিরে যেতে পারে পরিণামে), আল্লাহ্ তা’আলা তাকে অধোমুখে জাহান্নামে ফেলে দেবেন।এ হাদীস ইউনুস, সালিহ, মা’মার এবং যুহরী (রহঃ)-এর ভাতিজা যুহরী (রহঃ) থেকে বর্ণনা করেছেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২০',
        name: ' সালামের প্রচলন করা ইসলামের অন্তর্ভুক্ত',
        hadisNumberList: [
          HadisNumberModel(
            id: '',
            name:
                'আম্মার (রাঃ) বলেন, ‘তিনটি গুণ যে আয়ত্ত করে, সে (পূর্ণ) ঈমান লাভ করেঃ (১) নিজ থেকে ইনসাফ করা, (২) বিশ্বে সালামের প্রচলন, এবং (৩) অভাবগ্রস্থ অবস্থায়ও দান করা। ২৭। কুতায়বা (রহঃ) ... আবদুল্লাহ ইবনু ‘আমর (রাঃ) থেকে বর্ণিত, এক ব্যাক্তি রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে জিজ্ঞাসা করল, ‘ইসলামের কোন্ কাজ সবচাইতে উত্তম?’ তিনি বললেনঃ তুমি লোকদের আহার করাবে এবং পরিচিত-অপরিচিত নির্বিশেষে সকলকে সালাম দিবে। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২১',
        name: ' স্বামীর প্রতি অকৃতজ্ঞতা আর এক কুফর অন্য কুফর থেকে ছোট।',
        hadisNumberList: [
          HadisNumberModel(
            id: '',
            name:
                'এ সম্পর্কে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে আবূ সাঈদ খুদরী (রাঃ) এর সূত্রে হাদিস বর্ণিত আছে। ২৮। আবদুল্লাহ ইবনু মাসলামা (রহঃ) ... ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিত, তিনি বলেন, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেনঃ আমাকে জাহান্নাম দেখানো হয়। (আমি দেখি), তার অধিবাসীদের অধিকাংশই স্ত্রীলোক; (কারন) তারা কুফরী করে। জিজ্ঞাসা করা হল, ‘তারা কি আল্লাহর সঙ্গে কুফরী করে? তিনি বললেনঃ ‘তারা স্বামীর অবাধ্য হয় এবং ইহসান অস্বীকার করে। তুমি যদি দীর্ঘকাল তাদের কারো প্রতি ইহসান করতে থাক, এরপর সে তোমার সামান্য অবহেলা দেখলেই বলে, ‘আমি কখনো তোমার কাছ থেকে ভালো ব্যবহার পাইনি। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২২',
        name: 'পাপ কাজ জাহেলী যুগের স্বভাব',
        hadisNumberList: [
          HadisNumberModel(
            id: '',
            name:
                'আর শির্‌ক ব্যতীত অন্য কোন গুনাহ্‌তে লিপ্ত হওয়াতে ঐ পাপীকে কাফির বলা যাবে না। যেহেতু নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম [আবূ যার (রাঃ)-কে লক্ষ্য করে] বলেছেনঃ তুমি এমন ব্যক্তি, তোমার মধ্যে জাহিলী যুগের অভ্যাস রয়েছে। আর আল্লাহর বাণীঃ إِنَّ اللَّهَ لاَ يَغْفِرُ أَنْ يُشْرَكَ بِهِ وَيَغْفِرُ مَا دُونَ ذَلِكَ لِمَنْ يَشَاءُ আল্লাহ্ তাঁর সাথে অংশীদার স্থাপন করার গুনাহ ক্ষমা করেন না। এছাড়া অন্যান্য গুনাহ যাকে ইচ্ছা ক্ষমা করেন। (সূরা আন-নিসাঃ ৪৮)২৯। ‘আবদুর রহমান ইবনুল মুবারক (রহঃ) ... আহনাফ ইবনু কায়স (রহঃ) থেকে বর্ণিত, তিনি বলেন, আমি (সিফফীনের যুদ্ধে) এ ব্যক্তিকে [আলী (রাঃ)-কে] সাহায্য করতে যাচ্ছিলাম। আবূ বাক্‌রা (রাঃ)-এর সাথে আমার সাক্ষাত হলে তিনি বললেনঃ ‘তুমি কোথায় যাচ্ছে?’ আমি বললাম, ‘আমি এ ব্যক্তিকে সাহায্য করতে যাচ্ছি। তিনি বললেনঃ ‘ফিরে যাও। কারন আমি রাসূলুল্লাহ্‌ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে বলতে শুনেছি যে, দু’জন মুসলিম তাদের তরবারি নিয়ে মুখোমুখি হলে হত্যাকারী এবং নিহত ব্যক্তি উভয়ে জাহান্নামে যাবে। আমি বললাম, ‘ইয়া রাসূলাল্লাহ্‌! এ হত্যাকারী (তো অপরাধী), কিন্তু নিহত ব্যক্তির কি অপরাধ? তিনি বললেন, (নিশ্চয়ই) সে তার সঙ্গীকে হত্যা করার জন্য উদগ্রীব ছিল। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '৩০।',
            name:
                ' সুলায়মান ইবনু হারব (রহঃ) ... মা’রূর (রহঃ) থেকে বর্ণিত আছে, তিনি বলেনঃ আমি একবার রাবাযা নামক স্থানে আবূ যর (রাঃ) এর সাথে সাক্ষাৎ করলাম। তখন তাঁর পরনে ছিল এক জোড়া কাপড় (লুঙ্গি ও চাঁদর) আর তাঁর চাকরের পরনেও ছিল ঠিক একই ধরনের এক জোড়া কাপড়। আমি তাঁকে এর (সমতার) কারন জিজ্ঞাসা করলাম। তিনি বললেনঃ একবার আমি এক ব্যাক্তিকে গালি দিয়েছিলাম এবং আমি তাকে তার মা সম্পর্কে লজ্জা দিয়েছিলাম। তখন রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে বললেনঃ ‘আবূ যর! তুমি তাকে তার মা সম্পর্কে লজ্জা দিয়েছ? তুমি তো এমন ব্যাক্তি, তোমার মধ্যে এখনো জাহিলী যুগের স্বভাব রয়েছে। জেনে রেখো, তোমাদের দাস-দাসী তোমাদেরই ভাই। আল্লাহ্ তা’আলা তাদের তোমাদের অধীনস্থ করে দিয়েছেন। তাই যার ভাই তার অধীনে থাকবে, সে যেন নিজে যা খায় তাকে তা-ই খাওয়ায় এবং নিজে যা পরে, তাকে তা-ই পরায়। তাদের উপর এমন কাজ চাপিয়ে দিও না, যা তাদের জন্য খুব কষ্টকর। যদি এমন কষ্টকর কাজ করতে দাও, তাহলে তোমরাও তাদের সে কাজে সাহায্য করবে। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২৩',
        name: ' যুলুমের প্রকারভেদ',
        hadisNumberList: [
          HadisNumberModel(
            id: '',
            name:
                '৩১। আবূল ওয়ালীদ এবং বিশ্‌র (রহঃ) ... আবদুল্লাহ‌ ইবনু মাসউদ (রাঃ) থেকে বর্ণনা করেনঃ (‏الَّذِينَ آمَنُوا وَلَمْ يَلْبِسُوا إِيمَانَهُمْ بِظُلْمٍ‏) “যারা ঈমান এনেছে এবং তাদের ঈমানকে যুলুম দ্বারা কলুষিত করেনি” (৬ঃ ৮২) এ আয়াত নাযিল হলে রাসূলুল্লাহ্‌ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাহাবিগণ বললেন, ‘আমাদের মধ্যে এমন কে আছে যে যুলুম করে নি?’ তখন আল্লাহ্‌ তা’আলা এ আয়াত নাযিল করেনঃ (إِنَّ الشِّرْكَ لَظُلْمٌ عَظِيمٌ) “নিশ্চয়ই শির্‌ক চরম যুলুম।” (৩১ঃ ১৩) ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২৪ ',
        name: ' মুনাফিকের আলামত',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ৩২।',
            name:
                ' সুলায়মান আবূর রাবী’ (রহঃ) ... আবূ হুরায়রা (রাঃ) থেকে বর্ণনা করেন, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেনঃ মুনাফিকের আলামত তিনটিঃ ১. যখন কথা বলে মিথ্যা বলে ২. যখন ওয়াদা করে ভঙ্গ করে এবং ৩. আমানত রাখা হলে খেয়ানত করে।',
            ref: '',
          ),
          HadisNumberModel(
            id: '৩৩। ',
            name:
                'কাবীসা ইবনু ‘উকবা (রহঃ) ... আবদুল্লাহ‌ ইবনু ‘আমর (রাঃ) থেকে বর্ণিত, নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ চারটি স্বভাব যার মধ্যে থাকে সে হবে খাঁটি মুনাফিক। যার মধ্যে এর কোন একটি স্বভাব থাকবে, তা পরিত্যাগ না করা পর্যন্ত তার মধ্যে মুনাফিকের একটি স্বভাব থেকে যায়।১. আমানত রাখা হলে খেয়ানত করে২. কথা বললে মিথ্যা বলে৩. চুক্তি করলে ভঙ্গ করে এবং৪. বিবাদে লিপ্ত হলে অশ্লীল গালি দেয়।শু’বা (রহঃ) আ’মাশ (রহঃ) থেকে হাদীস বর্ণনায় সুফিয়ান (রহঃ) এর অনুসরণ করেছেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২৫',
        name: ' লায়লাতুল কদরে ইবাদতে রাত্রি জাগরণ ঈমানের অন্তর্ভুক্ত',
        hadisNumberList: [
          HadisNumberModel(
            id: '৩৪।',
            name:
                '  আবূল ইয়ামান (রহঃ) ... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, তিনি বলেন, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেনঃ যে ব্যাক্তি ঈমানের সাথে সওয়াবের আশায় লায়লাতুল কদর-এ ইবাদতে রাত্রি জাগরণ করবে, তার অতীতের গুনাহ্ মাফ করে দেওয়া হবে।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২৬',
        name: ' জিহাদ ঈমানের অন্তর্ভুক্ত',
        hadisNumberList: [
          HadisNumberModel(
            id: '',
            name:
                ' ৩৫। হারামীয়া ইবনু হাফস (রহঃ) .... আবূ যুর’আ ইবনু ‘আমর ইবনু জারীর (রহঃ) থেকে বর্ণনা করেন, তিনি বলেন, আমি আবূ হুরায়রা (রাঃ)-কে রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণনা করতে শুনেছি যে, তিনি ইরশাদ করেনঃ যে ব্যাক্তি আল্লাহর রাস্তায় বের হয়, যদি সে শুধু আল্লাহর উপর ঈমান এবং তাঁর রাসূলগণের প্রতি বিশ্বাসের কারনে বের হয়ে থাকে, তবে আল্লাহ্ তা’আলা ঘোষণা দেন যে, আমি তাকে ঘরে ফিরিয়ে আনব তার সওয়াব বা গনীমত (ও সওয়ার) সহ কিংবা তাকে জান্নাতে দাখিল করব। আর আমার উম্মতের উপর কষ্টদায়ক হবে বলে যদি মনে না করতাম তবে কোন সেনাদলের সাথে না গিয়ে বসে থাকতাম না। আমি অবশ্যই এটা পছন্দ করি যে, আল্লাহর রাস্তায় শহীদ হই, আবার জীবিত হই, আবার শহীদ হই, আবার জীবিত হই, আবার শহীদ হই।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২৭',
        name: ' রমযানের রাতে নফল ইবাদত ঈমানের অঙ্গ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৩৬।',
            name:
                ' ইসমা’ঈল (রহঃ) ... আবূ হুরায়রা (রাঃ) থেকে বর্ণনা করেন, তিনি বলেন, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেনঃ যে ব্যাক্তি রমযানের রাতে সওয়াবের আশায় রাত জেগে ইবাদত করে, তার পূর্বের গুনাহ্ মাফ করে দেওয়া হয়। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২৮ ',
        name: 'সওয়াবের আশায় রমযানের সিয়াম পালন ঈমানের অঙ্গ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৩৭। ',
            name:
                'ইবনু সালাম (রহঃ) ... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, তিনি বলেন, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেনঃ যে ব্যাক্তি ঈমানসহ সওয়াবের আশায় রমযানের সিয়াম পালন করে, তার পূর্বের গুনাহ মাফ করে দেওয়া হয়। ',
            ref: '',
          ),
        ]),
    PorichedModel(id: 'পরিচ্ছেদঃ ২৯ ', name: ' দ্বীন সহজ', hadisNumberList: [
      HadisNumberModel(
        id: '',
        name:
            'নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর বাণীঃ আল্লাহর নিকট সবচাইতে পসন্দনীয় হল দীন-ই হানীফিয়্যা যা সহজ সরল। ৩৮। আবদুস সালাম ইবনু মুতাহ্‌হার (রহঃ) ... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেনঃ নিশ্চয়ই দ্বীন সহজ-সরল। দ্বীন নিয়ে যে কড়াকড়ি করে দ্বীন তার উপর বিজয়ী হয়। কাজেই তোমরা মধ্যপন্থা অবলম্বন কর এবং (মধ্যপন্থার) নিকটবর্তী থাক, আশান্বিত থাক এবং সকাল-সন্ধ্যায় ও রাতের কিছু অংশে (ইবাদতের মাধ্যমে) আল্লাহর সাহায্য প্রার্থনা কর। ',
        ref: '',
      ),
    ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩০ ',
        name: 'সালাত ঈমানের অন্তর্ভুক্ত',
        hadisNumberList: [
          HadisNumberModel(
            id: '',
            name:
                ' আর আল্লাহর বাণীঃ (وَمَا كَانَ اللَّهُ لِيُضِيعَ إِيمَانَكُمْ) আল্লাহ এরূপ নন যে তোমাদের ঈমান ব্যর্থ করবেন- (সূরা আল-বাক্বারাঃ ১৪৩)। অর্থাৎ বায়তুল্লাহর নিকট (বায়তুল মুকাদ্দাসমুখী হয়ে) আদায় করা তোমাদের সালাতকে তিনি নষ্ট করবেন না।৩৯। ‘আমর ইবনু খালিদ (রহঃ) ... বারা ইবনু ‘আযিব (রাঃ) থেকে বর্ণিত যে, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মদিনায় হিজরত করে সর্বপ্রথম আনসারদের মধ্যে তাঁর নানাদের গোত্র [আবূ ইসহাক (রহঃ) বলেন] বা মামাদের গোত্রে এসে ওঠেন। তিনি ষোল-সতের মাস বায়তুল মুকাদ্দসের দিকে সালাত (নামায/নামাজ) আদায় করেন। কিন্তু তাঁর পছন্দ ছিল যে, তাঁর কিবলা বায়তুল্লাহ্‌র দিকে হোক। আর তিনি (বায়তুল্লাহ্‌র দিকে) প্রথম যে সালাত (নামায/নামাজ) আদায় করেন, তা ছিল আসরের সালাত (নামায/নামাজ) এবং তাঁর সঙ্গে একদল লোক উক্ত সালাত (নামায/নামাজ) আদায় করেন। তাঁর সঙ্গে যাঁরা সালাত (নামায/নামাজ) আদায় করেছিলেন তাঁদের একজন লোক বের হয়ে এক মসজিদে মুসল্লীদের কাছ দিয়ে যাচ্ছিলেন, তাঁরা তখন রুকু’র অবস্থায় ছিলেন।তখন তিনি বললেনঃ “আমি আল্লাহকে সাক্ষী রেখে বলছি যে, এইমাত্র আমি রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে মক্কার দিকে ফিরে সালাত (নামায/নামাজ) আদায় করে এসেছি। তখন তাঁরা যে অবস্থায় ছিলেন সে অবস্থায়ই বায়তুল্লাহ্‌র দিকে ঘুরে গেলেন। রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন বায়তুল মুকাদ্দাসের দিকে সালাত (নামায/নামাজ) আদায় করতেন তখন ইয়াহূদীদের ও আহলি কিতাবদের কাছে এটা খুব ভাল লাগত; কিন্তু তিনি যখন বায়তুল্লাহ্‌র দিকে (সালাত (নামায/নামাজ)-এর জন্য) তাঁর মুখ ফিরালেন তখন তারা এর প্রতি চরম অসন্তুষ্ট হল।যুহায়র (রহঃ) বলেন, আবূ ইসহাক (রহঃ) বারা (রাঃ) থেকে আমার কাছে যে হাদীস বর্ণনা করেছেন, তাতে এ কথাও রয়েছে যে, কিবলা পরিবর্তনের পূর্বে বেশ কিছু লোক ইন্তেকাল করেছিলেন এবং শহীদ হয়েছিলেন, তাঁদের ব্যাপারে আমরা কি বলব, বুঝতে পারছিলাম না, তখন আল্লাহ্ তা’আলা নাযিল করেনঃ (وَمَا كَانَ اللَّهُ لِيُضِيعَ إِيمَانَكُمْ) “আল্লাহ্ তা’আলা তোমাদের সালাত (নামায/নামাজ)-কে (যা বায়তুল মুকাদ্দাসের দিকে আদায় করা হয়েছিল) বিনষ্ট করবেন না।”',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩১',
        name: ' উত্তমরূপে ইসলাম গ্রহন',
        hadisNumberList: [
          HadisNumberModel(
            id: '',
            name:
                'মালিক (রহঃ) ... আবূ সা’ঈদ খুদরী (রাঃ) বর্ণনা করেন যে, তিনি রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে বলতে শুনেছেন, বান্দা যখন ইসলাম গ্রহণ করে এবং তার ইসলাম উত্তম হয়, আল্লাহ্ তা’আলা তার আগের সব গুনাহ্ মাফ করে দেন। এরপর শুরু হয় প্রতিদান; একটি সৎ কাজের বিনিময়ে দশ গুণ থেকে সাতশ গুণ পর্যন্ত; আর একটি মন্দ কাজের বিনিময়ে ঠিক ততটুকু মন্দ প্রতিফল। অবশ্য আল্লাহ্ যদি মাফ করে দেন তবে ভিন্ন কথা।৪০। ইসহাক ইবনু মানসূর (রহঃ) ... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ্‌ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেনঃ তোমাদের মধ্যে কেউ যখন উত্তমরূপে ইসলামের উপর কায়েম থাকে তখন সে যে নেক আমল করে তার প্রত্যেকটির বিনিময়ে সাতশ গুণ পর্যন্ত (সওয়াব) লেখা হয়। আর সে যে মন্দ কাজ করে তার প্রত্যেকটির বিনিময়ে তার জন্য ঠিক ততটুকুই মন্দ লেখা হয়। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩২ ',
        name:
            'আল্লাহ্‌ তা\'আলার কাছে সবচাইতে পছন্দনীয় আমল সেটাই যা নিয়মিত করা হয়',
        hadisNumberList: [
          HadisNumberModel(
            id: '৪১।',
            name:
                ' মুহাম্মদ ইবনুল মূসান্না (রহঃ) ... ‘আয়িশা (রাঃ) থেকে বর্ণিত যে, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একবার তাঁর কাছে আসেন, তাঁর নিকট এক মহিলা ছিলেন। রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জিজ্ঞাসা করলেনঃ ‘ইনি কে? আয়িশা (রাঃ) উত্তর দিলেন অমুক মহিলা, এ বলে তিনি তাঁর সালাত (নামায/নামাজ)-এর উল্লেখ করলেন। রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ ‘থাম, তোমরা যতটুকু সামর্থ্য রাখ, ততটুকুই তোমাদের করা উচিৎ। আল্লাহর কসম! আল্লাহ্ তা’আলা ততক্ষন পর্যন্ত (সওয়াব দিতে) বিরত হন না, যতক্ষন না তোমরা নিজেরা ক্লান্ত হয়ে পড়। আল্লাহর কাছে সবচাইতে পছন্দনীয় আমল তা-ই, যা আমলকারী নিয়মিত করে থাকে। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩৩ ',
        name: 'ঈমানের বাড়া-কমা।',
        hadisNumberList: [
          HadisNumberModel(
            id: '',
            name:
                'আল্লাহ্‌ তা\'আলার বাণীঃ আমি তাঁদের হিদায়াত বাড়িয়ে দিয়েছিলাম (১৮ঃ ৩৩) যাতে মুমিনদের ঈমান আরো বেড়ে যায় (৭৪ঃ ৩১) তিনি আরও ইরশাদ করেন, আজ আমি তোমাদের জন্য তোমাদের দ্বীন পূর্ণাংগ করে দিলাম (৫ঃ ৩) পূর্ণ জিনিস থেকে কিছু বাদ দেয়া হলে তা অসম্পূর্ণ হয়।৪২। মুসলিম ইবনু ইবরাহীম (রহঃ) ... আনাস (রাঃ) থেকে বর্ণনা করেন, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেনঃ যে ‘লা-ইলাহা ইল্লাল্লাহ বলবে আর তার অন্তরে একটি যব পরিমানও নেকী থাকবে, তাকে জাহান্নাম থেকে বের করা হবে এবং যে এবং যে‘লা-ইলাহা ইল্লাল্লাহ বলবে আর তার অন্তরে একটি গম পরিমানও নেকী থাকবে তাকে জাহান্নাম থেকে বের করা হবে এবং যে ‘লা-ইলাহা ইল্লাল্লাহ বলবে আর তার অন্তরে একটি অণু পরিমাণও নেকী থাকবে তাকে জাহান্নাম থেকে বের করা হবে।ইমাম আবূ ‘আবদুল্লাহ মুখারী (রহঃ) বলেন, আবান (রহঃ) কাতাদা (রহঃ) আনাস (রাঃ) রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে নেকী (خَيْر) এর স্থলে ‘ঈমান’ শব্দটি রিওয়ায়েত করেছেন। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '৪৩।',
            name:
                ' হাসান ইবনুুস সাব্বাহ্ (রহঃ) ... ‘উমর ইবনুল খাত্তাব (রাঃ) থেকে বর্ণনা করেন, এক ইয়াহূদী তাঁকে বললঃ হে আমীরুল মু‘মিনীন! আপনাদের কিতাবে একটি আয়াত আছে যা আপনারা পাঠ করে থাকেন, তা যদি আমাদের ইয়াহূদী জাতির উপর নাযিল হত, তবে অবশ্যই আমরা সে দিনকে ঈদ হিসেবে পালন করতাম। তিনি বললেন, কোন আয়াত? সে বললঃ الْيَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ وَأَتْمَمْتُ عَلَيْكُمْ نِعْمَتِي وَرَضِيتُ لَكُمُ الإِسْلاَمَ دِينًا“আজ তোমাদের জন্য তোমাদের দ্বীন পূর্ণাঙ্গ করলাম ও তোমাদের প্রতি আমার নিয়ামত সম্পূর্ণ করলাম এবং ইসলামকে তোমাদের দ্বীন মনোনীত করলাম।” (৫ : ৩) ‘উমর (রাঃ) বললেন এটি যে দিন এবং যে স্থানে রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর উপর নাযিল হয়েছিল তা আমরা জানি; তিনি সেদিন ‘আরাফায় দাঁড়িয়েছিলেন এবং তা ছিল জুম‘আর দিন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩৪ ',
        name: ' যাকাত ইসলামের অঙ্গ।',
        hadisNumberList: [
          HadisNumberModel(
            id: '',
            name:
                ' আল্লাহ্‌ তা\'আলার বাণীঃ তাঁরা তো আদিষ্ট হয়েছিল আল্লাহর অনুগত্য বিশুদ্ধচিত্ত হয়ে একনিষ্ঠভাবে তাঁর ইবাদত করতে এবং সালাত কায়েম করতে, যাকাত দিতে। আর এ-ই সঠিক দ্বীন (৯৮ঃ ৫)৪৪। ইসমা’ঈল (রহঃ) ... তালহা ইবনু উবায়দুল্লাহ্ (রাঃ) থেকে বর্ণিত, তিনি বলেন, নাজ্‌দবাসী এক ব্যাক্তি রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এলো। তার মাথার চুল ছিল এলোমেলো। আমরা তার কথার মৃদু আওয়াজ শুনতে পাচ্ছিলাম, কিন্তু সে কি বলছিল, আমরা তা বুঝতে পারছিলাম না। এভাবে সে কাছে এসে ইসলাম সম্পর্কে প্রশ্ন করতে লাগল। রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ দিন-রাতে পাঁচ ওয়াক্ত সালাত (নামায/নামাজ)। সে বলল, ‘আমার উপর এ ছাড়া আরো সালাত (নামায/নামাজ) আছে?’ তিনি বললেনঃ ‘না, তবে নফল আদায় করতে পার। রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ আর রমযানের সিয়াম। সে বলল, ‘আমার উপর এ ছাড়া আরো সাওম (রোযা/রোজা/সিয়াম/ছিয়াম) আছে? তিনি বললেনঃ না, তবে নফল আদায় করতে পার। বর্ণনাকারী বলেন, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার কাছে যাকাতের কথা বললেন। সে বলল, ‘আমার ওপর এ ছাড়া আরো দেয় আছে? তিনি বললেনঃ না, তবে নফল হিসেবে দিতে পার। বর্ণনাকারী বলেন, সে ব্যাক্তি এই বলে চলে গেলেন, ‘আল্লাহর কসম! আমি এর চেয়ে বেশিও করব না এবং কমও করব না। তখন রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ সে সফলকাম হবে যদি সত্য বলে থাকে।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩৫ ',
        name: 'জানাযার অনুগমন ঈমানের অঙ্গ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৪৫।',
            name:
                ' আহমদ ইবনু ‘আবদুল্লাহ ইবনু ‘আলী আল-মানজূফী (রহঃ) ... আবূ হুরায়রা (রাঃ) থেকে বর্ণনা করেন যে, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেনঃ যে ব্যাক্তি ঈমানের সাথে ও সওয়াবের আশায় কোন মুসলিমের জানাযায় অনুগমন করে এবং তার সালাত (নামায/নামাজ)-ই জানাযা আদায় ও দাফন সম্পন্ন হওয়া পর্যন্ত সাথে থাকে, সে দুই কীরাত সওয়াব নিয়ে ফিরবে। প্রতিটি কীরাত হল উহুদ পর্বতের মতো। আর যে ব্যাক্তি শুধু জানাযা আদায় করে, তারপর দাফন সম্পন্ন হওয়ার আগেই চলে আসে, সে এক কীরাত সওয়াব নিয়ে ফিরবে।‘উসমান আল-মুয়াযযিন (রহঃ) ... আবূ হুরায়রা (রাঃ) সূত্রে রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে অনুরূপ হাদীস বর্ণনা করেছেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩৬',
        name: ' অজ্ঞাতসারে মুমিনের আমল নষ্ট হওয়ার আশংকা',
        hadisNumberList: [
          HadisNumberModel(
            id: '',
            name:
                'ইবরাহিম তায়মী (রহঃ) বলেনঃ আমার আমলের সাথে যখন আমার কথা তুলনা করি, তখন আশঙ্কা হয়, আমি না মিথ্যাবাদী হই। ইবনু আবূ মুলায়কা (রহঃ) বলেন, আমি নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর এমন ত্রিশজন সাহাবীকে পেয়েছি, যারা সবাই নিজেদের সম্পর্কে নিফাকের ভয় করতেন। তাঁরা কেউ এ কথা বলতেন না যে, তিনি জিবরীল (আঃ) ও মীকাঈল (আঃ) এর তুল্য ঈমানের অধিকারী। হাসান বসরী (রহঃ) থেকে বর্ণিত, নিফাকের ভয় মু\'মিনই করে থাকে। আর কেবল মুনাফিকই তা থেকে নিশ্চিত থাকে। তউবা না করে পরস্পর লড়াই করা ও পাপাচারে লিপ্ত হওয়া থেকে সতর্ক থাকা। কারন আল্লাহ্‌ তা\'আলা বলেনঃ (وَلَمْ يُصِرُّوا عَلَى مَا فَعَلُوا وَهُمْ يَعْلَمُونَ) এবং তাঁরা (মুত্তাকিরা) যা করে ফেলে, জেনে শুনে তাঁর (গুনাহর) পুনরাবৃতি করে না (৩ঃ ১৩৫)৪৬। মুহাম্মদ ইবনু ‘আর ‘আরা (রহঃ) ... যুবায়দ (রহঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি আবূ ওয়াইল (রহঃ)-কে মুরজিআ[১] সম্পর্কে জিজ্ঞাসা করলাম, তিনি বললেন, ‘আবদুল্লাহ ইবনু মাস’উদ) আমার কাছে বর্ণনা করেছেন যে, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেছেনঃ মুসলিমকে গালি দেওয়া ফাসিকী এবং তার সাথে লড়াই করা কুফরী।[১] একটি বাতিল ফিরকা, যাদের মত হল, ভাল হোক বা মন্দ কোন আমলের মূল্য নেই এবং ইমান আনার পর কোন গুনাহ ক্ষতিকর নয়। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '৪৭। ',
            name:
                'কুতায়বা ইবনু সা’ঈদ (রহঃ) ... ‘উবাদা ইবনু সামিত (রাঃ) বর্ণনা করেন যে, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম লায়লাতুল কদ্‌র সম্পর্কে খবর দেওয়ার জন্য বের হলেন। তখন দু’জন মুসলিম পরস্পর বিবাদ করছিল। তিনি বললেনঃ আমি তোমাদের লায়লাতুল কদ্‌র সম্পর্কে খবর দেওয়ার জন্য বেরিয়েছিলাম; কিন্তু তখন অমুক অমুক বিবাদে লিপ্ত থাকায় তা (নির্দিষ্ট তারিখ সম্পর্কিত জ্ঞান) উঠিয়ে নেওয়া হয়েছে। আর হয়তো বা এটাই তোমাদের জন্য কল্যাণকর হবে। তোমরা তা অনুসন্ধান কর ২৭, ২৯ ও ২৫ তম রাতে। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩৭ ',
        name:
            ' জিবরীল (আঃ) কর্তৃক রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে ঈমান, ইসলাম, ইহসান ও কিয়ামতের জ্ঞান সম্পর্কে প্রশ্ন',
        hadisNumberList: [
          HadisNumberModel(
            id: '',
            name:
                ' জিবরীল (আঃ) কর্তৃক রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে ঈমান, ইসলাম, ইহসান ও কিয়ামতের জ্ঞান সম্পর্কে প্রশ্ন আর তাকে দেওয়া রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর উত্তর। তারপর তিনি বললেনঃ জিবরীল (আঃ) তোমাদের দ্বীন শিক্ষা দিতে এসেছিলেন। তিনি এসব বিষয়কে দ্বীন বলে আখ্যায়িত করেছেন। ঈমান সম্পর্কে আব্দুল কায়স গোত্রের প্রতিনিধি দলকে রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যে বিবরন দিয়েছেন এবং আল্লাহ্‌ তা\'আলা ইরশাদ করেছেনঃ (وَمَنْ يَبْتَغِ غَيْرَ الإِسْلاَمِ دِينًا فَلَنْ يُقْبَلَ مِنْهُ) কেউ ইসলাম ব্যাতিত অন্য কোন দ্বীন গ্রহন করতে চাইলে তা কখনো কবুল করা হবে না (৩ঃ ৮৫)৪৮। মূসা’দ্দাদ (রহঃ) ... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, তিনি বলেন, একদিন রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জনসমুক্ষে বসা ছিলেন, এমন সময় তাঁর কাছে এক ব্যাক্তি এসে জিজ্ঞাসা করলেন ‘ঈমান কি?’ তিনি বললেনঃ ‘ঈমান হল, আপনি বিশ্বাস রাখবেন আল্লাহর প্রতি, তাঁর ফিরিশতাগণের প্রতি, (কিয়ামতের দিন) তাঁর সঙ্গে সাক্ষাতের প্রতি এবং তাঁর রাসূলগণের প্রতি। আপনি আরো বিশ্বাস রাখবেন পুনরুত্থানের প্রতি। তিনি জিজ্ঞাসা করলেন, ‘ইসলাম কি?’ তিনি বললেনঃ ‘ইসলাম হল, আপনি আল্লাহর ইবাদত করবেন এবং তাঁর সঙ্গে শরীক করবেন না, সালাত (নামায/নামাজ) কায়েম করবেন, ফরয যাকাত আদায় করবেন এবং রমযানের সাওম (রোযা/রোজা/সিয়াম/ছিয়াম) পালন করবেন। ঐ ব্যাক্তি জিজ্ঞাসা করলেন, ‘ইহসান কি?’ তিনি বললেনঃ ‘আপনি এমন ভাবে আল্লাহর ইবাদত করবেন যেন আপনি তাঁকে দেখছেন, আর যদি আপনি তাঁকে দেখতে না পান তবে (বিশ্বাস রাখবেন যে,) তিনি আপনাকে দেখছেন।ঐ ব্যাক্তি জিজ্ঞাসা করলেন, ‘কিয়ামত কবে?’ তিনি বললেনঃ ‘এ ব্যাপারে যাকে জিজ্ঞাসা করা হচ্ছে, তিনি জিজ্ঞাসাকারী অপেক্ষা বেশি জানেন না। তবে আমি আপনাকে কিয়ামতের আলামতসমূহ বলে দিচ্ছিঃ বাঁদী যখন তার প্রভুকে প্রসব করবে এবং উটের নগণ্য রাখালেরা যখন বড় বড় অট্টালিকা নির্মাণে প্রতিযোগিতা করবে। (কিয়ামতের বিষয়) সেই পাঁচটি জিনিসের অন্তর্ভূক্ত, যা আল্লাহ্ ছাড়া কেউ জাননা। এরপর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এই আয়াতটি শেষ পর্যন্ত তিলাওয়াত করলেনঃ (إِنَّ اللَّهَ عِنْدَهُ عِلْمُ السَّاعَةِ‏) “কিয়ামতের জ্ঞান কেবল আল্লাহই নিকট।” (৩১ : ৩৪) এরপর ঐ ব্যাক্তি চলে গেলে তিনি বললেনঃ ‘তোমরা তাকে ফিরিয়ে আন।’ তারা কিছুই দেখতে পেল না। তখন তিনি বললেন, ‘ইনি জিবরীল আলাইহিস সালাম। লোকদের দ্বীন শেখাতে এসেছিলেন। আবূ আব্দুল্লাহ বুখারী (রহঃ) বলেন, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এসব বিষয়কে ঈমানের অন্তর্ভুক্ত করেছেন৷',
            ref: '',
          ),
        ]),
    PorichedModel(id: ' পরিচ্ছেদঃ ৩৮', name: ' পরিচ্ছদ নেই', hadisNumberList: [
      HadisNumberModel(
        id: '',
        name:
            ' ৪৯। ইবরাহীম ইবনু হামাযা (রহঃ) ... আবদুল্লাহ ইবনু আব্বাস (রাঃ) থেকে বর্ণিত, তিনি বলেনঃআবূ সুফিয়ান ইবনু হারব আমার কাছে বর্ণনা করেন যে, হিরাকল তাঁকে বলেছিলেন, আমি তোমাকে জিজ্ঞাসা করেছিলাম তারা (ঈমানদারগণ) সংখ্যায় বাড়ছে না কমছে? তুমি উত্তর দিয়েছিলে, তারা সংখ্যায় বাড়ছে। প্রকৃতপক্ষে ঈমানের ব্যাপার এরূপই থাকে যতক্ষণ না তা পূর্ণতা লাভ করে। আর আমি তোমাকে জিজ্ঞাসা করেছিলাম, কেউ তাঁর দ্বীন গ্রহণ করার পর তা অপছন্দ করে মুরতাদ হয়ে যায় কি-না? তুমি জবাব দিয়েছ, ‘না।’ প্রকৃত ঈমান এরূপই, ঈমানের স্বাদ অন্তরের সাথে মিশে গেলে কেউ তা অপছন্দ করে না।',
        ref: '',
      ),
    ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩৯',
        name: ' দ্বীন রক্ষাকারীর ফজিলত',
        hadisNumberList: [
          HadisNumberModel(
            id: '৫০। আবূ নু’আয়ম (রহঃ) ... নু’মান ইবনু বশীর (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি যে, ‘হালালও স্পষ্ট এবং হারামও স্পষ্ট। আর এ দু’য়ের মাঝে রয়েছে বহু সন্দেহজনক বিষয়- যা অনেকেই জানেনা। যে ব্যাক্তি সেই সন্দেহজনক বিষয়সমূহ থেকে বেঁচে থাকবে, সে তার দ্বীন ও মর্যাদা রক্ষা করতে পারবে। আর যে সন্দেহজনক বিষয়সমূহে লিপ্ত হয়ে পড়ে, উদহারন সে রাখালের ন্যায়, যে তার পশু বাদশাহ্‌র সংরক্ষিত চারণভুমির আশে পাশে চরায়, অচিরেই সেগুলো সেখানে ঢুকে পড়ার আশংকা রয়েছে। জেনে রাখ যে, প্রত্যেক বাদশাহ্‌রই একটি সংরক্ষিত এলাকা রয়েছে। আরো জেনে রাখ যে, আল্লাহর যমীনে তাঁর সংরক্ষিত এলাকা হল তাঁর নিষিদ্ধ কাজসমূহ। জেনে রাখ, শরীরের মধ্যে একটি গোশতের টুকরা আছে, তা যখন ঠিক হয়ে যায়, গোটা শরীরই তখন ঠিক হয়ে যায়। আর তা যখন খারাপ হয়ে যায়, গোটা শরীরই তখন খারাপ হয়ে যায়। জেনে রাখ, সে গোশতের টুকরোটি হল কলব।',
            name: ' ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৪০ ',
        name: 'গণীমতের এক পঞ্চমাংশ প্রদান ঈমানের অন্তর্ভুক্ত',
        hadisNumberList: [
          HadisNumberModel(
            id: '৫১। ',
            name:
                ' আলী ইবনুল জা’দ (রহঃ) ... আবূ জামরা (রহঃ) থেকে বর্ণিত, তিনি বলেন, আমি ইবনু আব্বাস (রাঃ) এর সঙ্গে বসতাম্ তিনি আমাকে তাঁর আসনে বসাতেন। একবার তিনি বললেনঃ তুমি আমার কাছে থেকে যাও, আমি তোমাকে আমার সম্পদ থেকে কিছু অংশ দেব। আমি দু’ মাস তাঁর সঙ্গে অবস্থান করলাম। তারপর একদিন তিনি বললেন, আবদুল কায়েসের একটি প্রতিনিধি দল রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে আসলে তিনি জিজ্ঞাসা করলেনঃ তোমরা কোন্ কওমের? অথবা কোন্ প্রতিনিধিদলের? তারা বলল, রাবী‘আ গোত্রের।’ তিনি বললেনঃ মারহাবা সে গোত্র বা সে প্রতিনিধি দলের প্রতি, যারা অপদস্থ ও লজ্জিত না হয়েই এসেছে। তারা বলল, ইয়া রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিষিদ্ধ মাসসমূহ ছাড়া অন্য কোন সময় আমরা আপনার কাছে আসতে পারি না। (কারন) আমাদের এবং আপনার মাঝখানে মুযার গোত্রীয় কাফিরদের বাস। তাই আমাদের কিছু স্পষ্ট হুকুম দিন, যাতে আমরা যাদের পিছনে রেখে এসেছি তাদের জানিয়ে দিতে পারি এবং যাতে আমরা জান্নাতে প্রবেশ করতে পারি।তারা পানীয় সম্পর্কেও জিজ্ঞাসা করল। তখন তিনি তাদের চারটি জিনিসের নির্দেশ এবং চারটি জিনিস থেকে নিষেধ করলেন। তাদের এক আল্লাহর প্রতি ঈমান আনার আদেশ দিয়ে বললেনঃ ‘এক আল্লাহ প্রতি ঈমান আনা কিভাবে হয় তা কি তোমরা জানো?’ তাঁরা বলল, ‘আল্লাহ ও তাঁর রাসূলই ভাল জানেন।’ তিনি বললেনঃ ‘তা হল এ সাক্ষ্য দেওয়া যে, আল্লাহ্ ছাড়া ইলাহ্ নেই এবং মুহাম্মদ আল্লাহর রাসূল এবং সালাত (নামায/নামাজ) কায়েম করা, যাকাত দেওয়া, রমযানের সিয়াম পালন করা; আর তোমরা গণীমতের মাল থেকে এক-পঞ্চমাংশ প্রদান করবে। তিনি তাদেরকে চারটি জিনিস থেকে নিষেধ করলেন। তা হলঃ সবুজ কলসী, শুকনো লাউয়ের খোল, খেজুর গাছের গুঁড়ি থেকে তৈরীকৃত পাত্র এবং আলকাতরার পালিশকৃত পাত্র। রাবী বলেন, বর্ণনাকারী (مزفت এর স্থলে) কখনওالمقير উল্লেখ করেছেন (উভয় শব্দের অর্থ একই)। তিনি আরো বলেন, তোমরা এগুলো ভালো করে আয়ত্ত করে নাও এবং অন্যদেরও এগুলি জানিয়ে দিও।১. এ পাত্রগুলিতে সে সময় মদ প্রস্তুত করা হত।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৪১',
        name:
            ' আমল নিয়ত ও সওয়াব আশা অনুযায়ী প্রত্যেক মানুষের প্রাপ্য তার নিয়ত অনুযায়ী।',
        hadisNumberList: [
          HadisNumberModel(
            id: '',
            name:
                'অতএব ঈমান, উযূ, সালাত, যাকাত, হাজ্জ, সিয়াম এবং অন্যান্য আহকাম সবই সবই এর অন্তর্ভুক্ত। আল্লাহ তা‘আলা বলেনঃ (قُلْ كُلٌّ يَعْمَلُ عَلَى شَاكِلَتِهِ) ‘‘বলুন প্রত্যেকেই আপন স্বভাব অনুসারে কর্ম সম্পাদন করে থাকে।’’ (সূরা আল-ইসরাঃ ৮৪)شَاكِلَتِهِ অর্থাৎ নিয়ত অনুযায়ী। মানুষ তার পরিবারের জন্য সাওাবের নিয়তে যা খরচ করে, তা সদাক্বাহ। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, (এখন মক্কা হতে হিজরাত নেই) তবে কেবল জিহাদ ও নিয়্যাত অবশিষ্ট রয়েছে।৫২। আবদুল্লাহ ইবনু মাসলাম (রহঃ) ... ‘উমর (রাঃ) থেকে বর্ণিত, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ কাজ নিয়তের সাথে সম্পর্কিত এবং প্রত্যেক মানুষের প্রাপ্য তার নিয়ত অনুযায়ী। অতএব যার হিজরত হবে আল্লাহ্ ও তাঁর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর উদ্দেশ্যে, তার হিজরত আল্লাহ্ ও তাঁর রাসূল -এর উদ্দেশ্যে হয়েছে বলেই গণ্য হবে। আর যার হিজরত হয় দুনিয়া হাসিলের জন্য বা কোন নারীকে বিয়ে করার জন্য, তার হিজরত সে উদ্দেশ্যেই গণ্য হবে যে উদ্দেশ্যে সে হিজরত করেছে। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '৫৩। ',
            name:
                'হাজ্জাজ ইবনু মিনহাল (রহঃ) ... আবূ মাসউদ (রাঃ) থেকে বর্ণিত, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ মানুষ তার পরিবারের জন্য সওয়াবের নিয়তে যখন খরচ করে তখন তা হয় তার সদকা স্বরূপ। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '৫৪। ',
            name:
                ' হাকাম ইবনু নাফি’ (রহঃ) ... সা’দ ইবনু আবূ ওয়াক্কাস (রাঃ) থেকে বর্ণিত, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ ‘তুমি আল্লাহর সন্তুষ্টি লাভের আশায় যা-ই খরচ কর না কেন, তোমাকে তার সওয়াব অবশ্যই দেওয়া হবে। এমনকি তুমি তোমার স্ত্রীর মুখে যা তুলে দাও, তারও।’',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৪২',
        name:
            'নাবী (ﷺ) এর বানীঃ দ্বীন হল কল্যাণ কামনা করা, আল্লাহর রেজমন্দির জন্য, তাঁর রাসুলের জন্য, মুসলিম নেত্রীবৃন্দের জন্য এবং সকল মুসলিমের জন্য।',
        hadisNumberList: [
          HadisNumberModel(
            id: '',
            name:
                'আল্লাহ্ তা‘আলার বাণীঃ إِذَا نَصَحُوا لِلَّهِ وَرَسُولِهِ‘যদি আল্লাহ্ ও তাঁর রাসূলের প্রতি তাদের অবিমিশ্র অনুরাগ থাকে। (সূরা তাওবাঃ ৯১)৫৫। মূসা’দ্দাদ (রহঃ) ... জারীর ইবনু আবদুল্লাহ আল বাজলী (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর হাতে বায়’আত গ্রহণ করেছি সালাত (নামায/নামাজ) কায়েম করার, যাকাত দেওয়ার এবং সকল মুসলিমের কল্যাণ কামনা করার। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '৫৬। ',
            name:
                'আবূ নু‘মান (রহঃ) ... যিয়াদ ইবনু ‘ইলাকা (রহঃ) থেকে বর্ণিত, তিনি বলেনঃ মুগীরা ইবনু শু’বা (রাঃ)১ যেদিন ইন্তেকাল করেন সেদিন আমি জারীর ইবনু আবদুল্লাহ (রাঃ) এর কাছ থেকে শুনেছি, তিনি (মিম্বরে) দাঁড়িয়ে আল্লাহর হামদ ও সানা বর্ণনা করে বললেন, তোমরা ভয় কর এক আল্লাহকে যাঁর কোন শরীক নাই, এবং নতুন কোন আমীর না আসা পর্যন্ত শান্তি-শৃঙ্খলা বজায় রাখ, অনতিবিলম্বে তোমাদের আমীর আসবেন। এরপর জারীর (রাঃ) বললেন, তোমাদের আমীরের জন্য মাগফিরাত কামনা কর, কেননা তিনি ক্ষমা করা ভালবাসতেন। তারপর বললেন, একবার আমি রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এসে বললাম, আমি আপনার কাছে ইসলামের বায়’আয় গ্রহণ করতে চাই। তিনি (অন্যান্য বিষয়ের সাথে) আমার উপর শর্ত আরোপ করলেনঃ আর সকল মুসলিমের কল্যাণ কামনা করবে। তারপর আমি তাঁর কাছে এ শর্তের উপর বায়’আত গ্রহণ করলাম। এ মসজিদের রবের কসম! আমি তোমাদের কল্যাণকামী। এরপর তিনি আল্লাহর কাছে মাগফিরাত কামনা করলেন এবং (মিম্বর থেকে) নেমে গেলেন।১. বিখ্যাত সাহাবী। তিনি কূফার আমীর ছিলেন। ',
            ref: '',
          ),
        ]),
  ];
  List<PorichedModel> chapterThree = [
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৪৪',
        name:
            'আলোচনায় মশগুল অবস্থায় ইলম সম্পর্কে জিজ্ঞাসা করা হলে আলোচনা শেষ করার পর প্রশ্নকারীর উত্তর প্রদান ইসলামি',
        hadisNumberList: [
          HadisNumberModel(
            id: '',
            name:
                ' ৪৩. ইলমের ফযীলত আল্লাহ তা‘আলার বাণীঃ يَرْفَعْ اللهُ الَّذِينَ آمَنُوا مِنْكُمْ وَالَّذِينَ أُوتُوا الْعِلْمَ دَرَجَاتٍ وَاللهُ بِمَا تَعْمَلُونَ خَبِيرٌতোমাদের মধ্যে যারা ঈমান এনেছে এবং যাদের ইলম দান করা হয়েছে আল্লাহ্‌ তাদের মর্যাদায় উন্নত করবেন; তোমরা যা কর আল্লাহ্‌ সে সম্পর্কে সবিশেষ অবহিত। (৫৮ঃ ১১)।মহান আল্লাহ্‌র বাণীঃرَبِّ زِدْنِي عِلْمًاহে আমার রব! আমার জ্ঞানের বৃদ্ধি সাধন কর। (২০ঃ ১১৪)৫৭। মুহাম্মদ ইবনু সিনান (রহঃ) ও ইবরাহীম ইবনুল মুনযির (রহঃ) ... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ একবার রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মজলিসে লোকদের সামনে কিছু আলোচনা করছিলেন। ইতিমধ্যে তাঁর কাছে একজন বেদু্ঈন এসে প্রশ্ন করলেন, কিয়ামত কবে হবে? রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর আলোচনায় রত রইলেন। এতে কেউ কেউ বললেন, লোকটি যা বলেছে তিনি তা শুনেছেন কিন্তু তার কথা পছন্দ করেন নি। আর কেউ কেউ বললেন বরং তিনি শুনতেই পান নি। রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আলোচনা শেষ করে বললেনঃ কিয়ামত সম্পর্কে প্রশ্নকারী লোকটি কোথায়? সে বলল, এই যে আমি, ইয়া রাসূলাল্লাহ! তিনি বললেনঃ যখন আমানত নষ্ট করা হয় তখন কিয়ামতের প্রতীক্ষা করবে। সে বলল, কিভাবে আমানত নষ্ট করা হয়? তিনি বললেনঃ যখন কোন কাজের দায়িত্ব অনুপযুক্ত লোকের প্রতি ন্যাস্ত হয়, তখন তুমি কিয়ামতের প্রতীক্ষা করবে।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৪৫',
        name: ' উচ্চস্বরে ইলমের আলচনা',
        hadisNumberList: [
          HadisNumberModel(
            id: '৫৮। ',
            name:
                'আবূ’ন নু’মান (রহঃ) ... আবদুল্লাহ ইবনু ‘আমর (রাঃ) থেকে বর্ণিত, তিনি বলেন, এক সফরে রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের পেছনে রয়ে গেলেন। পরে তিনি আমাদের কাছে পৌঁছলেন, এদিকে আমরা (আসরের) সালাত (নামায/নামাজ) আদায় করতে দেরী করে ফেলেছিলাম এবং আমরা উযূ (ওজু/অজু/অযু) করছিলাম। আমরা আমাদের পা কোনমতে পানি দিয়ে ভিজিয়ে নিচ্ছিলাম। তিনি উচ্চস্বরে বললেনঃ পায়ের গোড়ালিগুলোর (শুষ্কতার) জন্য জাহান্নামের শাস্তি রয়েছে। তিনি দু’বার বা তিনবার এ কথা বললেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৪৬/',
        name: ' মুহাদ্দিসের উক্তিঃ হাদ্দাসানা, আখবারানা ও আম্বা\'আনা',
        hadisNumberList: [
          HadisNumberModel(
            id: '',
            name:
                ' হুমাইদী (রহ.) বর্ণনা করেন যে, ইবনু ‘উয়াইনাহ (রহঃ)-এর মতে حَدَّثَنَا وَأَخْبَرَنَا وَأَنْبَأَنَا وَسَمِعْتُ একই অর্থবোধক। ইবনু মাস‘ঊদ (রাঃ) বলেন, حَدَّثَنَا رَسُولُ اللهِ صلى الله عليه وسلم وَهُوَ الصَّادِقُ الْمَصْدُوقُ আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের নিকট হাদীস বর্ণনা করেছেন; আর তিনি সত্যবাদী এবং সত্যবাদীরূপে স্বীকৃত।’শাকীক (রহঃ) ‘আবদুল্লাহ্ (রাঃ) থেকে বর্ণনা করেন, سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم كَلِمَةً ‘আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে এরূপ উক্তি শুনেছি’...।হুযাইফাহ (রাঃ) বলেন, حَدَّثَنَا رَسُولُ اللهِ حَدِيثَيْنِ ‘আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের নিকট দু’টি হাদীস বর্ণনা করেছেন।’আবুল ‘আলিয়াহ (রহঃ) ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণনা করেন, يَرْوِي عَنْ رَبِّهِ عَنِ النَّبِيِّ صلى الله عليه وسلم ‘নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে, তিনি তাঁর রব থেকে বর্ণনা করেন’...।আনাস (রাঃ) বলেন, عَنِ النَّبِيِّ صلى الله عليه وسلم فِيمَا يَرْوِيهِ عَنْ رَبِّهِ عَزَّ وَجَلَّ ‘নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে, তিনি বর্ণনা করেন তাঁর রব থেকে’....।আবূ হুরাইরাহ (রাঃ) বলেন, عَنِ النَّبِيِّ صلى الله عليه وسلم يَرْوِيهِ عَنْ رَبِّكُمْ عَزَّ وَجَلَّ ‘নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে, তিনি তোমাদের মহিমাময় ও সুমহান প্রতিপালক থেকে বর্ণনা করেন’...।৫৯। কুতায়বা ইবনু সা’ঈদ (রহঃ) ... ইবনু ‘উমর (রাঃ) থেকে বর্ণিত, তিনি বলেন, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একবার বললেনঃ গাছপালার মধ্যে এমন একটি গাছ আছে যার পাতা ঝরে না। আর তা মুসলিমের উপমা। তোমরা আমাকে বল, ‘সেটি কি গাছ?’ রাবী বলেন, তখন লোকেরা জঙ্গলের বিভিন্ন গাছ-পালার নাম চিন্তা করতে লাগল। আবদুল্লাহ (রাঃ) বলেন, ‘আমার মনে হল, সেটা হবে খেজুর গাছ।’ কিন্তু আমি তা বলতে লজ্জাবোধ করছিলাম। তারপর সাহাবায়ে কিরাম (রাঃ) বললেন, ‘ইয়া রাসূলাল্লাহ! আপনি আমাদের বলে দিন সেটি কি গাছ? তিনি বললেনঃ তা হল খেজুর গাছ।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৪৭ ',
        name: ' শাগরিদগনের জ্ঞান পরীক্ষার জন্য উস্তাদের কোন বিষয় উত্থাপন করা',
        hadisNumberList: [
          HadisNumberModel(
            id: '৬০।',
            name:
                ' খালিদ ইবনু মাখলাদ (রহঃ) ... ইবনু উমর (রাঃ) থেকে বর্ণিত যে, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একবার বললেনঃ গাছ-পালার মধ্যে এমন একটি গাছ আছে যার পাতা ঝরে না। আর তা মুসলিমের উপমা। তোমরা আমাকে বল দেখি সেটি কি গাছ? রাবী বলেন, তখন লোকেরা জঙ্গলের বিভিন্ন গাছ-পালার নাম চিন্তা করতে লাগল। আবদুল্লাহ (রাঃ) বলেন, ‘আমার মনে হল, সেটা হবে খেজুর গাছ। কিন্তু তা বলতে আমি লজ্জাবোধ করছিলাম। তারপর সাহাবায়ে কিরাম (রাঃ) বললেন, ‘ইয়া রাসূলাল্লাহ! আপনিই আমাদের বলে দিন সেটি কি গাছ? তিনি বললেনঃ তা হল খেজুর গাছ। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৪৮ ',
        name: 'হাদিস পড়া ও মুহাদ্দিসের কাছে পেশ করা',
        hadisNumberList: [
          HadisNumberModel(
            id: '',
            name:
                'হাসান (বসরী), সুফইয়ান সাউরী এবং মালিক (রহঃ)-এর মতে মুহাদ্দিসের সামনে পাঠ করা জায়েয। কোন কোন মুহাদ্দিস উস্তাদের সামনে পাঠ করার স্বপক্ষে যিমাম ইবনু সা‘লাবা (রাঃ)-এর হাদীস পেশ করেন। তিনি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলেছিলেন, ‘আমাদের পাঁচ ওয়াক্ত সালাত আদায় করার ব্যাপারে আল্লাহ্ কি আপনাকে নির্দেশ দিয়েছেন?’ তিনি বললেনঃ ‘হ্যাঁ’। রাবী বলেন, এগুলো রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সামনে পাঠ করা। যিমাম (রাঃ) তাঁর গোত্রের নিকট এ নির্দেশগুলো জানান এবং তাঁরা তা গ্রহণ করেন। (ইমাম) মালিক (রহঃ) তাঁর মতের সমর্থনে লিখিত দলীলকে প্রমাণ হিসেবে পেশ করেন, যা লোকদের সামনে পাঠ করা হলে তারা বলে, অমুক আমাদের সাক্ষী বানিয়েছেন। শিক্ষকের সামনে পাঠ করে পাঠক বলে, অমুক আমাকে পড়িয়েছেন।৬১। মুহাম্মদ ইবন সালাম (রহঃ) ... হাসান (রহঃ) থেকে বর্ণিত, তিনি বলেন, উস্তাদের সামনে শাগরিদের পাঠ করতে কোন বাধা নেই। ‘উবায়দুল্লাহ্ ইবন মূসা (রহঃ) সুফিয়ান (রহঃ) থেকে বর্ণনা করেন যে, তিনি বলেন যখন মুহাদ্দিসের সামনে (কোন হাদীস) পাঠ করা হয় তখন حَدَّثَنِي (তিনি আমার কাছে হাদীস বর্ণনা করেছেন) বলায় কোন আপত্তি নেই। বর্ণনাকারী বলেন, আমি আবূ ‘আসিমকে মালিক ও সুফিয়ান (রহঃ) থেকে বর্ণনা করতে শুনেছি যে, ‘উস্তাদের সামনে পাঠ করা এবং উস্তাদের নিজে পাঠ করা একই পর্যায়ের। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '৬২।',
            name:
                '  আবদুল্লাহ ইবনু ইউসুফ (রহঃ) ... আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ একবার আমরা রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে মসজিদে বসা ছিলাম। তখন এক ব্যাক্তি সওয়ার অবস্থায় ঢুকল। মসজিদে (প্রাঙ্গণে) সে তার উটটি বসিয়ে বেঁধে রাখল। এরপর সাহাবীদের লক্ষ্য করে বলল, তোমাদের মধ্যে মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তখন তার সামনেই হেলান দিয়ে বসা ছিলেন। আমরা বললাম, এই হেলান দিয়ে বসা ফর্সা রঙের ব্যাক্তিই হলেন তিনি।তারপর লোকটি তাঁকে লক্ষ্য করে বলল, হে আবদুল মুত্তালিবের পুত্র! নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে বললেনঃ ‘আমি তোমার জওয়াব দিচ্ছি। লোকটি বলল, ‘আমি আপনাকে কিছু প্রশ্ন করব এবং সে প্রশ্ন করার ব্যাপারে কঠোর হব, এতে আপনি রাগ করবেন না। তিনি বললেন, তোমার যেমন ইচ্ছা প্রশ্ন কর। সে বলল, আমি আপনাকে আপনার রব ও আপনার পূর্ববর্তীদের রবের কসম দিয়ে জিজ্ঞাসা করছি, আল্লাহ্ই কি আপনাকে সকল মানুষের রাসূলরূপে পাঠিয়েছেন?’ তিনি বললেনঃ আল্লাহ্ সাক্ষী, হাঁ।সে বলল, আমি আপনাকে আল্লাহর কসম দিয়ে বলছি, আল্লাহ্ই কি আপনাকে দিনরাতে পাঁচ ওয়াক্ত সালাত (নামায/নামাজ) আদায় করতে নির্দেশ দিয়েছেন? তিনি বললেনঃ ‘আল্লাহ্ সাক্ষী, হাঁ। সে বলল, আমি আপনাকে আল্লাহর কসম দিয়ে বলছি, আল্লাহ্ই কি আপনাকে বছরের এ মাসে (রমযান) সাওম (রোযা/রোজা/সিয়াম/ছিয়াম) পালনের নির্দেশ দিয়েছেন? তিনি বললেনঃ আল্লাহ্ সাক্ষী, হাঁ।সে বলল, আমি আপনাকে আল্লাহর কসম দিয়ে বলছি, আল্লাহ্ই কি আপনাকে নির্দেশ দিয়েছেন, আমাদের ধনীদের থেকে সদকা (যাকাত) উসূল করে গরীবদের মধ্যে ভাগ করে দিতে? নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ আল্লাহ্ সাক্ষী, হাঁ। এরপর লোকটি বলল, ‘আমি ঈমান আনলাম আপনি যা (যে শরী‘আত) এনেছেন তার ওপর। আর আমি আমার কওমের রেখে আসা লোকজনের পক্ষে প্রতিনিধি, আমার নাম যিমাম ইবনু সা’লাবা, বনী সা’দ ইবনু বকর গোত্রের একজন।মূসা ও আলী ইবনু আবদুল হামীদ (রহঃ) ... আনাস (রাঃ) সূত্রেও এরূপ বর্ণনা করেছেন।',
            ref: '',
          ),
          HadisNumberModel(
            id: '',
            name:
                ' ৬৩। মূসা ইবন ইসমা’ঈল (রহঃ) ... আনাস (রাঃ) থেকে বর্ণিত, তিনি বলেন, নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে প্রশ্ন করার ব্যাপারে কুরআনুল করীমে আমাদের নিষেধ করা হয়েছিল। আমরা পছন্দ করতাম, গ্রাম থেকে কোন বুদ্ধিমান ব্যক্তি এসে তাঁর কাছে প্রশ্ন করুক আর আমরা তা শুনি। তারপর একদিন গ্রাম থেকে একজন লোক এসে বলল, আমাদের কাছে আপনার একজন দূত গিয়েছে। সে আমাদের খবর দিয়েছে যে, আপনি বলেন, আল্লাহ্ তা’আলা আপনাকে রাসূলরূপে পাঠিয়েছেন। তিনি বললেনঃ সে সত্য বলেছে। সে বলল, আসমান কে সৃষ্টি করেছেন? তিনি বললেনঃ মহিমাময় আল্লাহ্ তা’আলা। সে বলল, পৃথিবী ও পর্বতমালা কে সৃষ্টি করেছেন? তিনি বললেনঃ মহিমাময় আল্লাহ্ তা’আলা। সে বলল, এসবের মধ্যে উপকারী বস্তুসমূহ কে রেখেছেন? তিনি বললেনঃ মহিমাময় আল্লাহ্ তা‘আলা। সে বলল, তাহলে যিনি আসমান সৃষ্টি করেছেন, যমীন সৃষ্টি করেছেন, পর্বত স্থাপন করেছেন এবং তার মধ্যে উপকারী বস্তুসমূহ রেখেছেন, তাঁর কসম, সেই আল্লাহ্ই কি আপনাকে রাসূলরূপে পাঠিয়েছেন? তিনি বললেনঃ হ্যাঁ।সে বলল, আপনার দূত বলেছেন যে, আমাদের উপর পাঁচ ওয়াক্ত সালাত আদায় করা এবং আমাদের মালের যাকাত দেওয়া অবশ্য কর্তব্য। তিনি বললেনঃ সে সত্য বলেছে। সে বলল, যিনি আপনাকে রাসূল করে পাঠিয়েছেন, তাঁর কসম, আল্লাহ্ই কি আপনাকে এর আদেশ দিয়েছেন? তিনি বললেনঃ হ্যাঁ, সে বলল, আপনার দূত বলেছেন যে, আমাদের উপর বছরে একমাস সাওম পালন অবশ্য কর্তব্য। তিনি বললেনঃ সে সত্য বলেছে। সে বলল, যিনি আপনাকে রাসূল করে পাঠিয়েছেন তাঁর কসম, আল্লাহ্ই কি আপনাকে এর নির্দেশ দিয়েছেন? তিনি বললেনঃ হ্যাঁ। সে বলল, আপনার দূত বলেছেন যে, আমাদের মধ্যে যার যাতায়াতের সামর্থ্য আছে, তার উপর বায়তুল্লাহর হজ্জ করা অবশ্য কর্তব্য। তিনি বললেনঃ সে সত্য বলেছে। সে বলল, যিনি আপনাকে রাসূল করে পাঠিয়েছেন তাঁর কসম, আল্লাহ্ই কি আপনাকে এর নির্দেশ দিয়েছেন? তিনি বললেনঃ হ্যাঁ, লোকটি বলল, যিনি আপনাকে সত্য দ্বীন দিয়ে পাঠিয়েছেন, তাঁর কসম, আমি এতে কিছু বাড়াবোও না, কামাবোও না। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ ‘সে যদি সত্য বলে থাকে তবে অবশ্যই সে জান্নাতে দাখিল হবে।’',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৪৯',
        name:
            'শায়খ কর্তৃক ছাত্রকে হাদিসের কিতাব প্রদান এবং আলিম কর্তৃক ইলমের কথা লিখে বিভিন্ন দেশে প্রেরণ।',
        hadisNumberList: [
          HadisNumberModel(
            id: '',
            name:
                'আনাস (রাঃ) বলেন, ‘উসমান (রাঃ) কুরআন কারীমের বহু কপি তৈরি করিয়ে বিভিন্ন দেশে প্রেরণ করেন। আবদুল্লাহ্ ইবনু ‘উমার (রাঃ), ইয়াহইয়া ইবনু সা‘ঈদ ও মালিক (রহঃ) এটাকে জায়িয মনে করেন। কোন কোন হিজাযবাসী ছাত্রকে হাদীস বর্ণনার অনুমতি প্রদানের ব্যাপারে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর এ হাদীস দিয়ে দলীল পেশ করেন যে, তিনি একটি সেনাদলের প্রধানকে একখানি পত্র দেন এবং তাঁকে বলে দেন, অমুক অমুক স্থানে না পৌঁছা পর্যন্ত এটা পড়ো না। অতঃপর তিনি যখন সে স্থানে পৌঁছলেন, তখন লোকের সামনে তা পড়ে শোনান এবং রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর ফরমান তাদেরকে জানান। ৬৪। ইসমাঈল ইবনু আবদুল্লাহ (রহঃ) ... আবদুল্লাহ ইবনু আব্বাস (রাঃ) থেকে বর্ণিত, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামএক ব্যক্তিকে তাঁর চিঠি দিয়ে পাঠালেন এবং তাকে বাহরায়নের গভর্নরের কাছে তা পৌঁছে দিতে নির্দেশ দিলেন। এরপর বাহরায়নের গভর্নর তা কিসরা (পারস্য সম্রাট)-এর কাছে দিলেন। পত্রটি পড়ার পর সে ছিঁড়ে টুকরো টুকরো করে ফেলল। [বর্ণনাকারী ইবনু শিহাব (রহঃ) বলেন] আমার ধারনা ইবনু মূসায়্যাব (রহঃ) বলেছেন, (এ ঘটনার খবর পেয়ে) রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের জন্য বদদু’আ করেন যে, তাদেরকেও যেন সম্পূর্ণরূপে টুকরো টুকরো করে ফেলা হয়। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '',
            name:
                '৬৫। মুহাম্মদ ইবনু মুকাতিল (রহঃ) ... আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত, তিনি বলেন, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একখানি পত্র লিখলেন অথবা একখানি পত্র লিখতে মনস্থ করলেন। তখন তাঁকে বলা হল যে, তারা (রোমবাসী ও অনারবরা) সীলমোহরযুক্ত ছাড়া কোন পত্র পড়ে না। এরপর তিনি রূপার একটি আংটি (মোহর) তৈরী করালেন যার নকশা ছিল (مُحَمَّدٌ رَسُولُ اللَّهِ) আমি যেন তাঁর হাতে সে আংটির ঔজ্জ্বল্য (এখনও) দেখতে পাচ্ছি। [শু’বা (রহঃ) বলেন] আমি কাতাদ (রহঃ)-কে বললাম, কে বলেছে যে, তার নকশা (مُحَمَّدٌ رَسُولُ اللَّهِ) ছিল? তিনি বললেন, আনাস (রাঃ)। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৫০',
        name: ' মজলিসের শেষ প্রান্তে বসা এবং মজলিসের ভিতরে ফাক দেখে সেখানে বসা',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ৬৬। ',
            name:
                'ইসমা’ঈল (রহঃ) ... আবূ ওয়াকিদ আল-লায়সী (রাঃ) থেকে বর্ণিত যে, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একবার মসজিদে বসেছিলেন; তাঁর সঙ্গে আরও লোকজন ছিলেন। ইতিমধ্যে তিনজন লোক এলেন। তন্মধ্যে দু’জন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর দিকে এগিয়ে এলেন এবং একজন চলে গেলেন। আবূ ওয়াকিদ (রাঃ) বলেন, তাঁরা দু’জন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে কিছুক্ষণ দাঁড়িয়ে রইলেন। এরপর তাঁদের একজন মজলিসের মধ্যে কিছুটা জায়গা দেখে সেখানে বসে পড়লেন এবং অন্যজন তাদের পেছনে বসলেন। আর তৃতীয় ব্যাক্তি ফিরে গেল। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মজলিস শেষ করে (সাহাবায়ে কিরামকে লক্ষ্য করে) বললেনঃ আমি কি তোমাদেরকে এই তিন ব্যাক্তি সম্পর্কে কিছু বলব? তাদের একজন আল্লাহর দিকে এগিয়ে এসেছে তাই আল্লাহ্ তাকে স্থান দিয়েছেন। অন্যজন (ভীড় ঠেলে অগ্রসর হতে অথবা ফিরে যেতে) লজ্জাবোধ করেছে,তাই আল্লাহও তার ব্যাপারে (তাকে শাস্তি দিতে এবং রহমত থেকে বঞ্চিত করতে) লজ্জাবোধ করেছেন। আর অপরজন (মজলিসে হাজির হওয়া থেকে) মুখ ফিরিয়ে নিয়েছে, তাই আল্লাহ্ও তার থেকে মুখ ফিরিয়ে নিয়েছেন।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' ',
        name:
            'পরিচ্ছেদঃ ৫১/ নাবী করীম (ﷺ) এর বানীঃ যাদের কাছে হাদিস পৌঁছানো হয় তাদের মধ্যে অনেকে এমন আছে, যে শ্রোতা (বর্ণনাকারী\'র) চাইতে বেশী মুখস্থ রাখতে পারে।',
        hadisNumberList: [
          HadisNumberModel(
            id: '৬৭।',
            name:
                ' মূসা’দ্দাদ (রহঃ) ... আবূ বাকরা (রাঃ) থেকে বর্ণিত যে, তিনি একবার নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কথা উল্লেখ করে বলেন, (মিনায়) তিনি তাঁর উটের ওপর বসেছিলেন। একজন লোক তাঁর উটের লাগাম ধরে রেখেছিল। তিনি বললেনঃ আজ কোন্ দিন?’ আমরা চুপ থাকলাম এবং ধারণা করলাম যে, এ দিনটির আলাদা কোন নাম তিনি দিবেন। তিনি বললেনঃ “এটা কুরবানীর দিন নয় কি?” আমরা বললাম, জী হ্যাঁ। তিনি বললেনঃ এটা কোন্ মাস?’ আমরা চুপ থাকলাম এবং ধারণা করতে লাগলাম যে, তিনি হয়ত এর (প্রচলিত) নাম ছাড়া অন্য কোন নাম দিবেন। তিনি বললেনঃ এটা যিলহাজ্জ নয় কি?’ আমরা বললাম, জী হ্যাঁ। তিনি বললেনঃ জেনে রাখ! তোমাদের জান, তোমাদের মাল, তোমাদের সন্মান তোমাদের পরস্পরের জন্য হারাম, যেমন আজকের এ মাস, তোমাদের এ শহর, আজকের এ দিন সন্মানিত। এখানে উপস্থিত ব্যাক্তি (আমার এ বাণী) যেন অনুপস্থিত ব্যাক্তির কাছে পৌঁছে দেয়। কারন উপস্থিত ব্যাক্তি হয়ত এমন এক ব্যাক্তির কাছে পৌঁছাবে, যে এ বাণীকে তার থেকে বেশি মুখস্থ রাখতে পারবে। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৫৩ ',
        name:
            ' রাসূলুল্লাহ্ (ﷺ) ওয়ায-নসীহতে ও ইলম শিক্ষা দানে উপযুক্ত সময়ের প্রতি লক্ষ্য রাখতেন, যাতে লোকজন বিরক্ত না হয়ে পড়ে।',
        hadisNumberList: [
          HadisNumberModel(
            id: '',
            name:
                '  পরিচ্ছেদঃ কথা ও আমলের পূর্বে ইলম জরুরী। আল্লাহ তা\'আলার ইরশাদঃ فَاعْلَمْ أَنَّهُ لاَ إِلَهَ إِلاَّ اللَّهُ “সুতরাং জেনে রাখ, আল্লাহ ব্যতীত প্রকৃত কোন উপাস্য নেই।” (৪৭ঃ ১৯)। এখানে আল্লাহ তা’আলা ইলমের কথা আগে বলেছেন। আলিমগণই নবীগণের ওয়ারিস। তারা ইলমের ওয়ারিস হয়েছেন। তাই যে ইলম হাসিল করে সে বিরাট অংশ লাভ করে। আর যে ব্যক্তি ইলম হাসিলের উদ্দেশ্যে পথ চলে, আল্লাহ তা’আলা তার জন্য জান্নাতের পথ সহজ করে দেন।আল্লাহ তা’আলা ইরশাদ করেনঃ إِنَّمَا يَخْشَى اللَّهَ مِنْ عِبَادِهِ الْعُلَمَاءُ আল্লাহর বান্দাদের মধ্যে আলিমগণই তাকে ভয় করে (৩৫ঃ ২৮)। আল্লাহ তা’আলা আরো ইরশাদ করেনঃ وَمَا يَعْقِلُهَا إِلاَّ الْعَالِمُونَ “আলিমগণ ছাড়া তা কেউ বুঝেনা”। অন্যত্র ইরশাদ হয়েছেঃ وَقَالُوا لَوْ كُنَّا نَسْمَعُ أَوْ نَعْقِلُ مَا كُنَّا فِي أَصْحَابِ السَّعِيرِ তারা বলবে, যদি আমরা শুনতাম অথবা বিবেক-বুদ্ধি প্রয়োগ করতাম, তাহলে আমরা জাহান্নামী হতাম না। (৬৭ঃ ১০)। আরো ইরশাদ করেনঃ هَلْ يَسْتَوِي الَّذِينَ يَعْلَمُونَ وَالَّذِينَ لاَ يَعْلَمُونَ “বল, যারা জানে আর যারা জানে না, তারা কি সমান হতে পারে? (৩৯ঃ ৯)নবী কারীম সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম বলেনঃ আল্লাহ যার কল্যাণ চান তাকে দ্বীনের জ্ঞান দান করেন। আর অধ্যায়নের মাধ্যমেই জ্ঞান অর্জিত হয়। আবু যার (রাঃ) তাঁর ঘাড়ের দিকে ইশারা করে বলেন, যদি তোমরা এখানে তরবারি ধর, এরপর আমি বুঝতে পারি যে, তোমরা আমার ওপর সে তরবারী চালাবার আগে আমি একটু কথা বলতে পারব, তবে আমি যা নবী কারিম সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম থেকে শুনেছি, তবে অবশ্যই আমি তা বলে ফেলব।নবী কারীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর বাণীঃ উপস্থিত ব্যক্তিরা যেন অনুপস্থিত ব্যক্তির কাছে (আমার বাণী) পৌঁছে দেয়। ইবনু আব্বাস (রাঃ) বলেন, كُونُوا رَبَّانِيِّينَ (তোমরা রব্বানি হও)। এখানে رَبَّانِيِّينَ মানে প্রজ্ঞাবান, আলিম ও ফকীহগণ। আরো বলা হয় رباني সে ব্যক্তি কে বলা হয় যিনি মানুষকে জ্ঞানের বড় বড় বিষয়ের পূর্বে ছোট ছোট বিষয় শিক্ষা দিয়ে গড়ে তোলেন।৬৮। মুহাম্মদ ইবন ইউসুফ (রহঃ) ... ইবন মাস’উদ (রাঃ) থেকে বর্ণিত, তিনি বলেন, নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের অবস্থার প্রতি লক্ষ্য রেখে নির্দিষ্ট দিনে ওয়ায-নসীহত করতেন, আমরা যাতে বিরক্ত না হই।',
            ref: '',
          ),
          HadisNumberModel(
            id: '৬৯।',
            name:
                '  মুহাম্মদ ইবনু বাশশার (রহঃ) ... আনাস (রাঃ) থেকে বর্ণনা করেন যে, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা (দ্বীনের ব্যাপারে) সহজ পন্থা অবলম্বন করবে, কঠিন পন্থা অবলম্বন করবে না, মানুষকে সুসংবাদ শোনাবে, বিরক্তি সৃষ্টি করবে না।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৫৪ ',
        name: 'ইলম শিক্ষার্থীদের জন্য দিন নির্দিষ্ট করা',
        hadisNumberList: [
          HadisNumberModel(
            id: '৭০।',
            name:
                '  উসমান ইবনু আবূ শায়বা (রহঃ) ... আবূ ওয়াইল (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ ইবনু মাস’উদ (রাঃ) প্রতি বৃহস্পতিবার লোকদের ওয়ায-নসীহত করতেন। তাঁকে একজন বলল, হে আবূ ‘আবদুর রহমান! আমার মন চায় যেন আপনি প্রতিদিন আমাদের নসীহত করেন। তিনি বললেনঃ এ কাজ থেকে আমাকে যা বিরত রাখে তা হল, আমি তোমাদের ক্লান্ত করতে পছন্দ করি না। আর আমি নসীহত করার ব্যাপারে তোমাদের (অবস্থার) প্রতি লক্ষ্য রাখি, যেমন রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের প্রতি লক্ষ্য রাখতেন আমাদের ক্লান্তির আশংকায়।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৫৫',
        name: ' আল্লাহ্ যার কল্যাণ চান, তাকে দ্বীনের জ্ঞান দান করেন ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৭১।  ',
            name:
                'সাঈদ ইবনু উফায়র (রহঃ) ... হুমায়দ ইবনু আবদুর রহমান (রহঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি মু’আবিয়া (রাঃ)–কে বক্তৃতারত অবস্থায় বলতে শুনেছি, তিনি বলেন, আমি রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে বলতে শুনেছি, আল্লাহ্ যার কল্যাণ চান, তাকে দ্বীনের জ্ঞান দান করেন। আমি তো কেবল বিতরণকারী, আল্লাহ্ই দানকারী। সর্বদাই এ উম্মাত (সত্যিকারের মুসলিম) কিয়ামত পর্যন্ত আল্লাহ্‌ হুকুমের উপর প্রতিষ্টিত থাকবে, বিরুদ্ধবাদীরা তাদের কোন ক্ষতি করতে পারবে না। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৫৬ ',
        name: ' ইলমের ক্ষেত্রে সঠিক অনুধাবন ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৭২। ',
            name:
                '  আলী ইবনু ‘আবদুল্লাহ (রহঃ) ... মুজাহিদ (রহঃ) থেকে বর্ণিত, তিনি বলেন, আমি সফরে মদিনা পর্যন্ত ইবনু উমর (রাঃ) এর সঙ্গে ছিলাম। এ সময় তাঁকে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে একটি মাত্র হাদীস রেওয়ায়েত করতে শুনেছি। তিনি বলেন, আমরা একবার নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে ছিলাম। তখন তাঁর নিকট খেজুর গাছের মথি আনা হল। তারপর তিনি বললেনঃ গাছপালার মধ্যে এমন একটি গাছ আছে যার দৃষ্টান্ত মুসলিমের ন্যায়। তখন আমি বলতে চাইলাম যে, তা হল খেজুর গাছ, কিন্তু আমি ছিলাম উপস্থিত সবার চাইতে বয়সে ছোট। তাই চুপ করে রইলাম। তখন রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ গাছটি হল খেজুর গাছ।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৫৭',
        name: ' ইলম ও হিকমতের ক্ষেত্রে সমতুল্য হওয়ার আগ্রহ ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'উমর (রাঃ) বলেন, তোমরা নেতৃত্ব লাভের আগেই জ্ঞান হাসিল করে নাও। আবূ আবদুল্লাহ্ (বুখারী) বলেন, আর নেতা বানিয়ে দেওয়ার পরও, কেননা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সাহাবীগণ বয়োবৃদ্ধকালেও ইলম শিক্ষা করেছেন।৭৩। হুমায়দী (রহঃ) ... আবদুল্লাহ ইবনু মাস’উদ (রাঃ) থেকে বর্ণিত, তিনি বলেন, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কেবলমাত্র দু’টি ব্যাপারই ঈর্ষা করা যায়; (১) সে ব্যাক্তির উপর, যাকে আল্লাহ্ তা’আলা সম্পদ দিয়েছেন, এরপর তাকে হক পথে অকাতরে ব্যয় করার ক্ষমতা দেন; (২) সে ব্যাক্তির উপর, যাকে আল্লাহ্ তা’আলা হিকমত দান করেছেন, এরপর সে তার সাহায্যে ফায়সালা করে ও তা শিক্ষা দেয়। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৫৮ ',
        name: 'সমুদ্রে খিযর (আঃ)-এর কাছে মূসা (আঃ)-এর যাওয়া ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'আর আল্লাহ্ তা’আলার বানীঃ (هَلْ أَتَّبِعُكَ عَلَى أَنْ تُعَلِّمَنِي مِمَّا عُلِّمْتَ رُشْدًا) (আমি কি আপনার অনুসরণ করব এ শর্তে যে, সত্য পথের যে জ্ঞান আপনাকে দান করা হয়েছে তা থেকে আমাকে শিক্ষা দেবেন। (১৮ঃ ৬৬)৭৪। মুহাম্মদ ইবনু গুরায়র আয-যুহরী (রহঃ) ... ইবনু আব্বাস (রাঃ) থেকে বর্ণিত, তিনি এবং হুর ইবনু কায়স ইবনু হিসন আল ফাযারী মূসা (আঃ) এর সঙ্গী সম্পর্কে বাদানুবাদ করেছিলেন। ইবনু আব্বাস (রাঃ) বললেন, তিনি ছিলেন খিযর। ঘটনাক্রমে তখন তাদের পাশ দিয়ে উবাই ইবনু কা’ব (রাঃ) যাচ্ছিলেন। ইবনু ‘আব্বাস (রাঃ) তাঁকে ডেকে বললেনঃ আমি ও আমার এ ভাই মতবিরোধ পোষণ করছি মূসা (আঃ) এর সেই সঙ্গীর ব্যাপারে যাঁর সাথে সাক্ষাত করার জন্য মূসা (আঃ) আল্লাহর কাছে পথের সন্ধান চেয়েছিলেন—আপনি কি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে তাঁর সম্পর্কে কিছু বলতে শুনেছেন? তিনি বললেন, হ্যাঁ, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি, একবার মূসা (আঃ) বনী ইসরাঈলের কোন এক মজলিসে হাজির ছিলেন। তখন তাঁর কাছে এক ব্যাক্তি এসে বলল, ‘আপনি কাউকে আপনার চেয়ে অধিক জ্ঞানী বলে জানেন কি?’ মূসা (আঃ) বললেন, না।তখন আল্লাহ্ তা’আলা মূসা (আঃ) এর কাছে ওহী পাঠালেনঃ হ্যাঁ, আমার বান্দা খিযর। অতঃপর মূসা (আঃ) তাঁর সাথে সাক্ষাত করার রাস্তা জানতে চাইলেন। আল্লাহ্ তা’আলা মাছকে তার জন্য নিশানা বানিয়ে দিলেন এবং তাঁকে বলা হল, তুমি যখন মাছটি হারিয়ে ফেলবে তখন ফিরে আসবে। কারন, কিছুক্ষনের মধ্যেই তুমি তাঁর সাক্ষাত পাবে। তখন তিনি সমুদ্রে সে মাছেরনিশানা অনুসরন করতে লাগলেন। মূসা (আঃ)-কে তাঁর সঙ্গী যুবক বললেন, (কুরআন মজীদের ভাষায়ঃ)أَرَأَيْتَ إِذْ أَوَيْنَا إِلَى الصَّخْرَةِ فَإِنِّي نَسِيتُ الْحُوتَ وَمَا أَنْسَانِيهِ إِلَّا الشَّيْطَانُ أَنْ أَذْكُرَهُ قَالَ ذَلِكَ مَا كُنَّا نَبْغِي فَارْتَدَّا عَلَى آثَارِهِمَا قَصَصًا“আপনি কি লক্ষ্য করেছেন আমরা যখন পাথরের কাছে বিশ্রাম নিচ্ছিলাম তখন আমি মাছের কথা ভুলে গিয়েছিলাম? শয়তান তার কথা আমাকে ভুলিয়ে দিয়েছিল। ... মূসা বললেন, আমরা তো সে স্থানটিরই অনুসন্ধান করছিলাম। এরপর তারা নিজেদের পদচিহ্ন ধরে ফিরে চলল। (১৮ : ৬৩-৬৪)তাঁরা খিযরকে পেলেন। তাদের ঘটনা তা-ই, যা আল্লাহ্ তা’আলা তাঁর কিতাবে বর্ণনা করেছেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৫৯ ',
        name:
            ' নবী (ﷺ) এর উক্তিঃ হে আল্লাহ্! আপনি তাকে কিতাব (কুরআন) শিক্ষা দিন। ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৭৫। ',
            name:
                ' আবূ মা’মার (রহঃ) ... ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিত, তিনি বলেন, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একবার আমাকে জড়িয়ে ধরে বললেনঃ হে আল্লাহ্! আপনি তাকে কিতাব (কুরআন) শিক্ষা দিন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৬০ ',
        name: '  বালকদের কোন বয়সের শোনা কথা গ্রহণীয়।',
        hadisNumberList: [
          HadisNumberModel(
            id: '৭৬। ',
            name:
                '  ইসমাঈল (রহঃ) ... আবদুল্লাহ ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি বালক হবার নিকটবর্তী বয়সে একবার একটি মাদী গাধার উপর সওয়ার হয়ে এলাম। আর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তখন কোন দেওয়াল সামনে না রেখেই মিনায় সালাত (নামায/নামাজ) আদায় করছিলেন। তখন আমি কোন এক কাতারের সামনে দিয়ে গেলাম এবং মাদী গাধাটিকে চরে খাওয়ার জন্য ছেড়ে দিলাম। আমি কাতারে ভেতর ঢুকে পড়লাম কিন্তু এতে কেউ আমাকে নিষেধ করলেন না।',
            ref: '',
          ),
          HadisNumberModel(
            id: '৭৭। ',
            name:
                ' মুহাম্মদ ইবনু ইউসুফ (রহঃ) ... মাহমূদ ইবনুুর-রাবী (রাঃ) থেকে বর্ণিত, তিনি বলেন, আমার মনে আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একবার বালতি থেকে পানি নিয়ে আমার মুখমন্ডলে কুলি করে দিয়েছিলেন, তখন আমি ছিলাম পাঁচ বছরের বালক। ',
            ref: '',
          )
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৬১',
        name: ' ইলম হাসিলের জন্য বের হওয়া',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                ' وَرَحَلَ جَابِرُ بْنُ عَبْدِ اللَّهِ مَسِيرَةَ شَهْرٍ إِلَى عَبْدِ اللَّهِ بْنِ أُنَيْسٍ فِي حَدِيثٍ وَاحِدٍ জাবির ইবন ‘আবদুল্লাহ্ (রাঃ) একটি মাত্র হাদীসের জন্য ‘আবদুল্লাহ্ ইবন উনায়স (রাঃ) এর কাছে এক মাসের পথ সফর করে গিয়েছিলেন। ৭৮। হিমস নগরের কাযী আবূল কাসিম খালিদ ইবনু খালীয়ি (রহঃ) ... ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিত, একবার তিনি এবং হুর ইবনু কায়স ইবনু আল ফাযারী মূসা (আঃ) এর সঙ্গীর ব্যাপারে বাদানুবাদ করছিলেন। তখন উবাঈ ইবনু কা’ব (রাঃ) তাঁদের পাশ দিয়ে যাচ্ছিলেন। ইবনু ‘আব্বাস (রাঃ) তাঁকে ডেকে বললেনঃ আমি ও আমার এ ভাই মতবিরোধ পোষণ করছি মূসা (আঃ) এর সেই সঙ্গীর ব্যাপারে যাঁর সাথে সাক্ষাত করার জন্য মূসা (আঃ) আল্লাহর কাছে পথের সন্ধান চেয়েছিলেন—আপনি কি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে তাঁর সম্পর্কে কিছু বলতে শুনেছেন? উবাঈ (রাঃ) বললেন, হ্যাঁ, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে তাঁর প্রসঙ্গে বলতে শুনেছি যে, একবার মূসা (আঃ) বনী ইসরাঈলের কোন এক মজলিসে হাজির ছিলেন। তখন তাঁর কাছে এক ব্যাক্তি এসে বলল, ‘আপনি কাউকে আপনার চেয়ে অধিক জ্ঞানী বলে জানেন কি?’ মূসা (আঃ) বললেন, না। তখন আল্লাহ্ তা’আলা মূসা (আঃ) এর কাছে ওহী পাঠালেনঃ হ্যাঁ, আমার বান্দা খিযর। এরপর তিনি তাঁর সাথে সাক্ষাত করার রাস্তা জানতে চাইলেন। আল্লাহ্ তা’আলা মাছকে তার জন্য নিশানা বানিয়ে দিলেন এবং তাঁকে বলা হল, তুমি যখন মাছটি হারিয়ে ফেলবে তখন তুমি প্রত্যাবর্তন করবে। তাহলে কিছুক্ষনের মধ্যেই তুমি তাঁর সাক্ষাত পাবে। তিনি সমুদ্রে সে মাছেরনিশানা অনুসরন করতে লাগলেন। যা হোক, মূসা (আঃ)-কে তাঁর সঙ্গী যুবক বললেন, (পবিত্র কুরআনের ভাষায়ঃ) أَرَأَيْتَ إِذْ أَوَيْنَا إِلَى الصَّخْرَةِ فَإِنِّي نَسِيتُ الْحُوتَ وَمَا أَنْسَانِيهِ إِلَّا الشَّيْطَانُ أَنْ أَذْكُرَهُ “আপনি কি লক্ষ্য করেছেন আমরা যখন পাথরের কাছে বিশ্রাম নিচ্ছিলাম তখন আমি মাছের কথা (বলতে) ভুলে গিয়েছিলাম।আর শয়তান তার কথা আমাকে ভুলিয়ে দিয়েছিল।” (১৮ : ৬৩)। ... মূসা (আঃ) বললেনঃ ذَلِكَ مَا كُنَّا نَبْغِي فَارْتَدَّا عَلَى آثَارِهِمَا قَصَصًا “আমরা সে স্থানটির অনুসন্ধান করছিলাম (১৮ : ৬৪)। তারপর তাঁরা নিজেদের পদচিহ্ন ধরে ফিরে চললেন। শেষে তাঁরা খিযর (আঃ)-কে পেয়ে গেলেন। তাঁদের (পরবর্তী) ঘটনা আল্লাহ্ তা’আলা তাঁর কিতাবে বর্ণনা করেছেন।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৬২ ',
        name: ' ইলম শিক্ষার্থী ও শিক্ষাদাতার ফযীলত। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ৭৯। ',
            name:
                ' মুহাম্মদ ইবনুল-আলা (রহঃ) ... আবূ মূসা (রাঃ) থেকে বর্ণিত যে, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আল্লাহ্ তা’আলা আমাকে যে হিদায়ত ও ইল্‌ম দিয়ে পাঠিয়েছেন তার দৃষ্টান্ত হল যমীনের উপর পতিত প্রবল বৃষ্টির ন্যায়। কোন কোন ভূমি থাকে উর্বর যা সে পানি শুষে নিয়ে প্রচুর পরিমানে ঘাসপাতা এবং সবুজ তরুলতা উৎপাদন করে। আর কোন কোন ভূমি থাকে কঠিন যা পানি আটকে রাখে। পরে আল্লাহ্ তা’আলা তা দিয়ে মানুষের উপকার করেন; তারা নিজেরা পান করে ও (পশুপালকে) পান করায় এবং তার দ্বারা চাষাবাদ করে। আবার কোন কোন জামি আছে যা একেবারে মসৃণ ও সমতল; তা না পানি আটকে রাখে, আর না কোন ঘাসপাতা উৎপাদন করে। এই হল সে ব্যাক্তির দৃষ্টান্ত যে দ্বীনের জ্ঞান লাভ করে এবং আল্লাহ্ তা’আলা আমাকে যা দিয়ে প্রেরণ করেছেন তাতে সে উপকৃত হয়। ফলে সে নিজে শিক্ষা করে এবং অপরকে শিক্ষা দেয়। আর সে ব্যাক্তির দৃষ্টান্ত-যে সে দিকে মাথা তুলে তাকায়ই না এবং আল্লাহর যে হিদায়ত নিয়ে আমি প্রেরিত হয়েছি, তা গ্রহণও করে না। আবূ ‘আবদুল্লাহ (মুখারী) (রহঃ) বলেনঃ ইসহাক (রহঃ) থেকে বর্ণনা করেছেনঃ তিনিقَبِلَت এর স্থলে قَيَّلَت (আটকিয়ে রাখে) ব্যবহার করেছেন।قَاعٌ হল এমন ভূমি যার উপর পানি জমে থাকে। আর الصَّفْصَفُ হল সমতল ভূমি।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৬৩ ',
        name: '  ইলমের বিলুপ্তি ও মূর্খতার প্রসার',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                ' وَقَالَ رَبِيعَةُ لاَ يَنْبَغِي لأَحَدٍ عِنْدَهُ شَيْءٌ مِنَ الْعِلْمِ أَنْ يُضَيِّعَ نَفْسَهُ রাবী’আ (রহঃ) বলেন, ‘যার কছে কিছুমাত্র ইলম আছে, তার উচিৎ নয় নিজেকে অপমানিত করা। ৮০। ইমরান ইবনু মায়সারা (রহঃ) ... আনাস (রাঃ) থেকে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন যে, কিয়ামতের কিছু নিদর্শন হলঃ ইলম লোপ পাবে, অজ্ঞাতার বিস্তৃতি ঘটবে, মদপান ব্যাপক হবে এবং ব্যভিচার ছড়িয়ে পড়বে।',
            ref: '',
          ),
          HadisNumberModel(
            id: '৮১।  ',
            name:
                ' মূসা’দ্দাদ (রহঃ) ... আনাস (রাঃ) থেকে বর্ণিত, তিনি বলেন, আমি তোমাদের এমন একটি হাদীস বর্ণনা করব যা আমার পর তোমাদের কাছে আর কেউ বর্ণনা করবেন না। আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি যে, কিয়ামতের কিছু নিদর্শন হলঃ ইলম কমে যাবে, অজ্ঞতার প্রসার ঘটবে, ব্যভিচার ছড়িয়ে পড়বে, স্ত্রীলোকের সংখ্যা বেড়ে যাবে এবং পুরুষের সংখ্যা কমে যাবে, এমনকি প্রতি পঞ্চাশজন স্ত্রীলোকের জন্য মাত্র একজন পুরুষ হবে তত্ত্বাবধায়ক।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৬৪/',
        name: ' ইলমের ফযীলত ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৮২। ',
            name:
                ' সাঈদ ইবনু ‘উফায়র (রহঃ) ... ইবনু ‘উমর (রাঃ) থেকে বর্ণিত, তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি, একবার আমি ঘুমিয়ে ছিলাম। তখন (স্বপ্নে) আমার কাছে এক পেয়ালা দুধ আনা হল। আমি তা পান করলাম (তার পরিতৃপ্তি আমার সর্বাঙ্গে ছড়িয়ে পড়ল।) এমনকি আমার মনে হতে লাগল যে, সে তৃপ্তি আমার নখ দিয়ে বের হচ্ছে। এরপর যেটুকু অবশিষ্ট ছিল, তা আমি ‘উমর ইবনুল খাত্তাবকে দিলাম। সাহাবায়ে কিরাম জানতে চাইলেন, ইয়া রাসূলাল্লাহ! আপনি এ স্বপ্নের কী তা’বীর করেন? তিনি জওয়াবে বললেনঃ তা হল ইলম। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৬৫/ ',
        name: '  প্রাণী বা অন্য বাহনে আসীন অবস্থায় ফতোয়া দেওয়া।',
        hadisNumberList: [
          HadisNumberModel(
            id: '৮৩। ',
            name:
                ' ইসমাঈল (রহঃ) ... আবদুল্লাহ ইবনু আমর ইবনু আস (রাঃ) থেকে বর্ণিত যে, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বিদায় হাজ্জের (হজ্জ) দিনে মিনায় মানুষের (প্রশ্নের উত্তর দানের) জন্য (বাহনের উপর) বসা ছিলেন। লোকে তাঁর কাছে বিভিন্ন মাসআলা জিজ্ঞাসা করছিল। এক ব্যাক্তি তাঁর কাছে এসে বলল, আমি ভুলবশত কুরবানী করার আগেই মাথা মুড়িয়ে ফেলেছি। তিনি বললেনঃ যবেহ কর, কোন ক্ষতি নেই। আর এক ব্যাক্তি এসে বলল, আমি ভুলবশত কঙ্কর নিক্ষপের আগেই কুরবাণী করে ফেলেছি। তিনি বললেনঃ কঙ্কর ছুঁড়ো, কোন অসুবিধা নেই। আবদুল্লাহ ইবনু আমর (রহঃ) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে সে দিন আগে বা পরে করা যে কাজ সম্পর্কেই জিজ্ঞাসা করা হচ্ছিল, তিনি একথাই বলছিলেনঃ কর, কোন ক্ষতি নেই। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৬৬/ ',
        name: ' হাত ও মাথার ইশারায় মাসয়ালার জবাব দান ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ৮৪। ',
            name:
                ' মূসা ইবনু ইসমাঈল (রহঃ) ... ইবনু আব্বাস (রাঃ) থেকে বর্ণিত, হাজ্জের সময় নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে (নানা বিষয়ে) জিজ্ঞাসা করা হল। কোন একজন বললঃ আমি কঙ্কর নিক্ষেপের পূর্বেই যবেহ করে ফেলেছি। ইবনু আব্বাস (রাঃ) বলেন, তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হাত দিয়ে ইশারা করে বললেনঃ কোন অসুবিধা নেই। আর এক ব্যাক্তি বললঃ আমি যবেহ করার পূর্বে মাথা মুড়িয়ে ফেলেছি। তিনি হাত দিয়ে ইশারা করলেনঃ কোন অসুবিধা নেই (যেহেতু ভুলবশতঃ করা হয়েছে)।',
            ref: '',
          ),
          HadisNumberModel(
            id: '৮৫। ',
            name:
                '  মাক্বী ইবনু ইবরাহীম (রহঃ) ... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ (শেষ যামানায়) ইলম তুলে নেওয়া হবে, অজ্ঞতা ও ফিতনার প্রসার ঘটবে এবং হারাজ বেড়ে যাবে। জিজ্ঞাসা করা হল, ইয়া রাসূলাল্লাহ! হারাজ কি? তিনি হাত দিয়ে ইশারা করে বললেনঃ এ রকম। যেন তিনি এর দ্বারা হত্যা বুঝিয়েছিলেন।',
            ref: '',
          ),
          HadisNumberModel(
            id: '৮৬।  ',
            name:
                'মূসা ইবনু ইসমাঈল (রহঃ) ... আসমা (রাঃ) থেকে বর্ণিত তিনি বলেন, আমি আয়িশা (রাঃ) এর কাছে এলাম, তিনি তখন সালাত (নামায/নামাজ) আদায় করছিলেন। আমি বললাম, মানুষের কি হয়েছে? তিনি আকাশের দিকে ইঙ্গিত করলেন (দেখ, সূর্য গ্রহণ লেগেছে)। তখন সকল লোক (সালাতে কুসূফ আদায়ের জন্য) দাঁড়িয়ে রয়েছে। আয়িশা (রাঃ) বললেন, সুবহানাল্লাহ্! আমি বললাম, এটা কি কোন নিদর্শন? তিনি মাথা ইশারা করলেন, হ্যাঁ। এরপর আমি (সালাতে) দাঁড়িয়ে গেলাম। এমনকি (সালাত এত দীর্ঘ ছিল যে,) আমার বেহুঁশ হয়ে পড়ার উপক্রম হল। তাই আমি মাথায় পানি ঢালতে লাগলাম। পরে (সালাত শেষে) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আল্লাহর হামদ ও সানা বর্ণনা করলেন। এরপর বললেনঃ যা কিছু আমাকে ইতিপূর্বে দেখানো হয়নি, তা আমি আমার এ স্থানেই দেখতে পেয়েছি। এমনকি জান্নাত এবং জাহান্নামও দেখেছি। এরপর আল্লাহ্ তাআলা আমার কাছে ওহী প্রেরণ করলেন, তোমাদেরকে কবরের মধ্যে পরীক্ষা করা হবে দাজ্জালের ন্যায় (কঠিন) পরীক্ষা অথবা তার কাছাকাছি।ফাতিমা (রাঃ) বলেন, আসমা (রাঃ)مثل (অনুরূপ) শব্দ বলেছিলেন, না قريب (কাছাকাছি) শব্দ, তা ঠিক আমার মনে নেই। (কবরের মধ্যে) বলা হবে, এ ব্যাক্তি সম্পর্কে তুমি কি জানো? তখন মুমিন ব্যাক্তি বা মুকিন (বিশ্বাসী) ব্যাক্তি [ফাতিমা (রাঃ) বলেন] আসমা (রাঃ) এর কোন্ শব্দটি বলেছিলেন ঠিক আমার মনে নেই, বলবে তিনি মুহাম্মদসাল্লাল্লাহু আলাইহি ওয়াসাল্লাম, তিনি আল্লাহর রাসূল। আমাদের কাছে মুজিযা ও হিদায়ত নিয়ে এসেছিলেন। আমরা তা গ্রহণ করেছিলাম এবং তাঁর অনুসরণ করেছিলাম। তিনি মুহাম্মদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম। তিনবার এরূপ বলবে। তখন তাকে বলা হবে, আরামে ঘুমাও, আমরা জানতে পারলাম যে, তুমি (দুনিয়ায়) তাঁর ওপর বিশ্বাসী ছিলে। আর মুনাফিক অথবা মুরতাব (সন্দেহ পোষণকারী) ফাতিমা বলেন, আসমা কোনটি বলেছিলেন, আমি ঠিক মনে করতে পারছি না- বলবে, আমি কিছুই জানিনা। মানুষকে (তাঁর সম্পর্কে) কি যেন বলতে শুনেছি, তাই আমিও তাই বলেছি। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৬৭/',
        name:
            '  আবুল কায়েস গোত্রের প্রতিনিধি দলকে ঈমান এবং ইলমের হিফাজত করা এবং পরবর্তীদেরকে তা অবহিত করার বাপারে নবী (ﷺ) এর উৎসাহ দান।',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'وَقَالَ مَالِكُ بْنُ الْحُوَيْرِثِ قَالَ لَنَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: ارْجِعُوا إِلَى أَهْلِيكُمْ، فَعَلِّمُوهُمْ মালিক ইবনুল হুওয়াইরিস (রাঃ) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের বলেছিলেন, তোমরা তোমাদের গোত্রের নিকট ফিরে যাও এবং তাদেরকে শিক্ষা দাও। ৮৭। মুহাম্মদ ইবনু বাশ্‌শার (রহঃ) ... আবূ জামরা (রহঃ) থেকে বর্ণিত, তিনি বলেন, আমি ইবনু আব্বাস (রাঃ) ও লোকদের মধ্যে দোভাষীর কাজ করতাম। একদিন ইবনু আব্বাস (রাঃ) বললেন, আবদুল কায়স গোত্রের প্রতিনিধি দল নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এলে, তিনি বললেনঃ তোমরা কোন্ প্রতিনিধি দল? অথবা বললেনঃ তোমরা কোন্ গোত্রের? তারা বলল, রাবীআ গোত্রের। তিনি বললেনঃ মারহাবা। এ গোত্রের প্রতি অথবা এ প্রতিনিধি দলের প্রতি, এরা কোনরূপ অপদস্থ না হয়েই এসেছে। তারা বলল, আমরা বহু দূর থেকে আপনার কাছে এসেছি। আর আমাদের ও আপনার মাঝে রয়েছে কাফিরদের এই মুযার গোত্রের বাস। আমরা শাহ্‌র-ই হারাম- ছাড়া আপনার কাছে আসতে সক্ষম নই। সুতরাং আমাদের এমন কিছু নির্দেশ দিন, যা আমাদের পশ্চাতে যারা রয়েছে তাদের কাছে পৌঁছাতে এবং তার ওসীলায় আমরা জান্নাতে দাখিল হতে পারি। তখন তিনি তাদের চারটি কাজের নির্দেশ দিলেন এবং চারটি কাজ থেকে নিষেধ করলেন। তাদের এক আল্লাহর উপর ঈমান আনার নির্দেশ দিলেন। তিনি বললেনঃ এক আল্লাহর উপর ঈমান আনা কিরূপে হয় জানো? তারা বললঃ আল্লাহ্ ও তাঁর রাসূলই ভাল জানেন। তিনি বললেনঃ তা হল এ সাক্ষ্য দেওয়া যে, আল্লাহ্ ছাড়া ইলাহ নেই এবং মুহাম্মদসাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আল্লাহর রাসূল, সালাত (নামায/নামাজ) কায়েম করা, যাকাত দেওয়া এবং রমযান এর সিয়াম পালন করা আর তোমাদের গনীমাতের মাল থেকে এক-পঞ্চমাংশ দান করবে। আর তাদের নিষেধ করলেন শুকনো লাউয়ের খোল, সবুজ কলস এবং আলকাতরার পালিশকৃত পাত্র ব্যবহার করতে। শুবা বলেন, কখনও (আবূ জামরা) খেজুর গাছ থেকে তৈরী পাত্রের কথাও বলেছেন আবার তিনি কখনও (النقير) এর স্থলে (المقير) বলেছেন। রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তোমরা এগুলো মনোযোগ সহকারে স্মরণ রাখ এবং তোমাদের পশ্চাতে যারা রয়েছে তাদের পৌঁছে দাও।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৬৮/',
        name: '  উদ্ভূত মাসআলার জন্য সফর করা এবং নিজের পরিজনদের শিক্ষা দেওয়া ।',
        hadisNumberList: [
          HadisNumberModel(
            id: '৮৮। ',
            name:
                '  মুহাম্মদ ইবনু মুকাতিল আবূল হাসান (রহঃ) ... উকবা ইবনুল হারিস (রাঃ) বর্ণনা করেন, তিনি আবূ ইহাব ইবনু আযীয (রহঃ)-এর কন্যাকে বিবাহ করলে তাঁর কাছে একজন স্ত্রীলোক এসে বলল, আমি উকবা (রাঃ)-কে এবং সে যাকে বিয়ে করেছে তাকে (আবূ ইহাবের কন্যাকে) দুধ পান করিয়েছি। উকবা (রাঃ) তাকে বললেনঃ আমি জানিনা যে, তুমি আমাকে দুধ পান করিয়েছ। আর (ইতিপূর্বে) তুমি আমাকে একথা জানাওনি। এরপর তিনি মদিনায় রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে গেলেন এবং তাঁকে জিজ্ঞাসা করলেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ এ কথার পর তুমি কিভাবে তার সঙ্গে সংসার করবে? এরপর উকবা তাঁর স্ত্রীকে আলাদা করে দিলেন এবং সে মহিলা অন্য স্বামীর সঙ্গে বিবাহ বন্ধনে আবদ্ধ হল।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৬৯/ ',
        name: 'পালাক্রমে ইলম শিক্ষা করা । ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৮৯। ',
            name:
                '  আবূল ইয়ামান (রহঃ) ও ইবনু ওহাব (রহঃ) ... উমর (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি ও আমার এক আনসারী প্রতিবেশী বনি উমায়্যা ইবনু যায়দের মহল্লায় বাস করতাম। এ মহল্লাহটি ছিল মদিনার ঊঁচু এলাকায় অবস্থিত। আমরা দুজনে পালাক্রমে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর খিদমতে হাযির হাতম। তিনি একদিন আসতেন আর আমি একদিন আসতাম। আমি যেদিন আসতাম, সেদিনের ওহী প্রভৃতির খবর নিয়ে তাঁকে পৌঁছে দিতাম। আর তিনি যেদিন আসতেন সেদিন তিনি অনুরূপ করতেন। এরপর একদিন আমার আনসারী সঙ্গী তাঁর পালার দিন এলেন এবং (সেখান থেকে ফিরে) আমার দরজায় খুব জোরে করাঘাত করতে লাগলেন। (আমার নাম নিয়ে) বলতে লাগলেন, তিনি কি এখানে আছেন? আমি ঘাবড়ে গিয়ে তাঁর দিকে গেলাম। তিনি বললেন, এক বিরাট ঘটনা ঘটে গেছে [রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর স্ত্রীগণকে তালাক দিয়েছেন]। আমি তখনি (আমার কন্যা) হাফসা (রাঃ)-এর কাছে গেলাম। তিনি তখন কাঁদছিলেন। আমি বললাম, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কি তোমাদের তালাক দিয়ে দিয়েছেন? তিনি বললেন, আমি জানিনা। এরপর আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে গেলাম এবং দাঁড়িয়ে থেকেই বললামঃ আপনি কি আপনার স্ত্রীদের তালাক দিয়েছেন? জবাবে তিনি বললেনঃ না। আমি তখন আল্লাহু আকবার বলে উঠলাম।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৭০ ',
        name: ' অপছন্দনীয় কিছু দেখলে ওয়ায-নাসীহত বা শিক্ষাদানের সময় রাগ করা',
        hadisNumberList: [
          HadisNumberModel(
            id: '৯০। ',
            name:
                '  মুহাম্মদ ইবনু কাসীর (রহঃ) ... আবূ মাসউদ আনসারী (রাঃ) থেকে বর্ণিত, তিনি বলেন, একবার এক ব্যাক্তি বলল, ইয়া রাসূলাল্লাহ! আমি সালাতে (জামাতে) শামিল হতে পারি না। কারন অমুক ব্যাক্তি আমাদের নিয়ে খুব লম্বা করে সালাত (নামায/নামাজ) আদায় করেন। [আবূ মাসউদ (রাঃ) বলেন,] আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে কোন ওয়াযের মজলিসে সেদিনের তুলনায় বেশি রাগান্বিত হতে দেখিনি। (রাগত স্বরে) তিনি বললেনঃ হে লোক সকল! তোমরা মানুষের মধ্যে বিরক্তির সৃষ্টি কর। অতএব যে লোকদের নিয়ে সালাত (নামায/নামাজ) আদায় করবে সে যেন সংক্ষেপ করে। কারন তাদের মধ্যে রোগী, দুর্বল ও কর্মব্যস্ত লোকও থাকে।',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ৯১।  ',
            name:
                'আবদুল্লাহ ইবনু মুহাম্মদ (রহঃ) ... যায়েদ ইবনু খালিদ আল-জুহানী (রাঃ) থেকে বর্ণিত যে, এক ব্যাক্তি রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে হারানো বস্তু প্রাপ্তি সম্পর্কে জিজ্ঞাসা করল। তিনি বললেনঃ তার বাঁধনের রশি অথবা বললেন, থলে-ঝুলি ভাল করে চিনে রাখ। এরপর এক বছর পর্যন্ত তার ঘোষণা দিতে থাক। তারপর (মালিক পাওয়া না গেলে) তুমি তা ব্যবহার কর। এরপর যদি এর মালিক আসে তবে তাকে তা দিয়ে দেবে। সে বলল, হারানো উট পাওয়া গেলে? এ কথা শুনে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এমন রেগে গেলেন যে, তাঁর চেহারা মুবারক লাল হয়ে গেল। অথবা বর্ণনাকারী বলেন, তাঁর মুখমন্ডল লাল হয়ে গেল। তিনি বললেনঃ উট নিয়ে তোমার কি হয়েছে? তার তো আছে পানির মশক ও শক্ত পা। পানির কাছে যেতে পারে এবং গাছের লতা-পাতা খেতে পারে। তাই তাকে ছেড়ে দাও, যাতে মালিক তাকে পেয়ে যায়। সে বলল, হারানো বকরী পাওয়া গেলে? তিনি বললেন, সেটি তোমার, নয়ত তোমার ভাইয়ের, নয়ত বাঘের।',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ৯২।',
            name:
                ' মুহাম্মদ ইবনুল আলা (রহঃ) ... আবূ মূসা (রাঃ) থেকে বর্ণিত, তিনি বলেন, একবার নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে কয়েকটি অপছন্দনীয় বিষয় সম্পর্কে জিজ্ঞাসা করা হল। প্রশ্নের সংখ্যা যখন বেশি হয়ে গেল, তখন তিনি রেগে গিয়ে লোকদের বললেনঃ তোমরা আমার কাছে যা ইচ্ছা প্রশ্ন কর। এক ব্যাক্তি বলল, আমার পিতা কে? তিনি বললেনঃ তোমার পিতা হুযাফা। আর এক ব্যাক্তি দাঁড়িয়ে বলল, ইয়া রাসূলাল্লাহ! আমার পিতা কে? তিনি বললেনঃ তোমার পিতা হল শায়বার মাওলা (আযাদকৃত গোলাম) সালিম। তখন উমর (রাঃ) রাসূলূল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এড় চেহারার অবস্থা দেখে বললেনঃ ইয়া রাসূলাল্লাহ! আমরা মহান আল্লাহ্ তাআলার কাছে তওবা করছি। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৭১। ',
        name: '  ইমাম বা মুহাদ্দিসের সামনে হাঁটু গেড়ে বসা',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ৯৩।',
            name:
                '  আবূল ইয়ামান (রহঃ) ... আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত, একবার রাসূলূল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বের হলেন। তখন আবদুল্লাহ ইবনু হুযাফা দাঁড়িয়ে বললেন, আমার পিতা কে? তিনি বললেনঃ তোমার পিতা হুযাফা। এরপর তিনি বারবার বলতে লাগলেন, তোমরা আমার কাছে প্রশ্ন কর। উমর (রাঃ) তখন হাঁটু গেড়ে বসে বললেনঃ আমরা আল্লাহকে রব হিসাবে, ইসলামকে দ্বীন হিসাবে এবং মুহাম্মদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে নবী হিসেবে সন্তুষ্ট চিত্তে গ্রহণ করে নিয়েছি। তিনি এ কথা তিনবার বললেন। তখন রাসূলূল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নীরব হলেন।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৭২।',
        name: ' ভালবাবে বুঝবার জন্য কোন কথা তিনবার বলা ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                ' নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ ‘মিথ্যা কথা থেকে সাবধান!’ এ কথাটি তিনি বারবার বলতে লাগলেন। ইবন ‘উমর (রাঃ) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (বিদায় হজ্জে) বলেছেনঃ আমি কি পৌঁছে দিয়েছি? একথা তিনি তিনবার বলেছেন। ৯৪। আবদা (রহঃ) ... আনাস (রাঃ) থেকে বর্ণিত, তিনি বলেন, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন সালাম করতেন, তিনবার সালাম করতেন। আর যখন কোন কথা বলতেন তা তিনবার বলতেন।',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ৯৫।',
            name:
                '  আবদা ইবনু আবদুল্লাহ (রহঃ) ... আনাস (রাঃ) থেকে বর্ণিত, তিনি বলেন, নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন কোন কথা বলতেন তখন তা তিনবার বলতেন যাতে তা বুঝে নেওয়া যায়। আর যখন কোন কওমের নিকট এসে সালাম করতেন, তাদের প্রতি তিনবার সালাম করতেন।',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ৯৬। ',
            name:
                ' মূসা’দ্দাদ (রহঃ) ... আবদুল্লাহ ইবনু আমর (রাঃ) থেকে বর্ণিত, তিনি বলেন, আমাদের এক সফরে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পেছনে রয়ে গেলেন। এরপর তিনি আমাদের নিকট এমন সময় পৌঁছলেন যখন আমাদের সালাতুল আসরের প্রস্তুতিতে দেরী হয়ে গিয়েছিল। আমরা উযূ (ওজু/অজু/অযু) করতে গিয়ে আমাদের পা মোটামুটিভাবে পানি দিয়ে ভিজিয়ে নিচ্ছিলাম। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উচ্চস্বরে ঘোষণা দিলেনঃ পায়ের গোড়ালী শুকনো থাকার জন্য জাহান্নামের শাস্তি রয়েছে। তিনি একথা দুবার কিংবা তিনবার বললেন।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৭৩। ',
        name: ' আপন দাসী ও পরিবারবর্গকে শিক্ষা দান ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৯৭।  ',
            name:
                ' মুহাম্মদ ইবনু সালাম (রহঃ) ... আবূ বুরদা (রহঃ), তাঁর পিতা থেকে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তিন ধরনের লোকের জন্য দুটি সওয়াব রয়েছেঃ (১) আহলে কিতাব—যে ব্যাক্তি তার নবীর ওপর ঈমান এনেছে এবং মুহাম্মদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর উপরও ঈমান এনেছে। (২) যে ক্রীতদাস আল্লাহর হক আদায় করে এবং তার মালিকের হকও (আদায় করে)। (৩) যার একটি বাঁদী ছিল, যার সাথে সে মিলিত হত। তারপর তাকে সে সুন্দরভাবে আদব-কায়দা শিক্ষা দিয়েছে এবং ভালভাবে দ্বীনী ইলম শিক্ষা দিয়েছে, এরপর তাকে আযাদ করে বিয়ে করেছে; তার জন্য দুটি সওয়াব রয়েছে। এরপর বর্ণনাকারী আমের (রহঃ) (তাঁর ছাত্রকে) বলেন, তোমাকে কোন কিছুর বিনিময় ছাড়াই হাদীসটি শিক্ষা দিলাম, অথচ এর চাইতে ছোট হাদীসের জন্যও লোক (দূর-দূরান্ত থেকে) সওয়ার হয়ে মদিনায় আসত।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৭৪।',
        name: '  আলিম কর্তৃক মহিলাদের নসীহত করা ও দীনী ইলম শিক্ষা দেওয়া',
        hadisNumberList: [
          HadisNumberModel(
            id: '৯৮।  ',
            name:
                'সুলায়মান ইবনু হারব (রহঃ) ... ইবনু আব্বাস (রাঃ) থেকে বর্ণিত, তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে সাক্ষ্য রেখে বলছি যে, অথবা পরবর্তী বর্ণনাকারী আতা (রহঃ) বলেন, আমি ইবনু আব্বাসকে সাক্ষী রেখে বলছি যে, নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (ঈদের দিন পুরুষের কাতার থেকে) বের হলেন আর তাঁর সঙ্গে ছিলেন বিলাল (রাঃ)। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মনে করলেন যে, দূরে থাকার কারনে তাঁর ওয়ায মহিলাদের কাছে পৌঁছে নি। তাই তিনি (পুনরায়) তাঁদের নসীহত করলেন এবং দান-খয়রাত করার উপদেশ দিলেন। তখন মহিলারা কানের দুল ও হাতের আংটি দিয়ে দিতে লাগলেন। আর বিলাল (রাঃ) সেগুলি তাঁর কাপড়ের আচঁলে নিতে লাগলেন। ইসমাঈল (রহঃ) ... আতা (রহঃ) সূত্রে বলেন যে, ইবনু আব্বাস (রাঃ) বলেনঃ আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে সাক্ষী রেখে বলছি। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৭৫। ',
        name: ' হাদিসের প্রতি আগ্রহ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৯৯।  ',
            name:
                'আবদুল আযীয ইবনু আবদুল্লাহ (রহঃ) ... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ একবার রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে জিজ্ঞাসা করা হলঃ ইয়া রাসুলাল্লাহ! কিয়ামতের দিন আপনার শাফা\'আত লাভে কে সবচাইতে বেশি ভাগ্যবান হবে? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, আবূ হুরায়রা! আমি ধারণা করেছিলাম, এ বিষয়ে তোমার আগে আমাকে আর কেউ প্রশ্ন করবে না। কারন আমি দেখেছি হাদীসের প্রতি তোমার বিশেষ আগ্রহ রয়েছে। কিয়ামতের দিন আমার শাফা\'আত লাভে সবচাইতে ভাগ্যবান হবে সেই ব্যাক্তি যে খালিস দিলে লা ইলাহা ইল্লাল্লাহ্ (পূর্ণ কালেমা তাইয়্যেবা) বলে। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৭৬। ',
        name: ' কিভাবে ইলম তুলে নেয়া হবে ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                '‘উমর ইবন আবদুল ‘আযীয (রহঃ) মদীনায় আবূ বকর ইবন হাযম (রহঃ)-এর কাছে এক পত্রে লিখেনঃ খোঁজ কর, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের যে হাদীস পাও তা লিখে নাও। আমি ইলম লোপ পাওয়ার এবং আলিমদের বিদায় নেওয়ার আশংকা করছি এবং জেনে রাখ, নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের হাদীস ছাড়া আর কিছুই গ্রহণ করা হবে না এবং প্রত্যেকের উচিৎ ইলমের প্রচার-প্রসার করা, আর তারা যেন একত্রে বসে (ইলমের চর্চা করে,) যাতে যে জানে না সে শিক্ষা লাভ করতে পারে। কারন ইলম গোপনীয় বিষয় না হওয়া পর্যন্ত বিলুপ্ত হবে না। ১০০। আলা ইবনু আবদুল জব্বার (রহঃ) ... আবদুল্লাহ ইবনু দ্বীনার (রহঃ)-এর সূত্রে বির্ণিত রিওয়ায়াতে উমর ইবনু আবদুল- আযীয (রহঃ)- এর উপরোক্ত হাদীসে আলিমগণের বিদায় নেওয়া’ পর্যন্ত বর্ণিত আছে। ',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ',
            name:
                ' ইসমা‘ঈল ইবনু আবূ উওয়ায়স (রহঃ) ... আবদুল্লাহ ইবনু ‘আমর ইবনুল ‘আস (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি যে, আল্লাহ্ তা‘আলা বান্দার অন্তর থেকে ইল্‌ম বের করে উঠিয়ে নেবেন না; বরং আলিমদের উঠিয়ে নেওয়ার মাধ্যমেই ইল্‌ম উঠিয়ে নেবেন। যখন কোন আলিম বাকী থাকবে না তখন লোকেরা জাহিলদেরই নেতা হিসেবে গ্রহণ করবে। তাদের জিজ্ঞাসা করা হবে, তারা না জেনেই ফতোয়া দিবে। ফলে তারা নিজেরাও গোমরাহ হবে, আর অপরকেও গোমরাহ করবে। ফিরাবরী (রহঃ) বলেন, আব্বাস (রহঃ) ... হিশাম সূত্রেও অনুরূপ বর্ণিত আছে।',
            ref: ' ১০১।',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৭৭।',
        name:
            '  ইলম শিক্ষার জন্য মহিলাদের ব্যাপারে কি আলাদা দিন নির্ধারণ করা যায়?',
        hadisNumberList: [
          HadisNumberModel(
            id: '১০২। ',
            name:
                ' আদম (রহঃ) ... আবূ সা‘ঈদ খুদরী (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ মহিলারা একবার নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলল, পুরুষেরা আপনার কাছে আমাদের চাইতে প্রাধান্য বিস্তার করে আছে। তাই আপনি নিজে আমাদের জন্য একটি দিন ধার্য করে দিন। তিনি তাদের বিশেষ একটি দিনের ওয়াদা করলেন; সে দিন তিনি তাদের সঙ্গে সাক্ষাৎ করলেন এবং তাদের ওয়ায-নসীহত করলেন ও নির্দেশ দিলেন। তিনি তাদের যা যা বলেছিলেন, তার মধ্যে একথাও ছিল যে, তোমাদের মধ্যে যে স্ত্রীলোক তিনটি সন্তান আগেই পাঠাবে,* তারা তার জন্য জাহান্নামের পর্দাস্বরূপ হয়ে থাকবে। তখন এক স্ত্রীলোক বলল, আর দু’টি পাঠালে? তিনি বললেনঃ দু’টি পাঠালেও। * তার জীবিতাবস্থায় তিনটি সন্তান মারা গেল। ',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ১০৩।',
            name:
                ' মুহাম্মদ ইবনু বাশশার (রহঃ) .... আবূ সা‘ঈদ (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে অনুরুপ বর্ণনা করেছেন।আবদুর রহমান আল-আসবাহানী (রহঃ) ... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ এমন তিন সন্তান, যারা সাবালক হয়নি। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৭৮।',
        name: ' কোন কথা শুনে না বুঝলে জানার জন্য পুনরায় জিজ্ঞেস করা ',
        hadisNumberList: [
          HadisNumberModel(
            id: '১০৪। ',
            name:
                '  সা‘ঈদ ইবনু আবূ মারয়াম (রহঃ) .... ইবনু আবূ মুলায়কা (রহঃ) বলেন, নবী করিম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহধর্মিণী ‘আয়িশা (রাঃ) কোন কথা শুনে বুঝতে না পারলে বার বার জিজ্ঞাসা করতেন। একবার নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, “(কিয়ামতের দিন) যার হিসাব নেওয়া হবে তাকে আযাব দেওয়া হবে।” ‘আয়িশা (রাঃ) বলেনঃ আমি জিজ্ঞাসা করলাম, আল্লাহ্ তা‘আলা কি ইরশাদ করেননি, (فَسَوْفَ يُحَاسَبُ حِسَابًا يَسِيرًا‏) (তার হিসার-নিকাশ সহজেই নেওয়া হবে) (৮৪ : ৮)। তখন তিনি বললেনঃ তা কেবল হিসাব পেশ করা। কিন্তু যার হিসাব পুঙ্খানুপুঙ্খরুপে নেওয়া হবে সে ধবংস হবে।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৭৯।',
        name: ' উপস্থিত ব্যাক্তি অনুপস্থিত ব্যাক্তির কাছে ইলম পৌঁছে দেবে ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'قَالَهُ ابْنُ عَبَّاسٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ইবনু আব্বাস (রাঃ) নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে তা বর্ণনা করেন। ১০৫। আবদুল্লাহ ইবনু ইউসুফ (রহঃ) ... আবূ শুরায়হ (রাঃ) থেকে বর্ণিত যে, তিনি ‘আমর ইবনু সা‘ঈদ (মদিনার গভর্নর)-কে বললেন, যখন তিনি মক্কায় সেনাবাহিনী প্রেরণ করছিলেন— ‘হে আমীর! আমাকে অনুমতি দিন, আমি আপনাকে এমন একটি হাদীস শোনাব, যা মক্কা বিজয়ের পরের দিন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছিলেন। আমার দু’ কান তা শুনেছে, আমার অন্তর তা স্মরণ রেখেছে, আর আমার দু’ চোখ তা দেখেছে। তিনি আল্লাহর প্রশংসা ও মহিমা বর্ণনা করে বললেনঃ মক্কাকে আল্লাহ্ তা‘আলা হারাম করেছেন, কোন মানুষ তাকে হারাম করেনি। তাই যে লোক আল্লাহর উপর এবং আখিরাতের উপর ঈমান রাখে তার জন্য সেখানে রক্তপাত করা এবং সেখানকার কোন গাছপালা কাটা হালাল নয়। কেউ যদি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর (সেখানকার) লড়াইকে দলীল হিসেবে পেশ করে তবে তোমরা বলে দিও যে, আল্লাহ্ তা‘আলা তাঁর রাসূলকে এর অনুমতি দিয়েছিলেন; কিন্তু তোমাদের অনুমতি দেননি। আমাকেও সে দিনের কিছু সময়ের জন্য অনুমতি দিয়েছিলেন। তারপর আগের মতো আজ আবার এর নিষেধাজ্ঞা ফিরে এসেছে। উপস্থিত ব্যাক্তিরা যেন অনুপস্থিত ব্যাক্তিদের কাছে (এ বাণী) পৌঁছে দেয়। তারপর আবূ শুরাইয়া (রাঃ)-কে জিজ্ঞাসা করা হল, ‘আপনার এ হাদীস শুনে ‘আমর কি বলল?’ (আবূ শুরাইয়া (রাঃ) উত্তর দিলেন) সে বললঃ ‘হে আবূ শুরাইয়া! (এ বিষয়ে) আমি তোমার চাইতে ভাল জানি। মক্কা কোন বিদ্রোহীকে, কোন খুনের পলাতক আসামীকে এবং কোন সন্ত্রাসীকে আশ্রয় দেয় না। ',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ১০৬।',
            name:
                ' আবদুল্লাহ ইবনু আবদুল ওয়াহহাব (রহঃ) .... আবূ বাকরা (রাঃ) রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কথা উল্লেখ করে বলেন যে, তিনি বলেছেনঃ তোমাদের জান, তোমাদের মাল – বর্ণনাকারী মুহাম্মদ (রহঃ) বলেন, ‘আমার মনে হয়, তিনি বলেছিলেনঃ এবং তোমাদের মানসম্মান (অন্য মুসলিমের জন্য) এ শহরে এ দিনের মতই মর্যাদা সম্পন্ন। শোন, (আমার এ বাণী যেন) তোমাদের মধ্যে উপস্থিত ব্যাক্তি অনুপস্থিত ব্যাক্তির কাছে পৌঁছে দেয়। বর্ণনাকারী মুহাম্মদ (রহঃ) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সত্য বলেছেন, তা-ই হয়েছে। তারপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দু’বার করে বলেন, হে লোক সকল! ‘আমি কি পৌঁছে দিয়েছি?’ ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৮০। ',
        name: 'নবী করীম (ﷺ) এর উপর মিথ্যারোপ করার গুনাহ ',
        hadisNumberList: [
          HadisNumberModel(
            id: '১০৭। ',
            name:
                ' আলী ইবনুল জা‘দ (রহঃ) .... ‘আলী (রাঃ) থেকে বর্ণিত, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা আমার উপর মিথ্যা আরোপ করো না। কারণ আমার ',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ১০৮।  ',
            name:
                'আবুল ওয়ালিদ (রহঃ) ... আবদুল্লাহ ইবনুয যুবাইর (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি আমার পিতা যুবাইরকে বললামঃ আমি তো আপনাকে অমুক অমুকের ন্যায় রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর হাদিস বর্ণনা করতে শুনি না। তিনি বললেনঃ জেনে রাখ, আমি তাঁর থেকে দূরে থাকিনি, কিন্তু (হাদিস বর্ণনা করি না এজন্য যে) আমি তাঁকে বলতে শুনেছি, যে আমার উপর মিথ্যারোপ করবে সে যেন জাহান্নামে তার ঠিকানা বানিয়ে নেয়।',
            ref: '',
          ),
          HadisNumberModel(
            id: '১০৯।  ',
            name:
                ' আবূ মা‘মার (রহঃ) ..... আনাস (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ এ কথাটি তোমাদেরকে বহু হাদীস বর্ণনা করতে আমাকে বাধা দেয় যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ইচ্ছাকৃতভাবে আমার উপর মিথ্যা আরোপ করে সে যেন জাহান্নামে তার ঠিকানা বানিয়ে নেয়।',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ১১০। ',
            name:
                ' মাক্কী ইবনু ইবরাহীম (রহঃ) ... সালমা ইবনু আকওয়া (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম–কে বলতে শুনেছি, যে ব্যাক্তি আমার উপর এমন কথা আরোপ করে যা আমি বলিনি, সে যেন জাহান্নামে তার ঠিকানা বানিয়ে নেয়।',
            ref: '',
          ),
          HadisNumberModel(
            id: '  ১১১।',
            name:
                ' মূসা (রহঃ) .... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমার নামে তোমরা নাম রেখ; কিন্তু আমার উপনামে (কুনিয়াতে) তোমরা উপনামে রেখ না। আর যে আমাকে স্বপ্নে দেখে সে ঠিক আমাকেই দেখে। কারণ শয়তান আমার আকৃতির ন্যায় রুপ ধারণ করতে পারে না। যে ইচ্ছাকৃতভাবে আমার উপর মিথ্যা আরোপ করে সে যেন জাহান্নামে তার ঠিকানা বানিয়ে নেয়।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৮১।  ',
        name: ' ইলম লিপিবদ্ধ করা',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ১১২। ',
            name:
                'মুহাম্মদ ইবনু সালাম (রহঃ) .... আবূ জুহায়ফা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি ‘আলী (রাঃ)-কে জিজ্ঞাসা করলাম, আপনাদের কাছে কি লিখিত কিছু আছে? তিনি বললেনঃ ‘না, কেবলমাত্র আল্লাহর কিতাব রয়েছে, আর সেই বুদ্ধি ও বিবেক, যা একজন মুসলিমকে দান করা হয়। এ ছাড়া যা কিছু এ পত্রটিতে লেখা আছে। আবূ জুহায়ফা (রাঃ) বলেন, আমি বললাম, এ পত্রটিতে কি আছে? তিনি বললেন, ‘দিয়াতের (আর্থির ক্ষতিপূরণ) ও বন্দী মুক্তির বিধান, আর এ বিধানটিও যে, মুসলিমকে কাফিরের বিনিময়ে হত্যা করা যাবে না। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '১১৩। ',
            name:
                '  আবূ নু‘আয়ম ফাযল ইবনু দুকায়ন (রহঃ) .... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত যে, মক্কা বিজয়ের কালে খুযা‘আ গোত্র লায়স গোত্রের এক ব্যাক্তিকে হত্যা করল। এ হত্যা ছিল তাদের এক নিহত ব্যাক্তির প্রতিশোধ স্বরূপ, যাকে ইতিপূর্বে লায়স গোত্রের লোক হত্যা করেছিল। তারপর এ খবর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে পোঁছল। তিনি তাঁর উটের উপর আরোহণ করে খুতবা দিলেন, তিনি বললেনঃ আল্লাহ তা‘আলা মক্কা থেকে ‘হত্যা’- কে (অথবা বর্ণনাকারী বললেন) ‘হাতী’-কে রোধ করেছেন। ইমাম বুখারী (রহঃ) বলেন, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ‘হত্যা’ বলেছেন না ‘হাতী’ বলেছেন এ ব্যাপারে বর্ণনাকারী আবূ নু‘আয়ম সন্দেহ পোষণ করেন। অন্যেরা শুধু ‘হাতী’ শব্দ উল্লেখ করেছেন। অবশ্য মক্কাবাসীদের উপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এবং মু’মিনগনকে (যুদ্ধের মাধ্যমে) বিজয়ী করা হয়েছে। জেনে রাখ, আমার পূর্বে কারো জন্য মক্কা (নগরীতে লড়াই করা) হালাল করা হয়নি এবং আমার পরও কারো জন্য হালাল হবে না। জেনে রাখ, তাও আমার জন্য দিনের কিছু সময় মাত্র হালাল করা হয়েছিল। আরো জেনে রাখ, আমার এই কথা বলার মুহূর্তে আবার তা হারাম হয়ে গেছে। সেখানকার কোন কাঁটা ও কোন গাছপালা কাটা যাবে না এবং সেখানে পড়ে থাকে কোন বস্তু কুড়িয়ে নেওয়া যাবেনা। তবে ঘোষণা করার জন্য নিতে পারবে। আর যদি কেউ নিহত হয়, তবে তার আপনজনের জন্য দুটি ব্যবস্থার যে কোন একটির অধিকার রয়েছে। হয় তার ‘দিয়াত নিবে নয় ‘কিসাস’ গ্রহণ করবে। এরপর ইয়ামানবাসী এক ব্যাক্তি এসে বলল, ইয়া রাসূলাল্লাহ! (এ কথাগুলো) আমাকে লিখে দিন। তিনি (সাহাবীদের) বললেনঃ তোমরা তাকে (আবূ শাহকে) লিখে দাও। তারপর একজন কুরায়শী [আব্বাস (রাঃ)] বললেন, ‘ইয়া রাসূলাল্লাহ! গাছপালা কাটার নিষেধাজ্ঞা হতে ইযখির বাদ রাখুন। কারণ তা আমরা আমাদের ঘরে ও কবরে ব্যবহার করি। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, ‘ইযখির ছাড়া, ইযখির ছাড়া।* * ইযখির শন জাতীয় এক প্রকার ঘাস।',
            ref: '',
          ),
          HadisNumberModel(
            id: '১১৪।  ',
            name:
                ' আলী ইবনু আবদুল্লাহ (রহঃ) .... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাহাবীগণের মধ্য আবদুল্লাহ ইবনু আমর (রাঃ) ব্যতীত আর কারো কাছে আমার চাইতে বেশী হাদীস নেই। কারণ তিনি লিখে রাখতেন, আর আমি লিখতাম না। মা\'মার (রহঃ) হাম্মাম (রহঃ) সূত্রে আবূ হুরায়রা (রাঃ) থেকে অনুরূপ বর্ণনা করেছেন।',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ১১৫। ',
            name:
                'ইয়াহইয়া ইবনু সুলায়মান (রহঃ) ... ইবনু আব্বাস (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর রোগ যখন বেড়ে গেল তখন তিনি বললেনঃ আমার কাছে কাগজ কলম নিয়ে এস, আমি তোমাদের এমন কিছু লিখে দিব যাতে পরবর্তীতে তোমরা ভ্রান্ত না হও। ‘উমর (রাঃ) বললেন, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর রোগ যন্ত্রণা প্রবল হয়ে গেছে (এমতাবস্থায় কিছু বলতে বা লিখতে তাঁর কষ্ট হবে)। আর আমাদের কাছে তো আল্লাহর কিতাব রয়েছে, যা আমাদের জন্য যথেষ্ট। এতে সাহাবীগণের মধ্য মতবিরোধ দেখা দিল এবং শোরগোল বেড়ে গেল। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তোমরা আমার কাছ থেকে উঠে যাও। আমার কাছে ঝগড়া-বিবাদ করা উচিত নয়। এ পর্যন্ত বর্ণনা করে ইবনু আব্বাস (রাঃ) (যেখানে বসে হাদীস বর্ণনা করছিলেন সেখান থেকে) এ কথা বলতে বলতে বেরিয়ে গেলেন যে, ‘হায় বিপদ, সাংঘাতিক বিপদ! রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এবং তাঁর লেখনীর মধ্যে যা বাধ সেধেছে। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৮২। ',
        name: ' রাতে ইলম শিক্ষাদান এবং ওয়ায-নসিহত করা ',
        hadisNumberList: [
          HadisNumberModel(
            id: '১১৬। ',
            name:
                '  সাদাকা, ‘আমর ও ইয়াহিয়া ইবনু সা‘ঈদ (রহঃ) .... উম্মে সালামা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ এক রাতে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঘুম থেকে জেগে বলেনঃ সুবহানআল্লাহ! এ রাতে কতই না বিপদাপদ নেমে আসছে এবং কতই না ভান্ডার খুলে দেওয়া হচ্ছে! অন্য সব ঘরের মহিলাগণকেও জানিয়ে দাও, বহু মহিলা যারা দুনিয়ায় বস্ত্র পরিহিতা, তারা আখিরাতে হবে বস্ত্রহীনা।',
            ref: '',
          ),
          HadisNumberModel(
            id: '১১৭।  ',
            name:
                'সা‘ঈদ ইবনু ‘উফায়র (রহঃ) ... ‘আবদুল্লাহ ইবনু উমর (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর জীবনের শেষের দিকে আমাদের নিয়ে ‘ইশার সালাত (নামায/নামাজ) আদায় করলেন। সালাম ফিরাবার পর তিনি দাঁড়িয়ে বললেন, তোমরা কি এ রাতের সম্পর্কে জানো? বর্তমানে যারা পৃথিবীতে রয়েছে, একশ বছরের মাথায় তাদের কেউ আর বাকী থাকবে না।',
            ref: '',
          ),
          HadisNumberModel(
            id: '১১৮। ',
            name:
                ' আদম (রহঃ) ..... ইবনু আব্বাস (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি আমার খালা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহধর্মিণী মায়মূনা বিন্‌ত হারিস (রাঃ)-এর ঘরে এক রাত্রি যাপন করছিলাম। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর পালার রাতে সেখানে ছিলেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ‘ইশার সালাত (নামায/নামাজ) আদায় করে তাঁর ঘরে চলে আসলেন এবং চার রাক‘আত সালাত আদায় করে শুয়ে পড়লেন। কিছুক্ষণ পর উঠে বললেনঃ বালকটি কি ঘুমিয়ে গেছে? বা এ ধরনের কোন কথা বললেন। তারপর (সালাতে) দাঁড়িয়ে গেলেন, আমিও তাঁর বাঁ দিকে গিয়ে দাঁড়ালাম। তিনি আমাকে তাঁর ডান দিকে এনে দাঁড় করালেন। তারপর তিনি পাঁচ রাক‘আত সালাত আদায় করলেন। পরে আরো দু’ রাক‘আত আদায় করলেন। এরপর শুয়ে পড়লেন। এমনকি আমি তাঁর নাক ডাকার শব্দ শুনতে পেলাম। এরপর উঠে তিনি (ফজরের) সালাতের জন্য বের হলেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৮৪। ',
        name: ' ইলম মুখস্ত করা ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ১১৯। ',
            name:
                '‘আবদুল ‘আযীয ইবনু ‘আবদুল্লাহ (রহঃ) ... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ লোকে বলে, আবূ হুরায়রা (রাঃ) বড় বেশী হাদীস বর্ণনা করে। (জেনে রাখ,) কিতাবে দুটি আয়াত যদি না থাকত, তবে আমি একটি হাদিসও বর্ণনা করতাম না। এরপর তিনি তিলাওয়াত করলেনঃ إِنَّ الَّذِينَ يَكْتُمُونَ مَا أَنزَلْنَا مِنَ الْبَيِّنَاتِ وَالْهُدَىٰ مِن بَعْدِ مَا بَيَّنَّاهُ لِلنَّاسِ فِي الْكِتَابِ أُولَٰئِكَ يَلْعَنُهُمُ اللَّهُ وَيَلْعَنُهُمُ اللَّاعِنُونَ إِلَّا الَّذِينَ تَابُوا وَأَصْلَحُوا وَبَيَّنُوا فَأُولَٰئِكَ أَتُوبُ عَلَيْهِمْ وَأَنَا التَّوَّابُ الرَّحِيمُ “আমি সেসব স্পষ্ট নিদর্শন ও পথ-নির্দেশ অবতীর্ণ করেছি মানুষের জন্য কিতাবে তা স্পষ্টভাবে ব্যক্ত করার পরও যারা তা গোপন রাখে আল্লাহ তাদেরকে লা‘নত দেন এবং অভিশাপকারিগণও তাদেরকে অভিশাপ দেয় কিন্তু যারা তওবা করে এবং নিজদিগকে সংশোধন আর সত্যকে সুস্পষ্টভাবে ব্যক্ত করে, ওরাই তারা, যাদের প্রতি আমি ক্ষমাশীল, পরম দয়ালু।” (সূরা বাকারাঃ ১৫৯-১৬০) (প্রকৃত ঘটনা এই যে,) আমার মুহাজির ভাইয়েরা বাজারে কেনাবেচায় এবং আমার আনসার ভাইয়েরা জমা-জমির কাজে মশগুল থাকত। আর আবূ হুরায়রা (রাঃ) (খেয়ে না খেয়ে) তুষ্ট থেকে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে লেগে থাকত। তাই তারা যখন উপস্থিত থাকত না, তখন সে উপস্থিত থাকত এবং তারা যা মুখস্থ করত না সে তা মুখস্থ রাখত। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '১২০। ',
            name:
                '  আবূ মুস‘আব আহমদ ইবনু আবূ বাকর (রহঃ) ... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি বললাম, ইয়া রাসূলাল্লাহ! আমি আমি আপনার কাছ থেকে বহু হাদীস শুনি কিন্তু ভুলে যাই। তিনি বলবেন তোমার চাঁদর খুলে ধর। আমি খুলে ধরলাম। তিনি দু’হাত অঞ্জলী করে তাতে কিছু ঢেলে দেওয়ার মত করে বললেনঃ এটা তোমার বুকের সাথে লাগিয়ে ধর। আমি তা বুকের সাথে লাগালাম। এরপর আমি আর কিছুই ভুলিনি।',
            ref: '',
          ),
          HadisNumberModel(
            id: '১২১। ',
            name:
                ' ইবরাহীম ইবনুল মুনযির (রহঃ) ..... ইবনু আবূ ফুদায়ক (রহঃ) সূত্রে অনুরূপ হাদীস বর্ণনা করেন এবং তাতে বলেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর হাত দিয়ে সে চাঁদরের মধ্য (কিছু) দিলেন। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '১২২।  ',
            name:
                'ইসমা‘ঈল (রহঃ) .... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে ইল্‌মের দুটি পাত্র মুখস্থ করে রেখেছিলাম। তার একটি পাত্র বিতরণ করে দিয়েছি। আর অপরটি প্রকাশ করলে আমার কন্ঠনালী কেটে দেওয়া হবে। আবূ আবদুল্লাহ (রহঃ) বলেন, হাদীসে উল্লিখিতبلعوم শব্দের অর্থ খাদ্যনালী। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৮৫।  ',
        name: ' আলিমদের কথা শোনার জন্য লোকদের চুপ করানো',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ১২৩।',
            name:
                ' হাজ্জাজ (রহঃ) .... জারীর (রাঃ) থেকে বর্ণিত যে, বিদায় হাজ্জের সময় নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে বললেনঃ তুমি লোকদেরকে চুপ করিয়ে দাও, তারপর তিনি বললেনঃ আমার পরে তোমরা কাফির (এর মত) হয়ে যেও না যে, একে অপরের গর্দান কাটবে। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৮৬।',
        name:
            '  আলিমদের জন্য মুস্তাহাব এই যে, তাঁকে যখন প্রশ্ন করা হয়ঃ সবচাইতে জ্ঞানী কে? তখন তিনি ইহা আল্লাহর উপর ন্যাস্ত করবেন।',
        hadisNumberList: [
          HadisNumberModel(
            id: '১২৪। ',
            name:
                '  আবদুল্লাহ ইবনু মুহাম্মদ আল-মুসনাদী (রহঃ) ... সা‘ঈদ ইবনু জুবায়র (রহঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি ইবনু ‘আব্বাস (রাঃ)-কে বললাম, নাওফ আল-বাকালী দাবী করে যে, মূসা (আঃ) [যিনি খাযির (আঃ) এর সাক্ষাৎ লাভ করেছিলেন] বনী ইসরাঈলের মূসা নন বরং তিনি অন্য এক মূসা। (একথা শুনে তিনি) তিনি বললেনঃ আল্লাহর দুশমন মিথ্যা বলেছে। উবাঈ ইবনু কা‘ব (রাঃ) রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে আমাদের কাছে বর্ণনা করেছেন যে, তিনি ইরশাদ করেনঃ মূসা (আঃ) একবার বনী ইসরাঈলদের মধ্য বক্তৃতা দিতে দাঁড়ালেন। তখন তাঁকে প্রশ্ন করা হয়, সবচাইতে জ্ঞানী কে? তিনি বললেন, আমি সবচাইতে জ্ঞানী। মহান আল্লাহ তাঁকে সতর্ক করে দিলেন। কেননা তিনি ইল্‌মকে আল্লাহর উপর ন্যাস্ত করেন নি। তারপর আল্লাহ তাঁর নিকট এ ওহী পাঠালেনঃ দুই সমুদ্রের সংগমস্থলে আমার বান্দাদের মধ্য এক বান্দা রয়েছে, যে তোমার চাইতে বেশী জ্ঞানী।তিনি বলেন, ইয়া রব! কিভাবে তাঁর সাক্ষাৎ পাওয়া যাবে? তখন তাঁকে বলা হল, থলের মধ্য একটি মাছ নিয়ে নাও। এরপর যেখানে সেটি হারিয়ে ফেলবে সেখানেই তাঁকে পাবে। তারপর তিনি রওয়ানা হলেন এবং ইউশা ইবনু নূন নামক তাঁর একজন খাদিমও তাঁর সাথে চলল। তাঁরা থলের মধ্য একটি মাছ নিলেন। চলার পথে তাঁরা একটি বড় পাথরের কাছে এসে, সেখানে মাথা রেখে শুয়ে পড়লেন। তারপর মাছটি (জীবিত হয়ে) থলে থেকে বেরিয়ে গেল এবং সুড়ঙ্গের মত পথ করে সমুদ্রে চলে গেল। এ ব্যাপারটি মূসা (আঃ) ও তাঁর খাদিম-এর জন্য ছিল আশ্চর্যের বিষয়। এরপর তাঁরা তাঁদের বাকী রাতটুকু এবং পরের দিনভর চলতে থাকলেন। পরে ভোরবেলা মূসা (আঃ) তাঁর খাদিমকে বললেন, ‘আমাদের নাশতা নিয়ে এস, আমরা আমাদের এ সফরে ক্লান্ত হয়ে পড়েছি, আর মূসা (আঃ)-কে যে স্থানের নির্দেশ দেওয়া হয়েছিল, সে স্থান অতিক্রম করার পূর্বে তিনি ক্লান্ত অনুভব করেন নি। তারপর তাঁর খাদিম তাঁকে বলল, ‘আপনি কি লক্ষ্য করেছন, আমরা যখন পাথরের পাশে বিশ্রাম করছিলাম, তখন আমি মাছের কথা ভুলে গিয়েছি? মূসা (আঃ) বললেন, ‘আমরা তো সেই স্থানটই খুঁজছিলাম। তারপর তাঁরা তাঁদের পদচিহ্ন ধরে ফিরে চলল। তাঁরা সেই পাথরের কাছে পোঁছে, কাপড়ে আবৃত (বর্ণনাকারী বলেন) কাপড় মুড়ি দেওয়া এক ব্যাক্তিকে দেখতে পেলেন। মূসা (আঃ) তাঁকে সালাম দিলেন। তখন খাযির বললেন, এ দেশে সালাম কোথা থেকে এল! তিনি বললেন, আমি মূসা। খাযির জিজ্ঞাসা করলেন, ‘বনী ইসরাইলের মূসা? তিনি বললেন, হ্যাঁ। তিনি আরো বললেন, আমি কি আপনাকে অনুসরণ করতে পারি এ শর্তে যে, সত্য পথের যে জ্ঞান আপনাকে দান করা হয়েছে, তা থেকে আমাকে শিক্ষা দিবেন? খাযির বললেন, তুমি কিছুতেই আমার সঙ্গে ধৈর্য ধারণ করতে পারবে না। ‘মূসা (আঃ) বললেন, আল্লাহ চাইলে আপনি আমাকে ধৈর্যশীল পাবেন এবং আমি আপনার আদেশ অমান্য করব না। তারপর তাঁরা দুজন সমুদ্র তীর দিয়ে চলতে লাগলেন, তাঁদের কোন নৌকা ছিল না। ইতিমধ্যে তাঁদের কাছ দিয়ে একটি নৌকা যচ্ছিল। তাঁরা নৌকাওয়ালাদের সঙ্গে তাঁদের আরোহণ করিয়ে নেওয়ার কথা বললেন। তারা খাযিরকে চিনতে পারল এবং ভাড়া ব্যতিরেকে তাঁদের নৌকায় তুলে নিল। তখন একটি চড়ুই পাখি এসে নৌকার এক প্রান্তে বসে দুই-একবার সমুদ্রে তার ঠোঁট মারল। খাযির বললেন, ‘হে মূসা! আমার ইল্‌ম এবং তোমার ইল্‌ম (সব মিলেও) আল্লাহর ইল্‌ম থেকে সমুদ্র থেকে চড়ুই পাখির ঠোঁটে যতটুকু পানি এসেছে ততটুকু পরিমাণও কমাতে পারবে না। এরপর খাযির নৌকার তক্তাগুলির মধ্য থেকে একটি খুলে ফেললেন। মূসা (আঃ) বললেন, এরা আমাদের ভাড়া ছাড়া আরোহণ করিয়েছে, আর আপনি আরোহীদের ডুবিয়ে দেওয়ার জন্য নৌকায় ফাটল সৃষ্টি করলেন? খাযির বললেন, আমি কি বলিনি যে, তুমি কিছুতেই আমার সঙ্গে ধৈর্য ধারণ করতে পারবে না। মূসা (আঃ) বললেন, আমার ভুলের জন্য আমাকে অপরাধী করবেন না এবং আমার ব্যাপারে অধির কঠোরতা অবলম্বন করবেন না। বর্ণনাকারী বলেন, ইহা মূসা (আঃ) এর প্রথম ভুল। তারপর তাঁরা উভয়ে (নৌকা থেকে নেমে) চলতে লাগলেন। (পথে) একটি বালক অন্যান্য বালকের সাথে খেলছিল। খাযির তার মাথার উপর দিক দিয়ে ধরলেন এবং হাত দিয়ে তার মাথা ছিদ্র করে ফেললেন। মূসা (আঃ) বললেন, ‘আপনি কি একটি নিষ্পাপ জীবন নাশ করলেন কোন হত্যার অপরাধ ছাড়াই?’ খাযির বললেন, আমি তোমাকে বলিনি যে, তুমি কিছুতেই আমার সঙ্গে ধৈর্য ধারণ করতে পারবে না? ইবনু ‘উয়ায়না (রহঃ) বলেন, এটা ছিল পূর্বের চেয়ে বেশী জোরালো। তারপর আবারো চলতে লাগলেন; চলতে চলতে তাঁরা এক গ্রামের অধিবাসীদের কাছে পৌঁছে তাদের কাছে খাবার চাইলেন, কিন্তু তারা তাঁদের মেহমানদারী করতে অস্বীকার করল। তারপর সেখানে তাঁরা এক পতনোন্মুখ প্রাচীর দেখতে পেলেন। খাযির তাঁর হাত দিয়ে সেটি খাড়া করে দিলেন। মূসা (আঃ) বললেন, ‘আপনি ইচ্ছে করলে এর জন্য পারিশ্রমিক গ্রহণ করতে পারতেন। তিনি বললেন, এখানেই তোমার আর আমার সম্পর্কের অবসান। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আল্লাহ তা‘আলা মূসার (আঃ) এর ওপর রহম করুন। আমাদের কতই না মনোবাঞ্ছা পূর্ণ হতো যদি তিনি সবর করতেন, তাহলে আমাদের কাছে তাঁদের আরো ঘটনাবলী বর্ণনা করা হতো। মুহাম্মদ ইবনু ইউসুফ আলী ইবনু খাসরাম সুফিয়ান ইবনু উয়ায়না (রহঃ) এ হাদিসটি বিশদভাবে বর্ণনা করেন।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৮৭।',
        name: ' আলিমের বসা থাকা অবস্থায় দাঁড়িয়ে প্রশ্ন করা ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ১২৫।',
            name:
                '  উসমান (রহঃ) ... আবূ মূসা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ এক ব্যাক্তি নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এসে বলল, ‘ইয়া রাসুলাল্লাহ! আল্লাহর রাস্তায় যুদ্ধ কোনটি, কেননা আমাদের কেউ লড়াই করে রাগের বশীভূত হয়ে, আবার কেউ লড়াই করে প্রতিশোধ গ্রহণের জন্য। তিনি তার দিকে মাথা তুলে তাকালেন। বর্ণনাকারী বলেন, তাঁর মাথা তোলার কারণ ছিল যে, সে ছিল দাঁড়ানো। এরপর তিনি বললেনঃ আল্লাহর দ্বীনকে বুলন্দ করার জন্য যে যুদ্ধ করে সেই আল্লাহর রাস্তায়।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৮৮। ',
        name: 'কংকর মারার সময় কোন মাসআলা জিজ্জেস করা ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ১২৬। ',
            name:
                'আবূ নু‘আয়ম (রহঃ) ... ‘আবদুল্লাহ ইবনু আমর (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে দেখলাম, জামরার নিকট তাঁকে মাস‘আলা জিজ্ঞাসা করা হছে। এক ব্যাক্তি জিজ্ঞাসা করলঃ ইয়া রাসুলাল্লাহ! আমি কংকর মারার আগেই কুরবানী করে ফেলেছি। তিনি বললেনঃ কংকর মার, তাতে কোন ক্ষতি নেই। অন্য এক ব্যাক্তি জিজ্ঞাসা করলঃ ইয়া রাসুলাল্লাহ! আমি কুরবানী করার পূর্বেই মাথা মুড়ে ফেলেছি। তিনি বললেনঃ কুরবানী করে নাও, কোন ক্ষতি নেই। বস্তুত আগে পিছু করার যে কোন প্রশ্নই তাঁকে করা হচ্ছিল, তিনি বলছিলেনঃ কর, কোন ক্ষতি নেই। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৮৯।',
        name:
            ' আল্লাহ্‌ তায়ালার বাণীঃ (وَمَا أُوتِيتُمْ مِنْ الْعِلْمِ إِلَّا قَلِيلًا) তোমাদেরকে ইলম দেওয়া হয়েছে অতি অল্পই। ',
        hadisNumberList: [
          HadisNumberModel(
            id: '১২৭।  ',
            name:
                ' কায়স ইবনু হাফস (রহঃ) ... ‘আবদুল্লাহ ইবনু মাস‘ঊদ (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ একবার আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে মদিনার বসতিহীন এলাকা দিয়ে চলছিলাম। তিনি একখানি খেজুরের ডালে ভর দিয়ে একদল ইয়াহুদীর কাছ দিয়ে যাচ্ছিলেন। তখন তারা একজন অন্যজনকে বলতে লাগল, তাঁকে রূহ সম্পর্কে জিজ্ঞাসা কর। আর একজন বলল, তাঁকে কোন প্রশ্ন করো না, হয়ত এমন কোন জওয়াব দিবেন যা তোমার পছন্দ করো না। আবার তাদের কেউ কেউ বলল, তাঁকে আমরা প্রশ্ন করবই। তারপর তাদের মধ্য থেকে এক ব্যাক্তি দাঁড়িয়ে বলল, হে আবূল কাসিম! রূহ কী? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম চুপ করে রইলেন, আমি মনে মনে বললাম, তাঁর প্রতি ওহী নাযিল হচ্ছে। তাই আমি দাঁড়িয়ে রইলাম। তারপর যখন সে অবস্থা কেটে গেল তখন তিনি বললেনঃ وَيَسْأَلُونَكَ عَنْ الرُّوحِ قُلْ الرُّوحُ مِنْ أَمْرِ رَبِّي وَمَا أُوتُوا مِنْ الْعِلْمِ إِلَّا قَلِيلًا তারা তোমাকে রূহ সম্পর্কে প্রশ্ন করে। বল, রূহ আমার প্রতিপালকের আদেশঘটিত। এবং তাদেরকে সামান্যই জ্ঞান দেওয়া হয়েছে। (সূরা ইসরাঃ ৮৫)। আ‘মাশ (রহ.) বলেন, এভাবেই আয়াতটিকে আমাদের কিরাআতে أُوْتِيْتُمْ -এর স্থলে أُوْتُوْ পড়া হয়েছে।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৯০। ',
        name:
            '  কোন কোন মুস্তাহাব কাজ এই আশঙ্কায় ছেড়ে দেওয়া যে,কিছু লোক ভুল বুঝতে পারে এবং তারা এর চাইতে অধিকতর বিভ্রান্তিতে পড়তে পারে',
        hadisNumberList: [
          HadisNumberModel(
            id: '১২৮।  ',
            name:
                ' উবায়দুল্লাহ ইবনু মূসা (রহঃ) .... আসওয়াদ (রহঃ) থেকে বর্ণিত, তিনি বলেনঃ ইবনু যুবায়র (রাঃ) আমাকে বললেন, ‘আয়িশা (রাঃ) তোমাকে অনেক গোপন কথা বলতেন। বল তো কাবা সম্পর্কে তোমাকে কী বলেছেন? আমি বললাম, তিনি আমাকে বলেছেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ‘আয়িশা! তোমাদের কওম যদি (ইসলাম গ্রহণে) নতুন না হত, ইবনু যুবায়র বলেনঃ কুফর থেকে; তবে আমি কাবা ভেঙ্গে ফেলে তার দুটি দরজা বানাতাম। এক দরজা দিয়ে লোক প্রবেশ করত আর এক দরজা দিয়ে বের হত। (পরবর্তীকালে মক্কার আধিপত্য পেলে) তিনি এরূপ করেছিলেন।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৯১।',
        name:
            '  বুঝতে না পারার আশংকায় ইল্‌ম শিক্ষায় কোন এক গোত্র ছেড়ে আর এক গোত্র বেছে নেওয়া।',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                ' وَقَالَ عَلِيٌّ حَدِّثُوا النَّاسَ، بِمَا يَعْرِفُونَ، أَتُحِبُّونَ أَنْ يُكَذَّبَ، اللَّهُ وَرَسُولُهُ আলী (রাঃ) বলেন, ‘মানুষের নিকট সেই ধরনের কথা বল, যা তারা বুঝতে পারে। তোমরা কি পছন্দ কর যে, আল্লাহ্ ও তাঁর রসূলের প্রতি মিথ্যা আরোপ করা হোক? ১২৯। এ হাদীস উবায়দুল্লাহ ইবনু মূসা (রহঃ) .... ‘আলী (রাঃ) থেকে বর্ণনা করেন।',
            ref: '',
          ),
          HadisNumberModel(
            id: '১৩০। ',
            name:
                ' ইসহাক ইবনু ইবরাহীম (রহঃ) ... আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত যে, একবার মু‘আয (রাঃ), নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর পিছনে সাওয়ারীতে উপবিষ্ট ছিলেন, তখন তিনি তাঁকে ডাকলেন, হে মু‘আয ইবনু জাবাল! মু‘আয (রাঃ) উত্তর দিলেন, ‘আমি হাযির ইয়া রাসূলাল্লাহ! এবং (আপনার আদেশ পালনের জন্য) প্রস্তুত। তিনি ডাকলেন, মু‘আয! মু‘আয (রাঃ) উত্তর দিলেন, ‘আমি হাযির ইয়া রাসূলাল্লাহ এবং প্রস্তুত। তিনি আবার ডাকলেন, মু‘আয। তিনি উত্তর দিলেন, ‘আমি হাযির ইয়া রাসূলাল্লাহ এবং প্রস্তুত। এরূপ তিনবার করলেন। এরপর বললেনঃ যে কোন বান্দা আন্তরিকতার সাথে এ সাক্ষ্য দেবে যে, ‘আল্লাহ ছাড়া কোন ইলাহ নেই এবং মুহাম্মদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আল্লাহর রাসূল’ তার জন্য আল্লাহ তা‘আলা জাহান্নাম হারাম করে দেবেন। মু‘আয (রাঃ) বললেন, ইয়া রাসুলাল্লাহ! আমি কি মানুষকে এ খবর দেব না, যাতে তারা সুসংবাদ পেতে পারে?’ তিনি বললেন, ‘তাহলে তারা এর উপর ভরসা করে বসে থাকবে।’ মু‘আয (রাঃ) (জীবনভর এ হাদিসটি বর্ণনা করেন নি) মৃত্যুর সময় এ হাদিসটি বর্ণনা করে গেছেন যাতে (ইল্‌ম গোপন রাখার) গুনাহ না হয়। ',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ১৩১।',
            name:
                ' মূসা’দ্দাদ (রহঃ) ... আনাস (রাঃ) থেকে বর্ণিত, তিনি বলেন, আমার কাছে বর্ণনা করা হয়েছে যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মু‘আয (রাঃ)-কে বলেছেনঃ যে ব্যাক্তি আল্লাহর সঙ্গে কোনরূপ শিরক না করে তাঁর সঙ্গে সাক্ষাত করবে সে জান্নাতে দাখিল হবে। (এ কথা শুনে) মু‘আয (রাঃ) বললেন, ‘আমি কি লোকদের সুসংবাদ দেব না?’ তিনি বললেন, ‘না, আমার আশংকা হচ্ছে যে, তারা এর উপরই ভরসা করে বসে থাকবে।’ ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৯২। ',
        name: ' ‘ইলম শিক্ষা করতে লজ্জাবোধ করা। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                ' وَقَالَ مُجَاهِدٌ لاَ يَتَعَلَّمُ الْعِلْمَ مُسْتَحْيٍ وَلاَ مُسْتَكْبِرٌ. وَقَالَتْ عَائِشَةُ نِعْمَ النِّسَاءُ نِسَاءُ الأَنْصَارِ لَمْ يَمْنَعْهُنَّ الْحَيَاءُ أَنْ يَتَفَقَّهْنَ فِي الدِّينِ মুজাহিদ (রহঃ) বলেন, ‘লাজুক এবং অহঙ্কারী ব্যক্তি জ্ঞান অর্জন করতে পারে না। ‘আয়িশা (রাঃ) বলেন, ‘আনসারী মহিলারাই উত্তম। লজ্জা তাদেরকে ইসলামী জ্ঞান অন্বেষণ থেকে ফিরিয়ে রাখতে পারে নি। ১৩২। মুহাম্মদ ইবনু সালাম (রহঃ) ... উম্মে সালমা (রাঃ) থেকে বর্ণত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর খিদমতে উম্মে সুলায়ম (রাঃ) এসে বললেনঃ ইয়া রাসুল্লাহ! আল্লাহ হক কথা প্রকাশ করতে লজ্জাবোধ করেন না। স্ত্রীলোকের স্বপ্নদোষ হলে কি গোসল করতে হবে? নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ ‘হ্যাঁ, যখন সে বীর্য দেখতে পাবে।’ তখন উম্মে সালমা (লজ্জায়) তাঁর মুখ ঢেকে নিয়ে বললেন, ইয়া রাসূলাল্লাহ! স্ত্রীলোকের স্বপ্নদোষ হয় কি?’ তিনি বললেন, ‘হ্যাঁ, তোমার ডান হাতে মাটি পড়ুক!* (তা না হলে) তাঁর সন্তান তাঁর আকৃতি পায় কিরূপে? * এটি কোন বদ দুয়া বরং বিস্ময় প্রকেশের জন্য আরবীতে ব্যবহৃত হয়।',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ১৩৩।  ',
            name:
                'ইসমা‘ঈল (রহঃ) ... ইবনু উমর (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ গাছের মধ্যে এমন এক গাছ আছে যার পাতা ঝরে পড়ে না এবং তা হল মুসলিমের দৃষ্টান্ত। তোমরা আমাকে বল তো সেটা কোন গাছ? তখন লোকজনের খেয়াল জঙ্গলের গাছপালার প্রতি গেল। আর আমরা মনে হতে লাগল যে, তা হল খেজুর গাছ। আবদুল্লাহ (রাঃ) বলেন, কিন্তু আমি লজ্জাবোধ করলাম। সাহাবায়ে কিরাম (রাঃ) বললেন, ইয়া রাসুল্লাল্লাহ! আপনই আমাদের তা বলে দিন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তা হল খেজুর গাছ। আবদুল্লাহ (রাঃ) বলেন, তারপর আমি আমার পিতাকে আমার মনে যা এসেছিল তা বললাম। তিনি বললেন তুমি তখন তা বলে দিলে অমুক অমুক জিনিস লাভ করার চাইতে আমি বেশী খুশী হতাম।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৯৩। ',
        name: ' নিজে লজ্জাবোধ করলে অন্যকে প্রশ্ন করতে বলা',
        hadisNumberList: [
          HadisNumberModel(
            id: '১৩৪।  ',
            name:
                'মূসা’দ্দাদ (রহঃ) ..... আলী ইবনু আবী তালিব (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমার অধিক পরিমাণে ‘মযী’ বের হত। তাই এ ব্যাপারে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম–কে জিজ্ঞাসা করার জন্য মিকদাদকে বললাম। তিনি তাঁকে জিজ্ঞাসা করলেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ এতে কেবল উযূ (ওজু/অজু/অযু) করতে হয়। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৯৪।',
        name: '  মসজিদে ইলম ও মাসআলা-মাসায়েল আলোচনা করা',
        hadisNumberList: [
          HadisNumberModel(
            id: '১৩৫। ',
            name:
                '  কুতায়বা ইবনু সা‘ঈদ (রহঃ) ... আবদুল্লাহ ইবনু উমর (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ এক ব্যাক্তি মসজিদে দাঁড়িয়ে বলল, ‘ইয়া রাসুলাল্লাহ! আপনি আমাদের কোথা থেকে ইহরাম বাঁধার নির্দেশ দেন?’ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ মদিনাবাসী ইহরাম বাঁধবে ‘যু’ল-হুলায়কা’ থেকে, সিরিয়াবাসী, ইহরাম বাঁধবে ‘জুহফা’ থেকে এবং নাজদবাসী ইহরাম বাঁধবে ‘করন’ থেকে। ইবনু উমর (রাঃ) বলেন, অন্যরা বলেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এও বলেছেনঃ এবং ইয়ামানবাসী ইহরাম বাঁধবে ‘ইয়ালামলাম’ থেকে। ইবনু ‘উমার (রাঃ) বলেছেন, ‘এ কথাটি আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বুঝে নিতে পারিনি।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৯৫। ',
        name: ' প্রশ্নকারীর প্রশ্নের চাইতে বেশী উত্তর দেওয়া ',
        hadisNumberList: [
          HadisNumberModel(
            id: '১৩৬।  ',
            name:
                'আদম (রহঃ) .... ইবনু ‘উমর (রাঃ) থেকে বর্ণনা করেন যে, এক ব্যাক্তি তাঁকে জিজ্ঞাসা করল, ‘মুহরিম কী কাপড় পরবে?’ তিনি বলেনঃ ‘জামা পরবে না, পাগড়ী পরবে না, পাজামা পরবে না, টুপি পরবে না এবং কুসুম বা যা‘ফরান রঙে রঞ্জিত কোন কাপড় পরবে না। জুতা না থাকলে চামড়ার মোজা পরতে পারে, তবে এমনভাবে কেটে ফেলতে হবে যাতে মোজা দু’টি পায়ের গিরার নিচে থাকে। ',
            ref: '',
          ),
        ]),
  ];
  List<PorichedModel> chapterFour = [
    PorichedModel(
      id: ' পরিচ্ছেদঃ ৯৭।',
     name: ' পবিত্রতা ছাড়া সালাত কবুল হয় না ', 
     hadisNumberList: [
      HadisNumberModel(
        id: ' ',
        name: ' উযুর বর্ণনা আল্লাহ তা‘আলার বাণীঃ (হে মুমিনগণ!) তোমরা যখন সালাতের জন্য প্রস্তুত হবে তখন তোমরা তোমাদের মুখমণ্ডল ও হাত কনুই পর্যন্ত ধুবে ও তোমাদের মাথা মাসেহ করবে এবং পা গিরা পর্যন্ত ধুয়ে নিবে। (৫ঃ ৬)। আবূ ‘আবদুল্লাহ্ বুখারী (রহ.) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ উযূর ফরয হ’ল এক-একবার ধোয়া। তিনি দু’-দু’বার করে এবং তিন-তিনবার করেও উযূ করেছেন, কিন্তু তিনবারের অধিক ধৌত করেন নি। পানির অপচয় করা এবং নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর ‘আমলের সীমা অতিক্রম করাকে ‘উলামায়ে কিরাম মাকরূহ বলেছেন। ১৩৭। ইসহাক ইবনু ইবরাহীম আল-হানযালী (রহঃ) ... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যাক্তির হাদস হয় তাঁর সালাত (নামায/নামাজ) কবুল হবে না, যতক্ষন না সে উযূ (ওজু/অজু/অযু) করে। হাযরা-মাওতের এক ব্যাক্তি বলেন, হে আবূ হুরায়রা! হাদস কী? তিনি বলেন, নিঃশব্দে বা সশব্দে বায়ু বের হওয়া। ',
        ref: '',
      ),
    ]),
PorichedModel(
        id: 'পরিচ্ছেদঃ ৯৮। ',
        name: ' উযূর ফযীলত এবং উযূর প্রভাবে যাদের উযুর অঙ্গ–প্রত্যঙ্গ উজ্জ্বল হবে ',
        hadisNumberList: [
          HadisNumberModel(
              id: '১৩৮। ',
              name:
                  '  ইয়াহিয়া ইবনু বুকায়র (রহঃ) .... নু‘আয়ম মুজমির (রহঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি আবূ হুরায়রা (রাঃ) এর সঙ্গে মসজিদের ছাদে উঠলাম। তারপর তিনি উযূ (ওজু/অজু/অযু) করে বললেনঃ ‘আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি, কিয়ামতের দিন আমার উম্মাতকে এমন অবস্থায় ডাকা হবে যে, উযূর প্রভাবে তাদের হাত-পা ও মুখমণ্ডল থাকবে উজ্জ্বল। তাই তোমাদের মধ্যে যে এ উজ্জ্বলতা বাড়িয়ে নিতে পারে, সে যেন তা করে',
              ref:
                  '',),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৯৯।  ',
        name: 'সন্দেহের কারনে উযূ করতে হয় না যতক্ষণ না (উযূ ভঙ্গের) নিশ্চিত বিশ্বাস জন্মে ',
        hadisNumberList: [
          HadisNumberModel(
              id: '১৩৯।  ',
              name:
                  ' ‘আলী (রহঃ) .... ‘আব্বাদ ইবনু তামীম (রহঃ) তাঁর চাচা থেকে বর্ণনা করেন, একবার রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এক ব্যাক্তি সম্পর্কে বলা হল যে, তার মনে হয়েছিল যেন সালাত (নামায/নামাজ)-এর মধ্যে কিছু হয়ে গিয়েছিল। তিনি বললেনঃ সে যেন ফিরে না যায়, যতক্ষণ না শব্দ শোনে বা গন্ধ পায়।',
              ref:
                  '',),
        ]),
PorichedModel(
        id: ' পরিচ্ছেদঃ ১০০।',
        name: '  হালকাভাবে উযূ করা',
        hadisNumberList: [
          HadisNumberModel(
              id: ' ',
              name:
                  '১৪০। আলী ইবনু আবদুল্লাহ (রহঃ) ... ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিত, একবার নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঘুমিয়েছিলেন, এমনকি তাঁর নিঃশ্বাসের শব্দ হতে লাগল। এরপর তিনি সালাত (নামায/নামাজ) আদায় করলেন। সুফিয়ান (রহঃ) আবার কখনো বলেছেন, তিনি শুয়ে পড়লেন, এমনকি তাঁর নিঃশ্বাসের শব্দ হতে লাগল। এরপর তিনি সালাত আদায় করলেন। অন্য সূত্রে সুফিয়ান (রহঃ) ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণনা করেন, তিনি বলেনঃ আমি এক রাতে আমার খালা মায়মূনা (রাঃ) এর কাছে রাত কাটালাম। রাতে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঘুম থেকে উঠলেন এবং রাতের কিছু অংশ চলে যাবার পর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একটি ঝুলন্ত মশক থেকে হাল্কা উযূ (ওজু/অজু/অযু) করলেন। রাবী ‘আমর (রহঃ) বলেন, তখন তিনি যেভাবে উযূ করেছেন আমিও সেভাবে উযূ করলাম এবং এসে তাঁর বাঁয়ে দাঁড়িয়ে গেলাম। সুফিয়ান (রহঃ) কখনোيسار (বাম) শব্দের স্থলে شمال বলতেন। তারপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে ঘুরিয়ে তাঁর ডান দিকে দাঁড় করালেন। এরপর আল্লাহর যতক্ষণ ইচ্ছা ততক্ষণ তিনি সালাত (নামায/নামাজ) আদায় করলেন। এরপর কাত হয়ে ঘুমিয়ে পড়লেন, এমনকি তাঁর নাক ডাকতে থাকল। এরপর মুয়াযযিন এসে তাঁকে সালাতের কথা জানিয়ে দিলেন। তিনি তাঁর সঙ্গে সালাত এর জন্য রওয়ানা হলেন এবং সালাত আদায় করলেন, কিন্তু উযূ করলেন না। আমরা ‘আমর–কে বললামঃ লোকে বলে যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর চোখ ঘুমায় কিন্তু তাঁর অন্তর ঘুমায় না। তখন ‘আমর (রহঃ) বলেন, ‘আমি উবায়দ ইবনু ‘উমায়র (রহঃ)–কে বলতে শুনেছি, নবীগনের স্বপ্ন ওহী। এরপর তিনি তিলাওয়াত করলেনঃ (‏إِنِّي أَرَى فِي الْمَنَامِ أَنِّي أَذْبَحُكَ) ‘ আমি স্বপ্নে দেখেছি যে, তোমাকে যবেহ করছি। (৩৭ : ১০২) ',
              ref:
                  '',),
        ]),
PorichedModel(
        id: 'পরিচ্ছেদঃ ১০১।  ',
        name: 'পূর্ণরূপে উযূ করা। ',
        hadisNumberList: [
          HadisNumberModel(
              id: ' ',
              name:
                  ' وَقَالَ ابْنُ عُمَرَ إِسْبَاغُ الْوُضُوءِ الإِنْقَاءُ ইবনে উমর (রাঃ) বলেন, ভালভাবে পরিস্কার করাই হল পূর্ণরূপে উযূ করা। ১৪১। আবদুল্লাহ ইবনু মাসলামা (রহঃ) .... উসামা ইবনু যায়দ (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ‘আরাফার ময়দান থেকে রওয়ানা হলেন। গিরিপথে গিয়ে তিনি সওয়ারি থেকে নেমে পেশাব করলেন। এরপর উযূ (ওজু/অজু/অযু) করলেন কিন্তু উত্তমরূপে করলেন না। আমি বললাম, ‘ইয়া রাসুল্লাল্লাহ! সালাত (নামায/নামাজ) আদায় করবেন কি?’ তিনি বললেনঃ সালাতের স্থান তোমার সামনে। তারপর তিনি আবার সওয়ার হলেন। এরপর মুযদালিফায় এসে সওয়ারি থেকে নেমে উযূ করলেন। এবার পূর্ণরূপে উযূ করলেন। তখন সালাতের জন্য ইকামাত দেওয়া হল। তিনি মাগরিবের সালাত আদায় করলেন। তারপর সকলে তাঁদের অবতরণ স্থলে নিজ নিজ উট বসিয়ে দিল। পুনরায় ঈশার ইকামাত দেওয়া হল। তিনি ঈশার সালাত আদায় করলেন এবং উভয় সালাতের মধ্য অন্য কোন সালাত আদায় করলেন না।',
              ref:
                  '',),
        ]),
PorichedModel(
        id: 'পরিচ্ছেদঃ ১০২। ',
        name: '  এক আঁজলা পানি দিয়ে দু\'হাতে মুখমণ্ডল ধোয়া',
        hadisNumberList: [
          HadisNumberModel(
              id: ' ',
              name:
                  '১৪২। মুহাম্মদ ইবনু ‘আবদুর রহীম (রহঃ) .... ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিত, তিনি উযূ (ওজু/অজু/অযু) করলেন এবং তাঁর মুখমণ্ডল ধুলেন। এক আঁজলা পানি দিয়ে কুলি করলেন এবং নাকে পানি দিলেন। এরপর আর এক আঁজলা পানি দিয়ে এরূপ করলেন অর্থাৎ আরেক হাতের সাথে মিলিয়ে মুখমণ্ডল ধুলেন। এরপর আর এক আঁজলা পানি দিয়ে ডান হাত ধুলেন। এরপর আর এক আঁজলা পানি দিয়ে বাম হাত ধুলেন। এরপর মাথা মাসেহ করলেন। এরপর আর এক আঁজলা পানি দিয়ে ডান পায়ের উপর ঢেলে দিয়ে তা ধুয়ে ফেললেন। এরপর আর এক আঁজলা পানি দিয়ে বাম পা ধুলেন। তারপর বললেন, ‘আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে এভাবে উযূ করতে দেখেছি’। ',
              ref:
                  '',),
        ]),
PorichedModel(
        id: ' পরিচ্ছেদঃ ১০৩। ',
        name: 'সর্বাবস্থায়, এমনকি সহবাসের সময়েও বিসমিল্লাহ বলা ',
        hadisNumberList: [
          HadisNumberModel(
              id: '১৪৩। ',
              name:
                  '  আলী ইবনু ‘আবদুল্লাহ (রহঃ) ..... ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিত, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তোমাদের কেউ তাঁর স্ত্রীর সাথে মিলনের পূর্বে যদি বলে, بِسْمِ اللَّهِ اللَّهُمَّ جَنِّبْنَا الشَّيْطَانَ وَجَنِّبِ الشَّيْطَانَ مَا رَزَقْتَنَا (আল্লাহর নামে আরম্ভ করছি। আল্লাহ! তুমি আমাদেরকে শয়তান থেকে দূরে রাখ এবং যা আমাদেরকে দান করবে তাকেও শয়তান থেকে দূরে রাখ)- তারপর (এ মিলনের দ্বারা) তাদের কিসমতে কোন সন্তান থাকলে শয়তান তার কোন ক্ষতি করতে পারবে না।',
              ref:
                  '',),
        ]),
PorichedModel(
        id: ' পরিচ্ছেদঃ ১০৪।',
        name: '  শৌচাগারে কি বলতে হয়?',
        hadisNumberList: [
          HadisNumberModel(
              id: '১৪৪। ',
              name:
                  '  আদম (রহঃ) ..... আনাস (রাঃ) থেকে বর্ণিত, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন প্রকৃতির ডাকে শৌচাগারে যেতেন তখন বলতেন, “আল্লাহুম্মা ইন্নী আঊযুবিকা মিনাল খুবুছি ওয়াল খাবায়িছ” (হে আল্লাহ! আমি মন্দ কাজ ও শয়তান থেকে আপনার স্মরণ নিচ্ছি।) ইবনু ‘আর’আরা (রহঃ) শু‘বা (রহঃ) সূত্রেও অনুরূপ বর্ণনা করেন। গুনদার (রহঃ) শু‘বা (রহঃ) থেকে বর্ণনা করেন,إِذَا أَتَى الْخَلاَءَ‏ (যখন শৌচাগারে যেতেন)। মূসা (রহঃ) হাম্মাদ (রহঃ) থেকে বর্ণনা করেন,إِذَا دَخَلَ (যখন প্রবেশ করতেন)। সাঈদ ইবন যায়দ (রহঃ) আবদুল আযীয (রহঃ) থেকে বর্ণনা করেন, যখন প্রবেশ করার ইচ্ছা করতেন। হাদীসের শিক্ষা ১. বাথরুমে পায়খানা ব্যবহার করার জন্য গেলে উপরোক্ত দো\'আ পাঠ করা সুন্নাত। ২. আলেমগণ বলেছেন, এর মাধ্যমে শয়তানের ওয়াসওয়াসা, কুমন্ত্রণা ও বিভিন্ন প্রকার ধোকা থেকে হিফাযত থাকা যায়। শয়তান ওযূতে সমস্যা করে, সালাত বিনষ্ট করতে চেষ্টা চালায় এসব থেকে বাঁচার জন্য এ দোআ করা উচিত। ৩. শয়তানের অন্যতম অস্ত্র হচ্ছে মানুষকে ময়লা, পায়খানা ইত্যাদির মাধ্যমে অশুচি করে ফেলবে। তাই শয়তানদের থেকে আল্লাহর কাছে আশ্রয় চাওয়া জরুরী। ৪. ময়লা ও অপবিত্রতা থেকে বেঁচে থাকা ফরয: অনুরূপভাবে যা মানুষকে এসব থেকে বাঁচাতে পারবে তা অবলম্বন করাও জরুরী; কারণ হাদীসে পেশাব থেকে না বাঁচার কারণে কবরে শাস্তি হওয়ার বিষয়টি সাব্যস্ত হয়েছে। ৫. \'ইস্তেআযাহ\' হচ্ছে অদৃশ্য শত্রুর ক্ষতি থেকে বাঁচার জন্য আশ্রয় চাওয়া। এটি আল্লাহ ব্যতীত অন্য কারো কাছে চাওয়ার অর্থ হচ্ছে শির্ক করা। সুতরাং ইস্তেআযাহ কেবল আল্লাহর কাছেই চাইতে হবে।',
              ref:
                  '',),
        ]),
PorichedModel(
        id: ' পরিচ্ছেদঃ ১০৫।',
        name: '  শৌচাগারের কাছে পানি রাখা',
        hadisNumberList: [
          HadisNumberModel(
              id: '১৪৫। ',
              name:
                  ' আবদুল্লাহ ইবনু মুহাম্মদ (রহঃ) .... ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিত, একবার নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম শৌচাগারে গেলেন, তখন আমি তাঁর জন্য উযূর পানি রাখলাম। তিনি জিজ্ঞাসা করলেনঃ এটা কে রেখেছে? তাঁকে জানানো হলে তিনি বলেন, ইয়া আল্লাহ! আপনি তাকে দ্বীনের জ্ঞান দান করুন। ',
              ref:
                  '',),
        ]),
PorichedModel(
        id: 'পরিচ্ছেদঃ ১০৬। ',
        name: ' মল-মূত্র ত্যাগের সময় কিবলামুখি হবে না, তবে ঘরের মধ্যে দেয়াল অথবা তেমন কোন আড়াল থাকলে ভিন্ন কথা। ',
        hadisNumberList: [
          HadisNumberModel(
              id: '১৪৬। ',
              name:
                  '  আদম (রহঃ) .... আবূ আইয়ূব আনসারী (রাঃ) থেকে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তোমাদের কেউ যখন শৌচাগারে যায়, তখন সে যেন কিবলার দিকে মুখ না করে এবং তার পিঠও না করে, বরং তোমরা পূর্ব দিক এবং পশ্চিম দিকে ফিরে বসবে (এই নির্দেশ মদিনার বাসিন্দাদের জন্য)।',
              ref:
                  '',),
        ]),
PorichedModel(
        id: ' পরিচ্ছেদঃ ১০৭।',
        name: ' দুই ইটের ওপর বসে মলমূত্র ত্যাগ করা ',
        hadisNumberList: [
          HadisNumberModel(
              id: '  ১৪৭।',
              name:
                  ' আবদুল্লাহ ইবনু ইউসুফ (রহঃ) .... ‘আবদুল্লাহ ইবনু ‘উমর (রাঃ) থেকে বর্ণিত, তিনি বলেন, লোকে বলে মল-মূত্র ত্যাগের সময় কিবলার দিকে এবং বায়তুল মুকাদ্দাসের দিকে মুখ করে বসবে না। ‘আবদুল্লাহ ইবনু ‘উমর (রাঃ) বলেন, ‘আমি একদিন আমাদের ঘরের ছাদের উপর উঠলাম। তারপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে দেখলাম বায়তুল মুকাদ্দাসের দিকে মুখ করে দুটি ইটের উপর তাঁর প্রয়োজনে বসেছেন। তিনি [ওয়াসি (রহঃ)-কে] বললেন, তুমি বোধ হয় তাদের মধ্যে শামিল, যারা নিতম্বের ওপর ভর করে সালাত (নামায/নামাজ) আদায় করে। আমি বললাম, আল্লাহর কসম! আমি জানিনা। মালিক (রহঃ) বলেন, (নিতম্বের উপর ভর করার অর্থ হল) যারা সালাত আদায় করে এবং মাটি থেকে নিতম্ব না তুলে সিজদা করে।',
              ref:
                  '',),
        ]),
PorichedModel(
        id: 'পরিচ্ছেদঃ ১০৮। ',
        name: ' মহিলাদের বাইরে যাওয়া ',
        hadisNumberList: [
          HadisNumberModel(
              id: '১৪৮।  ',
              name:
                  ' ইয়াহইয়া ইবনু বুকায়র (রহঃ) ... ‘আয়িশা (রাঃ) থেকে বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর পত্নীগণ রাতের বেলায় প্রাকৃতিক প্রয়োজনে খোলা ময়দানে যেতেন। আর ‘উমর (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম–কে বলতেন, আপনার সহধর্মিণীগণকে পর্দায় রাখুন। কিন্তু রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তা করেননি। এক রাতে ঈশার সময় নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর পত্নী সাওদা বিনত যাম‘আ (রাঃ) প্রাকৃতিক প্রয়োজনে বের হলেন। তিনি ছিলেন দীর্ঘকায়া। ‘উমর (রাঃ) তাঁকে ডেকে বললেন, হে সাওদা! আমি কিন্তু আপনাকে চিনে ফেলেছি। পর্দার হুকুম নাযিল হওয়ার আগে তিনি এ কথা বলেছিলেন। তারপর আল্লাহ তা‘আলা পর্দার হুকুম নাযিল করেন।',
              ref:
                  '',),
        ]),
PorichedModel(
        id: ' পরিচ্ছেদঃ ১০৮।',
        name: '  মহিলাদের বাইরে যাওয়া',
        hadisNumberList: [
          HadisNumberModel(
              id: '  ১৪৯।',
              name:
                  ' যাকারিয়্যা (রহঃ) ... ‘আয়িশা (রাঃ) থেকে বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, তোমাদের প্রয়োজনের জন্য বের হবার অনুমতি দেয়া হয়েছে। হিশাম (রহঃ) বলেন, অর্থ প্রাকৃতিক প্রয়োজনে।',
              ref:
                  '',),
        ]),
PorichedModel(
        id: 'পরিচ্ছেদঃ ১০৯। ',
        name: '  ঘরে মলমূত্র ত্যাগ করা',
        hadisNumberList: [
          HadisNumberModel(
              id: ' ',
              name:
                  '১৫০। ইবরাহীম ইবনু মুনযির (রহঃ) .... ‘আবদুল্লাহ ইবনু ‘উমর (রাঃ) থেকে বর্ণিত, তিনি বলেন, আমি আমার বিশেষ এক প্রয়োজনে হাফসা (রাঃ) এর ঘরের ছাদে উঠলাম। তখন দেখলাম, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কিবলার দিকে পিঠ দিয়ে শাম-এর দিকে মুখ করে তাঁর প্রয়োজনে বসেছেন। প্রাসঙ্গিক আলোচনা হাদীসের বক্তব্য থেকে বুঝা যায় যে, বাধা দিবে না এমন হলে, কারো ঘরের ছাদে উঠা জায়েজ। প্রয়োজন বলতে হাদীসে পায়খানা সারার কথা বুঝানো হয়েছে। এর দ্বারা বুঝা যায় যে, যা বলা অসুন্দর তা ভিন্নভাবে তুলে ধরাই শ্রেয়। বাহ্যিক দৃষ্টিতে উক্ত হাদীস দু\'টিকে পরস্পর বিরোধী মনে হলেও আসলে তা পরস্পর বিরোধী নয়। এ ব্যাপারে আলেমগণের কয়েকটি মত পাওয়া যায়-(১) আলেমগণের কেউ কেউ উভয় হাদীসের মধ্যে সামঞ্জস্য সাধনে বলেন, রাসূলুল্লাহ সাল্লাল্লাহু \'আলাইহি ওয়াসাল্লাম ঘরের মধ্যে প্রাকৃতিক কাজ করছিলেন, আর পূর্বোক্ত হাদীসের নির্দেশনা হচ্ছে ঘরের বাইরের স্থানের জন্য(২) অপর দল বলেছেন, রাসূলুল্লাহ সাল্লাল্লাহু \'আলাইহি ওয়াসাল্লামের জন্য এটা বিশেষ ব্যতিক্রম ছিল।(৩) কেউ বলেছেন, ইবন উমার রাদিয়াল্লাহু আনহুমার উপরোক্ত ঘটনাটি সম্ভবত নিষেধ করার পূর্বে ছিল। ',
              ref:
                  '',),
                  HadisNumberModel(
              id: ' ১৫১। ',
              name:
                  'ইয়াকূব ইবনু ইবরাহীম (রহঃ) .... আবদুল্লাহ ইবনু উমর (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ একদিন আমি আমাদের ঘরের উপর উঠলাম। আমি দেখলাম, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দু\'টি ইটের উপর বায়তুল মুকাদ্দাসের দিকে মুখ করে প্রাকৃতিক প্রয়োজনে বসেছেন। ',
              ref:
                  '',),
        ]),
PorichedModel(
        id: 'পরিচ্ছেদঃ ১১০। ',
        name: '  পানি দ্বারা ইসতিনজা করা',
        hadisNumberList: [
          HadisNumberModel(
              id: '১৫২। ',
              name:
                  ' আবূল ওলীদ হিশাম ইবনু ‘আবদুল মালিক (রহঃ) .... আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন প্রাকৃতিক প্রয়োজনে বের হতেন তখন আমি ও আরেকটি ছেলে পানির পাত্র নিয়ে আসতাম। অর্থাৎ তিনি তা দিয়ে ইসতিনজা করতেন। ',
              ref:
                  '',),
        ]),
 PorichedModel(
        id: 'পরিচ্ছেদঃ ১১১। ',
        name: ' পবিত্রতা হাসিলের জন্য কারো সাথে পানি নিয়ে যাওয়া। ',
        hadisNumberList: [
          HadisNumberModel(
              id: ' ',
              name:
                  'وَقَالَ أَبُو الدَّرْدَاءِ: أَلَيْسَ فِيكُمْ صَاحِبُ النَّعْلَيْنِ وَالطَّهُورِ وَالْوِسَادِ আবুদ-দারদা (রাঃ) বলেন, তোমাদের মধ্যে কি জুতা, পানি ও বালিশ বহনকারী ব্যক্তি [আবদুল্লাহ ইবন মাস‘ঊদ (রা)] নেই? ১৫৩। সুলায়মান ইবনু হারব (রহঃ) ... আনাস (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন প্রাকৃতিক প্রয়োজনে বের হতেন তখন আমি ও আরেকটি ছেলে তাঁর পিছনে পানির পাত্র নিয়ে যেতাম। ',
              ref:
                  '',),
        ]),
  PorichedModel(
        id: ' পরিচ্ছেদঃ ১১২।',
        name: ' ইসতিনজার জন্য পানির সাথে (লৌহ ফলকযুক্ত) লাঠি নিয়ে যাওয়া ',
        hadisNumberList: [
          HadisNumberModel(
              id: ' ১৫৪।',
              name:
                  ' মুহাম্মদ ইবনু বাশশার (রহঃ) ... আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন শৌচাগারে যেতেন তখন আমি ও আরেকটি ছেলে পানির পাত্র এবং \'আনাযা\' নিয়ে যেতাম। তিনি পানি দ্বারা ইসতিনজা করতেন। নাযর (রহঃ) ও শাযান (রহঃ) শু‘বা (রহঃ) থেকে অনুরূপ বর্ণনা করেন। হাদীসে বর্ণিত (عَنَزَة) ‘আনাযা’ শব্দের অর্থ এমন লাঠি যার মাথায় লোহা লাগানো থাকে। ',
              ref:
                  '',),
        ]),
  PorichedModel(
        id: 'পরিচ্ছেদঃ ১১৩। ',
        name: ' ডান হাতে ইসতিনজা করার নিষেধাজ্ঞা ',
        hadisNumberList: [
          HadisNumberModel(
              id: '১৫৫। ',
              name:
                  ' মু‘আয ইবনু ফাযালা (রহঃ) ... আবূ কাতাদা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, তোমাদের কেউ যখন পান করে, তখন সে যেন পাত্রের মধ্যে নিঃশ্বাস না ছাড়ে। আর যখন শৌচাগারে যায় তখন তার পুরূষাঙ্গ যেন ডান হাত দিয়ে স্পর্শ না করে এবং ডান হাতে ইস্তিঞ্জা না করে। ',
              ref:
                  '',),
        ]),
  PorichedModel(
        id: 'পরিচ্ছেদঃ ১১৪। ',
        name: ' প্রস্রাব করার সময় ডান হাত দিয়ে পুরূষাঙ্গ ধরবে না ',
        hadisNumberList: [
          HadisNumberModel(
              id: '১৫৬। ',
              name:
                  '  মুহাম্মদ ইবনু ইউসুফ (রহঃ) .... আবূ কাতাদা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ তোমাদের কেউ যখন পেশাব করে তখন সে যেন কখনো ডান হাত দিয়ে তার পুরূষাঙ্গ না ধরে এবং ডান হাত দিয়ে ইসতিনজা না করে এবং পান করার সময় যেন পাত্রের মধ্যে নিঃশ্বাস না ফেলে।',
              ref:
                  '',),
        ]),
  PorichedModel(
        id: ' পরিচ্ছেদঃ ১১৫।',
        name: '  পাথর দিয়ে ইসতিনজা করা',
        hadisNumberList: [
          HadisNumberModel(
              id: ' ১৫৭।',
              name:
                  '  আহমদ ইবনু মুহাম্মদ আল-মক্কী (রহঃ) ... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম প্রাকৃতিক প্রয়োজনে বের হলে আমি তাঁর অনুসরণ করলাম। আর তিনি এদিক ওদিক তাকাতেন না। যখন আমি তাঁর নিকটবর্তী হলাম তখন তিনি আমাকে বললেন, আমাকে কিছু পাথর কুড়িয়ে দাও, আমি তা দিয়ে ইসতিনজা করব। (বর্ণনাকারী বলেন), বা এ ধরনের কোন কথা বললেন, আর আমার জন্য হাড় বা গোবর আনবে না। তখন আমি আমার কাপড়ের কোচায় করে কয়েকটি পাথর এনে তাঁর পাশে রাখলাম এবং আমি তাঁর থেকে সরে গেলাম। তিনি প্রয়োজন শেষে সেগুলো ব্যবহার করলেন।',
              ref:
                  '',),
        ]),
  PorichedModel(
        id: ' পরিচ্ছেদঃ ১১৬। ',
        name: 'গোবর দিয়ে ইসতিনজা না করা ',
        hadisNumberList: [
          HadisNumberModel(
              id: '১৫৮। ',
              name:
                  '  আবূ নু‘আয়ম (রহঃ) ... ‘আবদুল্লাহ (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) একবার শৌচ কাজে যাবার সময় তিনটি পাথর কুড়িয়ে দিতে আমাকে আদেশ দিলেন। তখন আমি দু’টি পাথর পেলাম এবং তৃতীয়টির জন্য খোঁজাখুঁজি করলাম কিন্তু পেলাম না। তাই একখণ্ড শুকনো গোবর নিয়ে তাঁর কাছে গেলাম। তিনি পাথর দু’টি নিলেন এবং গোবর খণ্ড ফেলে দিয়ে বললেন, এটা নোংরা। ইবরাহীম ইবন ইউসুফ (রহঃ), তার পিতা, আবূ ইসহাক (রহঃ), আবদূর রহমান (রহঃ) এর সূত্রে হাদীসখানা বর্ণনা করে',
              ref:
                  '',),
        ]),
  PorichedModel(
        id: ' পরিচ্ছেদঃ ১১৭। ',
        name: 'উযূতে একবার করে ধোয়া ',
        hadisNumberList: [
          HadisNumberModel(
              id: '১৫৯। ',
              name:
                  ' মুহাম্মদ ইবনু ইউসুফ (রহঃ) ... ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক উযূ (ওজু/অজু/অযু)-তে একবার করে ধুয়েছেন। ',
              ref:
                  '',),
        ]),
  PorichedModel(
        id: ' পরিচ্ছেদঃ ১১৮।',
        name: '  উযূতে দু’বার করে ধোয়া',
        hadisNumberList: [
          HadisNumberModel(
              id: '১৬০।  ',
              name:
                  'হুসায়ন ইবনু ‘ঈসা (রহঃ) ... ‘আবদুল্লাহ ইবনু যায়দ (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) উযূ (ওজু/অজু/অযু)-তে দু’বার করে ধুয়েছেন। ',
              ref:
                  '',),
        ]),
  PorichedModel(
        id: 'পরিচ্ছেদঃ ১১৯। ',
        name: '  উযূতে তিনবার করে ধোয়া',
        hadisNumberList: [
          HadisNumberModel(
              id: '১৬১। ',
              name:
                  '  আবদুল ‘আযীয ইবনু ‘আবদুল্লাহ আল-উওয়ায়সী (রহঃ) ... হুমরান (রহঃ) থেকে বর্ণিত, তিনি ‘উসমান ইবনু আফফান (রাঃ)-কে দেখেছেন যে, তিনি পানির পাত্র আনিয়ে উভয় হাতের তালুতে তিনবার ঢেলে তা ধুয়ে নিলেন। এরপর ডান হাত পাত্রের মধ্যে ঢুকালেন। তারপর কুলি করলেন ও নাকে পানি দিয়ে নাক পরিষ্কার করলেন। তারপর তাঁর মুখমণ্ডল তিনবার ধুয়ে এবং দু’হাত কনুই পর্যন্ত তিনবার ধুয়ে নিলেন। এরপর মাথা মাসেহ করলেন। তারপর উভয় পা গিরা পর্যন্ত তিনবার ধুয়ে নিলেন। পরে বললেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যাক্তি আমার মত এ রকম উযূ (ওজু/অজু/অযু) করবে, তারপর দু রাক‘আত সালাত (নামায/নামাজ) আদায় করবে, যাতে দুনিয়ার কোন খেয়াল করবে না, তার পেছনের গুনাহ মাফ করে দেওয়া হবে। ইবরাহীম (রহঃ) ... ইবনু শিহাব (রহঃ) থেকে বর্ণিত, তিনি বলেন, ‘উরওয়া হুমরান থেকে বর্ণনা করেন, ‘উসমান (রাঃ) উযূ (ওজু/অজু/অযু) করে বললেন, আমি তোমাদেরকে একটি হাদীস বর্ণনা করব। যদি একটি আয়াতে কারীমা না হত, তবে আমি তোমাদেরকে এ হাদীস বর্ণনা করতাম না। আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম–কে বলতে শুনেছি, যে কোন ব্যাক্তি সুন্দর করে উযূ করবে এবং সালাত (নামায/নামাজ) আদায় করবে, পরের সালাত আদায় করা পর্যন্ত তার মধ্যবর্তী যত গুনাহ আছে সব মাফ করে দেওয়া হবে। ‘উরওয়া (রহঃ) বলেন, সে আয়াতটি হলঃ إِنَّ الَّذِينَ يَكْتُمُونَ مَا أَنْزَلْنَا مِنَ الْبَيِّنَاتِ আমি যে সব স্পষ্ট নিদর্শন অবতীর্ণ করেছি তা যারা গোপন করে (২ : ১৫৯)',
              ref:
                  '',),
        ]),
  PorichedModel(
        id: ' পরিচ্ছেদঃ ১২০। ',
        name: 'উযূর মধ্যে নাকে পানি দেয়ে নাক পরিষ্কার করা ‘উসমান (রা), আবদুল্লাহ ইবন যায়দ (রা) ও ইবন ‘আব্বাস (রা) নবী থেকে এ কথা বর্ণনা করেছেনঃ ',
        hadisNumberList: [
          HadisNumberModel(
              id: '১৬২। ',
              name:
                  ' আবদান (রহঃ) ...... আবূ ইদরিস (রহঃ) থেকে বর্ণিত, তিনি বলেন, তিনি আবূ হুরায়রা (রাঃ)–কে বলতে শুনেছেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেনঃ যে ব্যাক্তি উযূ (ওজু/অজু/অযু) করে সে যেন নাকে পানি দিয়ে নাক পরিষ্কার করে। আর যে ইসতিনজা করে সে যেন বেজোড় সংখ্যক ঢিলা-কুলুখ ব্যবহার করে। ',
              ref:
                  '',),
        ]),
  PorichedModel(
        id: ' পরিচ্ছেদঃ ১২১।',
        name: '  (ইসতিনজার জন্য) বেজোড় সংখ্যক ঢিলা-কুলুখ ব্যবহার করা',
        hadisNumberList: [
          HadisNumberModel(
              id: ' ১৬৩। ',
              name:
                  '‘আবদুল্লাহ ইবনু ইউসুফ (রহঃ) .... আবূ হুরায়রা (রহঃ) থেকে বর্ণিত যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের মধ্যে কেউ যখন উযূ (ওজু/অজু/অযু) করে তখন সে যেন নাকে পানি দেয়, এরপর যেন ঝেড়ে নেয়। আর যে ইস্তিঞ্জা করে সে যেন বেজোড় সংখ্যক ঢিলা-কুলুখ ব্যবহার করে। আর তোমাদের কেউ যখন ঘুম থেকে জাগে তখন সে যেন উযূর পানিতে হাত ঢুকানোর আগে তা ধুয়ে নেয়; কারণ তোমাদের কেউ জাননা যে, ঘুমন্ত অবস্থায় তার হাত কোথায় থাকে। ',
              ref:
                  '',),
        ]),
  PorichedModel(
        id: ' পরিচ্ছেদঃ ১২২। ',
        name: 'দু’পা ধোয়া এবং মাসেহ না করা ',
        hadisNumberList: [
          HadisNumberModel(
              id: '১৬৪। ',
              name:
                  ' মূসা (রহঃ) .... ‘আবদুল্লাহ ইবনু ‘আমর (রাঃ) থেকে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক সফরে আমাদের পিছনে রয়ে গিয়েছিলেন, এরপর তিনি আমাদের কাছে পৌঁছে গেলেন। তখন আমরা আসরের সালাত (নামায/নামাজ) শুরু করতে দেরী করে ফেলেছিলাম। তাই আমরা উযূ (ওজু/অজু/অযু) করছিলাম এবং (তাড়াতাড়ির কারনে) আমাদের পা মাসেহ করার মত হালকা ভাবে ধুয়ে নিচ্ছিলাম। তখন তিনি উচ্চস্বরে বললেনঃ \'পায়ের গোড়ালির জন্য জাহান্নামের আযাব রয়েছে\'। দুবার অথবা তিনবার তিনি একথা বললেন। ',
              ref:
                  '',),
        ]),
  PorichedModel(
        id: ' পরিচ্ছেদঃ ১২৩।',
        name: ' উযূতে কুলি করা। ',
        hadisNumberList: [
          HadisNumberModel(
              id: ' ',
              name:
                  'قَالَهُ ابْنُ عَبَّاسٍ وَعَبْدُ اللَّهِ بْنُ زَيْدٍ رَضِيَ اللَّهُ عَنْهُمْ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ইবন ‘আব্বাস (রাঃ) ও ‘আবদুল্লাহ ইবন যায়দ (রাঃ) নবী থেকে তা বর্ণনা করেছেন। ১৬৫। আবূল ইয়ামান (রহঃ) ..... ‘উসমান ইবনু ‘আফ্‌ফান (রাঃ) এর আযাদকৃত গোলাম হুমরান (রহঃ) থেকে বর্ণিতঃ তিনি ‘উসমান (রাঃ)-কে উযূর পানি আনাতে দেখলেন। তারপর তিনি সে পাত্র থেকে উভয় হাতের উপর পানি ঢেলে তা তিনবার ধুয়ে ফেললেন। এরপর তাঁর ডান হাত পানিতে ঢুকালেন। এরপর কুলি করলেন এবং নাকে পানি দিয়ে নাক ঝেড়ে ফেললেন। এরপর তাঁর মুখমণ্ডল তিনবার এবং উভয় হাত কুনই পর্যন্ত তিনবার ধুলেন, এরপর মাথা মাসেহ করলেন। এরপর প্রত্যেক পা তিনবার ধোয়ার পর বললেনঃ আমি রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে আমার এ উযূর ন্যায় উযূ (ওজু/অজু/অযু) করতে দেখেছি এবং রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যাক্তি আমার এ উযূর ন্যায় উযূ করে দু’ রাক‘আত সালাত (নামায/নামাজ) আদায় করবে এবং তার মধ্য কোন বাজে খেয়াল মনে আনবে না, আল্লাহ তা‘আলা তাঁর অতীতের সব গুনাহ মাফ করে দিবেন। ',
              ref:
                  '',),
        ]),
  PorichedModel(
        id: 'পরিচ্ছেদঃ ১২৪। ',
        name: ' পায়ের গোড়ালী ধোয়া। ',
        hadisNumberList: [
          HadisNumberModel(
              id: ' ',
              name:
                  ' وَكَانَ ابْنُ سِيرِينَ يَغْسِلُ مَوْضِعَ الْخَاتَمِ إِذَا تَوَضَّأَ ইবনে সীরীন (রহঃ) উযূ করার সময় তাঁর আংটির জায়গা ধুতেন। ১৬৬। আদম ইবনু আবূ ইয়াস (রহঃ) .... মুহাম্মদ ইবনু যিয়াদ (রহঃ) থেকে বর্ণিতঃ তিনি বলেন, আবূ হুরায়রা (রাঃ) আমাদের কাছ দিয়ে যাচ্ছিলেন। লোকেরা সে সময় পাত্র থেকে উযূ (ওজু/অজু/অযু) করছিল। তখন তাঁকে বলতে শুনেছি, তোমরা উত্তমরূপে উযূ কর। কারন আবূল কাসিম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ পায়ের গোড়ালীগুলোর জন্য জাহান্নামের শাস্তি রয়েছে।',
              ref:
                  '',),
        ]),
  PorichedModel(
        id: ' পরিচ্ছেদঃ ১২৫।',
        name: '  চপ্পল পরা অবস্থায় উভয় পা ধোয়া কিন্তু চপ্পলের উপর মাসেহ না করা',
        hadisNumberList: [
          HadisNumberModel(
              id: '১৬৭। ',
              name:
                  ' আবদুল ইবনু ইউসুফ (রহঃ) .... ‘উবায়দ ইবনু জুরায়জ (রহঃ) থেকে বর্ণিতঃ তিনি ‘আবদুল্লাহ ইবনু ‘উমর (রাঃ)-কে বললেন, হে আবূ ‘আবদুর রহমান! আমি আপনাকে এমন চারটি কাজ করতে দেখি, যা আপনার অন্য কোন সঙ্গীকে করতে দেখিনা। তিনি বললেন, ‘ইবনু জুরায়জ, সেগুলো কি?’ তিনি বললেন, আমি দেখি, (১) আপনি তাওয়াফ করার সময় রুকনে ইয়ামানী দু\'টি ব্যতীত অন্য রুকন স্পর্শ করেন না। (২) আপনি ‘সিবতী’ (পশমবিহীন) চপ্পল পরিধান করেন; (৩) আপনি (কাপড়ে) হলুদ রং ব্যবহার করেন এবং (৪) আপনি যখন মক্কায় থাকেন লোকে চাঁদ দেখে ইহরাম বাঁধে; কিন্তু আপনি তারবিয়ার দিন (৮ ই যিলহাজ্জ) না এলে ইহরাম বাঁধেন না। ‘আবদুল্লাহ (রাঃ) বললেনঃ রুকনের কথা যা বলেছ, তা এজন্য করি যে আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে ইয়ামানী রুকনদ্বয় ছাড়া আর কোনটি স্পর্শ করতে দেখিনি। আর ‘সিবতী’ চপ্পল, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে পশমবিহীন চপ্পল পরতে এবং তা পরিহিত অবস্থায় উযূ (ওজু/অজু/অযু) করতে দেখেছি, তাই আমি তা করতে ভালবাসি। আর হলুদ রং, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে তা দিয়ে কাপড় রঙিন করতে দেখেছি, তাই আমিও তা দিয়ে রঙিন করতে ভালবাসি। আর ইহরাম, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে নিয়ে তাঁর সওয়ারি রওনা না হওয়া পর্যন্ত আমি তাঁকে ইহরাম বাঁধতে দেখিনি। ',
              ref:
                  '',),
        ]),
  PorichedModel(
        id: 'পরিচ্ছেদঃ ১২৬। ',
        name: ' উযূ এবং গোসলে ডান দিক থেকে শুরু করা ',
        hadisNumberList: [
          HadisNumberModel(
              id: ' ১৬৮।',
              name:
                  '  মূসা’দ্দাদ (রহঃ) .... উম্মু আতিয়্যা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর কন্যা [যয়নাব (রাঃ)]-কে গোসল করানোর সময় তাঁদের বলেছিলেনঃ তোমরা তার ডানদিক এবং উযূ (ওজু/অজু/অযু) এর স্থান থেকে শুরু কর।',
              ref:
                  '',),
                  HadisNumberModel(
              id: '১৬৯।  ',
              name:
                  'হাফস ইবনু ‘উমর (রহঃ) .... ‘আয়িশা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জুতা পরা, চুল আঁচড়ানো এবং পবিত্রতা অর্জন করা তথা প্রত্যেক কাজই ডান দিক থেকে শুরু করতে ভালবাসতেন। প্রাসঙ্গিক আলোচনা ডান দিক যে কোনো ভালো কাজের জন্য ব্যবহার করা সুন্নাতসম্মত। ইমাম সানাআনী বলেন, আল্লাহ ও তাঁর রাসুল কর্তৃক কোনো কিছু পছন্দ করার বিষয়টি বর্ণিত হলে সেটি নিদেনপক্ষে বৈধ হওয়া সাব্যস্ত করে; কারণ তা হয় ওয়াজিব হবে না হয় মুস্তাহাব হবে। ইমাম ইবন তাইমিয়্যাহ রাহিমাহুল্লাহ বলেন, ডান দিক ব্যবহারের এ নিয়ম থেকে বাথরুমে প্রবেশ করা, মসজিদ থেকে বের হওয়া ইত্যাদি কর্মকাণ্ডগুলো ব্যতিক্রম ধরা হবে। * এই হাদীস হতে শিক্ষণীয় বিষয়: ১। প্রকৃত ইসলাম ধর্মের একটি স্থায়ী বিধান হলো এই যে, সম্মানিত ও সমাদৃত কাজে অথবা যে বিষয়টির দ্বারা সম্মান ও মর্যাদাদান করা হয়: যেমন জামাকাপড়, পাজামা, মোজা পরিধান করা। এবং মাসজিদে প্রবেশ, মেসওয়াক বা দাঁতন ব্যবহার করা, চোখে কাজল বা সুরমা লাগানো, নখ কাটা, মোচ ছাঁটা, চিরনির দ্বারা মাথার চুল আঁচড়াবার সময়, বগলের চুল উপড়ানো বা তুলে ফেলার সময়, মাথার চুল মুণ্ডন এবং নামাজ শেষে সালাম ফেরানো, পবিত্রতার্জন করার সময়, দেহের অঙ্গগুলি ধৌত করার সময় ডান দিক থেকে শুরু করা উত্তম। অনুরূপভাবে শৌচাগার বা টয়লেট থেকে বের হওয়ার সময়, পানাহার ও মুসাফাহা করার সময় এবং  হাজরে আসওয়াদ ‍স্পর্শ করার সময় এবং আরো ইত্যাদি সেই সমস্ত কাজে ডান হাত কিংবা  দিক থেকে আরম্ভ করা উত্তম বা মুস্তাহাব যে সমস্ত কাজে সম্মান ও মর্যাদাদান করা হয় । ২। তবে যে সমস্ত কাজে সম্মান ও মর্যাদা দান করা হয় না যেমন, শৌচাগার বা টয়লেটে প্রবেশ করা, মাসজিদ থেকে বের হওয়া,  নাক পরিষ্কার করা, মলত্যাগের পর মলদ্বার ইত্যাদি পরিষ্কার করা, জামাকাপড়, পাজামা, মোজা ইত্যাদি খোলার কাজগুলি বাম দিক থেকে সম্পাদন করা উত্তম বা মুস্তাহাব। আর এই বিধানটির উদ্দেশ্য হলো ডান দিকের সম্মান ও মর্যাদা দান করা। ৩। প্রত্যেক মুসলিম ব্যক্তির একটি অপরিহার্য বিষয় হলো এই যে, তারা যেন প্রকৃত ইসলাম ধর্মের কার্য সম্পাদনের ক্ষেত্রে আল্লাহর রাসূল [সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম] এর সঠিক পন্থায় অনুসরণ করে। ',
              ref:
                  '',),
        ]),
  PorichedModel(
        id: 'পরিচ্ছেদঃ ১২৭। ',
        name: ' সালাতের সময় নিকটবর্তি বলে উযূর পানি তালাশ করা। ',
        hadisNumberList: [
          HadisNumberModel(
              id: ' ',
              name:
                  'وَقَالَتْ عَائِشَةُ حَضَرَتِ الصُّبْحُ فَالْتُمِسَ الْمَاءُ، فَلَمْ يُوجَدْ، فَنَزَلَ التَّيَمُّمُ ‘আয়িশা (রা) বলেনঃ একবার ফজরের সময় হল, তখন পানি তালাশ করা হল; কিন্তু কোথাও পাওয়া গেল না। তখন তায়াম্মুম (এর আয়াত) নাযিল হল। ১৭০। আবদুল্লাহ ইবনু ইউসুফ (রহঃ) ..... আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে দেখলাম, তখন আসরের সালাত (নামায/নামাজ)-এর সময় হয়ে গিয়েছিল। আর লোকজন উযূর পানি তালাশ করতে লাগল কিন্তু পেল না। তারপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে কিছু পানি আনা হল। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সে পাত্রে তাঁর হাত রাখলেন এবং লোকজনকে সে পাত্র থেকে উযূ (ওজু/অজু/অযু) করতে বললেন। আনাস (রাঃ) বলেন, সে সময় আমি দেখলাম, তাঁর আঙ্গুলের নীচ থেকে পানি উথলে উঠছে। এমনকি তাঁদের শেষ ব্যাক্তি পর্যন্ত তা দিয়ে উযূ করল। ',
              ref:
                  '',),
        ]),
 PorichedModel(
        id: ' পরিচ্ছেদঃ ১২৮। ',
        name: 'যে পানি দেয়ে মানুষের চুল ধোয়া হয়। ',
        hadisNumberList: [
          HadisNumberModel(
              id: ' ',
              name:
                  'وَكَانَ عَطَاءٌ لاَ يَرَى بِهِ بَأْسًا أَنْ يُتَّخَذَ مِنْهَا الْخُيُوطُ وَالْحِبَالُ، وَسُؤْرِ الْكِلاَبِ وَمَمَرِّهَا فِي الْمَسْجِدِ. وَقَالَ الزُّهْرِيُّ إِذَا وَلَغَ فِي إِنَاءٍ لَيْسَ لَهُ وَضُوءٌ غَيْرُهُ يَتَوَضَّأُ بِهِ. وَقَالَ سُفْيَانُ هَذَا الْفِقْهُ بِعَيْنِهِ، يَقُولُ اللَّهُ تَعَالَى: (فَلَمْ تَجِدُوا مَاءً فَتَيَمَّمُوا) وَهَذَا مَاءٌ، وَفِي النَّفْسِ مِنْهُ شَيْءٌ، يَتَوَضَّأُ بِهِ وَيَتَيَمَّمُ ‘আতা (রহঃ) চুল দিয়ে সুতা এবং রশি প্রস্তুত করায় কোন দোষ মনে করতেন না- কুকুরের ঝুটা এবং মসজিদের ভিতর দিয়ে কুকুরের যাতায়াত। যুহরী (রহঃ) বলেন, কুকুর যখন কোন পানির পাত্রে মুখ দেয় এবং সে পানি ছাড়া উযূ করার মত অন্য কোন পানি না থাকে, তবে তা দিয়েই উযূ করবে। সুফিয়ান (রহঃ) বলেন, হুবহু এ মাসআলাটি বিবৃত হয়েছে আল্লাহ তা‘আলার এ বাণীতেঃ (فَلَمْ تَجِدُوا مَاءً فَتَيَمَّمُوا) “তারপর তোমরা যদি পানি না পাও তবে পাবিত্র মাটি দিয়ে তায়াম্মুম কর।” আর এ তো পানিই। কিন্তু অন্তরে যেহেতু কিছু সন্দেহ রয়েছে তাই তা দিয়ে উযূ করবে, পরে তায়াম্মুমও করবে। ১৭১। মালিক ইবনু ইসমা‘ঈল (রহঃ) .... ইবনু সীরীন (রহঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি আবীদা (রহঃ)-কে বললাম, আমাদের কাছে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কেশ রয়েছে যা আমরা আনাস (রাঃ) এর কাছ থেকে কিংবা আনাস (রাঃ) এর পরিবারের কাছ থেকে পেয়েছি। তিনি বললেন, তাঁর একটি কেশ আমার কাছে থাকাটা দুনিয়া এবং দুনিয়ার মধ্যে যা কিছু আছে তা পাওয়ার চাইতে বেশী পছন্দনীয়। باب الْمَاءِ الَّذِي يُغْسَلُ بِهِ شَعَرُ الإِنْسَانِ حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا إِسْرَائِيلُ، عَنْ عَاصِمٍ، عَنِ ابْنِ سِيرِينَ، قَالَ قُلْتُ لِعَبِيدَةَ عِنْدَنَا مِنْ شَعَرِ النَّبِيِّ صلى الله عليه وسلم صلى الله عليه وسلم أَصَبْنَاهُ مِنْ قِبَلِ أَنَسٍ، أَوْ مِنْ قِبَلِ أَهْلِ أَنَسٍ فَقَالَ لأَنْ تَكُونَ عِنْدِي شَعَرَةٌ مِنْهُ أَحَبُّ إِلَىَّ مِنَ الدُّنْيَا وَمَا فِيهَا‏.‏ ',
              ref:
                  '',),
                  HadisNumberModel(
              id: ' ১৭২।',
              name:
                  '  মুহাম্মদ ইবনু ‘আবদুর রহীম (রহঃ) .... আনাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর মাথা মুড়িয়ে ফেললে আবূ তালহা (রাঃ)-ই প্রথম তাঁর কেশ সংগ্রহ করেন।',
              ref:
                  '',),
        ]),
PorichedModel(
        id: 'পরিচ্ছেদঃ ১২৯। ',
        name: ' কুকুর যদি পাত্র থেকে পানি পান করে ',
        hadisNumberList: [
          HadisNumberModel(
              id: ' ১৭৩। ',
              name:
                  ' আবদুল্লাহ ইবনু ইউসুফ (রহঃ) .... আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তোমাদের কারো পাত্রে যদি কুকুর পান করে তবে তা সাতবার ধুইবে।',
              ref:
                  '',),
                  HadisNumberModel(
              id: ' ১৭৪।',
              name:
                  ' ইসহাক (রহঃ) ..... আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, (পূর্ব যুগে) এক ব্যাক্তি একটি কুকুরকে পিপাসার তাড়নায় ভিজা মাটি চাটতে দেখতে পেল। তখন সে ব্যাক্তি তাঁর মোজা নিল এবং কুকুরটির জন্য কুয়া থেকে পানি এনে দিতে লাগল। এভাবে সে ওর তৃষ্ণা মিটাল। আল্লাহ এর বিনিময় দিলেন এবং তাকে জান্নাতে দাখিল করলেন। আহমদ ইবনু শাবীব (রহঃ) .... ‘আবদুল্লাহ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর যামানায় কুকুর মসজিদের ভিতর দিয়ে আসা-যাওয়া করত অথচ এজন্য তাঁরা কোথাও পানি ছিটিয়ে দিতেন না। ',
              ref:
                  '',),
                  HadisNumberModel(
              id: ' ১৭৫।',
              name:
                  '  হাফস ইবনু উমর (রহঃ) .... আদী ইবনু হাতিম (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি (প্রশিক্ষণপ্রাপ্ত কুকুর সম্পর্কে) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে জিজ্ঞাসা করলাম, তিনি বললেন, তুমি যখন তোমার প্রশিক্ষণপ্রাপ্ত কুকুর শিকার করতে ছেড়ে দাও, তখন সে হত্যা করলে তা তুমি খেতে পার। আর সে তার কিছু অংশ খেয়ে ফেললে তুমি তা খাবে না। কারণ সে তা নিজের জন্যই ধরেছে। আমি জিজ্ঞাসা করলাম, কখনো কখনো আমি আমার কুকুর (শিকারে) পাঠিয়ে দেই, এরপর তার সাথে অন্য এক কুকুরও দেখতে পাই (এমতাবস্থায় শিকারকৃত প্রানীর কি হুকুম)? তিনি বললেন, তাহলে খেও না। কারন তুমি বিসমিল্লাহ বলেছ কেবল তোমার কুকুরের বেলায়, অন্য কুকুরের বেলায় বিসমিল্লাহ বলনি।',
              ref:
                  '',),
        ]),
 PorichedModel(
        id: ' পরিচ্ছেদঃ ১৩০।',
        name: '  সম্মুখ এবং পেছনের রাস্তা দিয়ে কিছু নির্গত হওয়া ছাড়া অন্য কারণে যিনি উযূর প্রয়োজন মনে করেন না',
        hadisNumberList: [
          HadisNumberModel(
              id: ' ',
              name:
                  'وَقَوْلِ اللَّهِ تَعَالَى: (أَوْ جَاءَ أَحَدٌ مِنْكُمْ مِنَ الْغَائِطِ) وَقَالَ عَطَاءٌ فِيمَنْ يَخْرُجُ مِنْ دُبُرِهِ الدُّودُ أَوْ مِنْ ذَكَرِهِ نَحْوُ الْقَمْلَةِ يُعِيدُ الْوُضُوءَ. وَقَالَ جَابِرُ بْنُ عَبْدِ اللَّهِ إِذَا ضَحِكَ فِي الصَّلاَةِ أَعَادَ الصَّلاَةَ، وَلَمْ يُعِدِ الْوُضُوءَ. وَقَالَ الْحَسَنُ إِنْ أَخَذَ مِنْ شَعَرِهِ وَأَظْفَارِهِ أَوْ خَلَعَ خُفَّيْهِ فَلاَ وُضُوءَ عَلَيْهِ. وَقَالَ أَبُو هُرَيْرَةَ لاَ وُضُوءَ إِلاَّ مِنْ حَدَثٍ. وَيُذْكَرُ عَنْ جَابِرٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ فِي غَزْوَةِ ذَاتِ الرِّقَاعِ فَرُمِيَ رَجُلٌ بِسَهْمٍ، فَنَزَفَهُ الدَّمُ فَرَكَعَ وَسَجَدَ، وَمَضَى فِي صَلاَتِهِ. وَقَالَ الْحَسَنُ مَا زَالَ الْمُسْلِمُونَ يُصَلُّونَ فِي جِرَاحَاتِهِمْ. وَقَالَ طَاوُسٌ وَمُحَمَّدُ بْنُ عَلِيٍّ وَعَطَاءٌ وَأَهْلُ الْحِجَازِ لَيْسَ فِي الدَّمِ وُضُوءٌ. وَعَصَرَ ابْنُ عُمَرَ بَثْرَةً فَخَرَجَ مِنْهَا الدَّمُ، وَلَمْ يَتَوَضَّأْ. وَبَزَقَ ابْنُ أَبِي أَوْفَى دَمًا فَمَضَى فِي صَلاَتِهِ. وَقَالَ ابْنُ عُمَرَ وَالْحَسَنُ فِيمَنْ يَحْتَجِمُ لَيْسَ عَلَيْهِ إِلاَّ غَسْلُ مَحَاجِمِهِ আল্লাহ তা‘আলার এ বাণীর কারণেঃ (أَوْ جَاءَ أَحَدٌ مِنْكُمْ مِنَ الْغَائِطِ) “অথবা তোমাদের কেউ শৌচ স্থান থেকে আসে (৮ঃ ৪৩)। ‘আতা (রহঃ) বলেন, যার পেছনের রাস্থা দিয়ে পোকা বের হয় অথবা যার পুরুষাঙ্গ দিয়ে উকুনের ন্যায় কিছু বের হয়, তার পুনরায় উযূ করতে হবে। জাবির ইবন ‘আবদুল্লাহ (রাঃ) বলেন, কেউ সালাতের মধ্যে হেসে ফেললে কেবল সালাতই দোহরাবে, পুনরায় উযূ করবে না। হাসান (রহঃ) বলেন, কেউ যদি চুল অথবা নখ কাটে অথবা তার মোজা খুলে ফেলে তবে তার পুনরায় উযূ করতে হবে না। আবূ হুরায়রা (রাঃ) বলেন, ‘হাদাস’ ছাড়া আর কিছুতে উযূর প্রয়োজন নেই। জাবির (রাঃ) থেকে বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ‘যাতুর রিকা’ এর যুদ্ধে ছিলেন। সেখানে এক ব্যক্তি তীরবিদ্ধ হলেন এবং ফিনকি দিয়ে রক্ত ছুটল, কিন্তু তিনি (সে অবস্থায়ই) রুকু করলেন, সিজদা করলেন এবং সালাত আদায় করতে থাকলেন। হাসান (রহঃ) বলেন, মুসলিমগণ সব সময়েই তাঁদের যখম অবস্থায় সালাত আদায় করতেন এবং তাঊস (রহঃ), মুহাম্মদ ইবন ‘আলী (রহঃ), ‘আতা (রহঃ) ও হিজাযবাসীগণ বলেন, রক্তক্ষরণে উযূ করতে হয় না। ইবন ‘উমর (রাঃ) একবার একটি ছোট ফোঁড়া টিপ দিলেন, তা থেকে রক্ত বের হল, কিন্তু তিনি উযূ করলেন না। ইবন আবূ আওফা (রাঃ) রক্ত মিশ্রিত থুথু ফেললেন কিন্তু তিনি সালাত আদায় করতে থাকলেন। ইবন ‘উমর (রাঃ) ও হাসান (রহঃ) বলেন, কেউ শিঙ্গা লাগালে কেবল তার শিঙ্গা লাগানোর স্থানই ধোয়া প্রয়োজন। ১৭৬। আদম ইবনু আবূ ইয়াস (রহঃ) .... আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, বান্দা যে সময়টা মসজিদে থেকে সালাত (নামায/নামাজ)-এর অপেক্ষায় থাকে, তার সে পুরো সময়টাই সালাত (নামায/নামাজ)-এর মধ্যে গণ্য হয় যতক্ষণ না সে হাদাস করে। এক অনারব ব্যাক্তি বলল, ‘হাদাস কি, আবূ হুরায়রা’? তিনি বললেন, শব্দ করে বায়ূ বের হওয়া। باب مَنْ لَمْ يَرَ الْوُضُوءَ إِلاَّ مِنَ الْمَخْرَجَيْنِ، مِنَ الْقُبُلِ وَالدُّبُرِ حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، قَالَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ "‏ لاَ يَزَالُ الْعَبْدُ فِي صَلاَةٍ مَا كَانَ فِي الْمَسْجِدِ يَنْتَظِرُ الصَّلاَةَ، مَا لَمْ يُحْدِثْ ‏"‏‏.‏ فَقَالَ رَجُلٌ أَعْجَمِيٌّ مَا الْحَدَثُ يَا أَبَا هُرَيْرَةَ قَالَ الصَّوْتُ‏.‏ يَعْنِي الضَّرْطَةَ‏.‏ ',
              ref:
                  '',),
        ]),
   PorichedModel(
        id: ' পরিচ্ছেদঃ ১৩০।',
        name: ' সম্মুখ এবং পেছনের রাস্তা দিয়ে কিছু নির্গত হওয়া ছাড়া অন্য কারণে যিনি উযূর প্রয়োজন মনে করেন না ',
        hadisNumberList: [
          HadisNumberModel(
              id: ' ১৭৭।',
              name:
                  ' আবূল ওয়ালীদ (রহঃ) ..... ‘আব্বাস ইবনু তামীম (রহঃ), তাঁর চাচার সূত্রে বর্ণনা করেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ (কোন মুসল্লি) সালাত (নামায/নামাজ) থেকে ফিরবে না যতক্ষণ না সে শব্দ শুনে বা গন্ধ পায়। ',
              ref:
                  '',),
                    HadisNumberModel(
              id: '১৭৮।  ',
              name:
                  ' কুতায়বা (রহঃ) .... মুহাম্মদ ইবনুল হানফিয়্যা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, ‘আলী (রাঃ) বলেছেন, আমার বেশী বেশী মযী বের হতো। কিন্তু আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এ সম্পর্কে জিজ্ঞাসা করতে লজ্জাবোধ করছিলাম। তাই আমি মিকদাদ ইবনু আসওয়াদ (রাঃ)-কে অনুরোধ করলাম, তিনি যেন রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে জিজ্ঞাসা করেন। তিনি তাঁকে জিজ্ঞাসা করলেন। তিনি বললেনঃ এতে শুধু উযূ (ওজু/অজু/অযু) করতে হয়। হাদিসটি শু‘বা (রহঃ) আ‘মাশ (রহঃ) থেকে বর্ণনা করেছেন।',
              ref:
                  '',),
                    HadisNumberModel(
              id: '১৭৯।  ',
              name:
                  ' সা‘দ ইবনু হাফস (রহঃ) .... যায়দ ইবনু খালিদ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, তিনি ‘উসমান ইবনু ‘আফফান (রাঃ)-কে জিজ্ঞাসা করলেন ,কেউ যদি স্ত্রী সহবাস করে, কিন্তু মনী (বীর্য) বের না হয় (তবে তার হুকুম কি?) উসমান (রাঃ) বললেনঃ সে উযূ (ওজু/অজু/অযু) করে নেবে যেমন উযূ করে থাকে সালাত (নামায/নামাজ)-এর জন্য এবং তার লজ্জাস্থান ধুয়ে ফেলবে। উসমান (রাঃ) বলেন, আমি একথা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে শুনেছি। (যায়দ বলেন) তারপর আমি এ সম্পর্কে ‘আলী (রাঃ), যুবায়র (রাঃ), তালহা (রাঃ) ও উবাই ইবনু কা‘ব (রাঃ)-কে জিজ্ঞাসা করেছি। তাঁরা আমাকে এ নির্দেশই দিয়েছেন।',
              ref:
                  '',),
                    HadisNumberModel(
              id: '১৮০।  ',
              name:
                  'ইসহাক ইবনু মনসূর (রহঃ) .... আবূ সা‘য়ীদ খুদরী (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক আনসারীর কাছে লোক পাঠালেন। তিনি চলে এলেন। তখন তাঁর মাথা থেকে পানির ফোঁটা পড়ছিল। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ সম্ভবত আমরা তোমাকে তাড়াতাড়ি করতে বাধ্য করেছি। তিনি বললেন, জী। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, যখন ত্বরার কারণে মনী বের না হয় (অথবা বললেন), মনীর অভাবজনিত কারণে তা বের না হয় তবে তোমার উপর কেবল উযূ (ওজু/অজু/অযু) করা জরুরী। ওয়াহব (রহঃ) শু‘বা (রহঃ) সূত্রে এ রকমই বর্ণনা করেন। তিনি [শুবা (রহঃ)] বলেন, আবূ আবদুল্লাহ (রহঃ) বলেছেন, গুনদর (রহঃ) ও ইয়াহইয়া (রহঃ) শু‘বা (রহঃ) এর সূত্রে বর্ণনায় উযূর কথা উল্লেখ করেন নি। ',
              ref:
                  '',),
        ]),
   PorichedModel(
        id: ' পরিচ্ছেদঃ ১৩১।',
        name: ' শ্রদ্ধেয় জনকে কোন ব্যক্তির উযূ করিয়ে দেওয়া ',
        hadisNumberList: [
          HadisNumberModel(
              id: ' ১৮১। ',
              name:
                  ' ইবনু সালাম (রহঃ) .... উসামা ইবনু যায়দ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন আরাফাত থেকে ফিরছিলেন, তখন তিনি একটি গিরিপথের দিকে গিয়ে তাঁর প্রাকৃতিক প্রয়োজন সেরে এলেন। উসামা (রাঃ) বলেন, পরে আমি তাঁকে পানি ঢেলে দিচ্ছিলাম আর তিনি উযূ (ওজু/অজু/অযু) করছিলেন। এরপর আমি বললাম, ইয়া রাসুলাল্লাহ! আপনি কি সালাত (নামায/নামাজ) আদায় করবেন? তিনি বললেন, সালাত (নামায/নামাজ)-এর স্থান তোমার সামনে।',
              ref:
                  '',),
                  HadisNumberModel(
              id: ' ১৮২।',
              name:
                  '  আমর ইবনু ‘আলী (রহঃ) .... মুগীরা ইবনু শু‘বা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, তিনি এক সফরে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে ছিলেন। এক সময় তিনি প্রাকৃতিক প্রয়োজন সারতে গেলেন। (প্রয়োজন সেরে আসার পর) মুগীরা তাঁকে পানি ঢেলে দিচ্ছিলেন এবং তিনি উযূ (ওজু/অজু/অযু) করছিলেন। তিনি তাঁর মুখমণ্ডল এবং দু হাত ধুলেন এবং তাঁর মাথা মাসেহ করলেন ও উভয় মোজার উপর মাসেহ করলেন।',
              ref:
                  '',),
        ]),
PorichedModel(
        id: ' পরিচ্ছেদঃ ১৩২।',
        name: ' বিনা উযূতে কুরআন প্রভৃতি পাঠ করা। ',
        hadisNumberList: [
          HadisNumberModel(
              id: ' ',
              name:
                  'وَقَالَ مَنْصُورٌ عَنْ إِبْرَاهِيمَ لاَ بَأْسَ بِالْقِرَاءَةِ فِي الْحَمَّامِ، وَبِكَتْبِ الرِّسَالَةِ عَلَى غَيْرِ وُضُوءٍ. وَقَالَ حَمَّادٌ عَنْ إِبْرَاهِيمَ إِنْ كَانَ عَلَيْهِمْ إِزَارٌ فَسَلِّمْ، وَإِلاَّ فَلاَ تُسَلِّمْমনসূর (রহঃ) ... ইবরাহীম (রহঃ) থেকে বর্ণিতঃ তিনি বলেন, হাম্মামখানায় (কুরআন) পাঠ করা এবং বিনা উযূতে পত্র লেখায় কোন দোষ নেই। হাম্মাদ (রহঃ) ইবরাহীম (রহঃ) থেকে বর্ণনা করেন, হাম্মামখানার লোকদের পরনে ইযার (লুঙ্গি বা পায়জামা) থাকলে সালাম দিও নতুবা সালাম দিও না। ১৮৩। ইসমাইল (রহঃ) .... ‘আবদুল্লাহ ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিতঃ তিনি একবার নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর স্ত্রী মায়মূনা (রাঃ) এর ঘরে রাত কাটান। তিনি ছিলেন ইবনু ‘আব্বাস (রাঃ) এর খালা। ইবনু ‘আব্বাস (রাঃ) বলেনঃ এরপর আমি বিছানার চওড়া দিকে শয়ন করলাম এবং রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও তাঁর স্ত্রী বিছানার লম্বা দিকে শয়ন করলেন; এরপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঘুমিয়ে পড়লেন। এমনিভাবে রাত যখন অর্ধেক হয়ে গেল তার কিছু পূর্বে কিংবা কিছু পরে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জেগে উঠলেন। তিনি বসে হাত দিয়ে তাঁর মুখমণ্ডল থেকে ঘুমের আবেশ মুছতে লাগলেন। তারপর সূরা আলে-‘ইমরানের শেষ দশ আয়াত পাঠ করলেন। এরপর দাঁড়িয়ে একটি ঝুলন্ত মশক থেকে উযূ (ওজু/অজু/অযু) করলেন। তিনি সুন্দরভাবে উযূ করলেন। তারপর সালাতে দাঁড়িয়ে গেলেন। ইবনু ‘আব্বাস (রাঃ) বলেন, আমিও উঠে তিনি যেরূপ করেছিলেন তদ্রুপ করলাম। তারপর গিয়ে তাঁর বাঁ পাশে দাঁড়ালাম। তিনি তাঁর ডান হাত আমার মাথার উপর রাখলেন এবং আমার ডান কান ধরে একটু নাড়া দিলেন (এবং তাঁর), ডান পাশে এনে দাঁড় করালেন। তারপর তিনি দু রাক‘আত সালাত (নামায/নামাজ) আদায় করলেন। তারপর দু রাক‘আত, তারপর দু রাক‘আত, দু রাক‘আত, তারপর দু রাক‘আত, তারপর দু রাক‘আত, তারপর বিতর আদায় করলেন। তারপর শুয়ে পড়লেন। কিছুক্ষণ পর তাঁর কাছে মুয়াযযিন এলেন। এরপর তিনি দাঁড়িয়ে হাল্কাভাবে দু রাক‘আত সালাত আদায় করলেন। তারপর বেরিয়ে গিয়ে ফজরের সালাত আদায় করলেন। ',
              ref:
                  '',),
        ]),
 PorichedModel(
        id: 'পরিচ্ছেদঃ ১৩৩। ',
        name: '  পূর্ণ বেহুশী ছাড়া উযূ না করা',
        hadisNumberList: [
          HadisNumberModel(
              id: ' ১৮৪।',
              name:
                  '  ইসমাইল (রহঃ) ..... আসমা বিনত আবূ বকর (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি একবার নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর স্ত্রী ‘আয়িশা (রাঃ) এর কাছে এলাম। তখন সুর্য গ্রহণ লেগেছিল। দেখলাম সব মানুষ দাঁড়িয়ে সালাত (নামায/নামাজ) আদায় করছে এবং ‘আয়িশা (রাঃ)-ও দাঁড়িয়ে সালাত (নামায/নামাজ) আদায় করছেন। আমি জিজ্ঞাসা করলাম লোকদের কী হয়েছে? তিনি তাঁর হাত দিয়ে আকাশের দিকে ইঙ্গিত করে বললেন, ‘সুবহানাল্লাহ্’! আমি বললাম এটা কি কোন আলামত? তিনি ইশারা করে বললেন, ‘হ্যাঁ’। এরপর আমিও সালাতে দাঁড়িয়ে গেলাম। এমনকি আমাকে সংজ্ঞাহীনতায় আচ্ছন্ন করে ফেলল এবং আমি আমার মাথায় পানি দিতে লাগলাম। তারপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (মুসল্লিদের দিকে) ফিরে আল্লাহর প্রশংসা ও মহিমা বর্ণনা করে বললেন, “যেসব জিনিস আমি ইতিপূর্বে দেখিনি সেসব আমি আমার এই স্থানে আমি দেখতে পেয়েছি, এমনকি জান্নাত এবং জাহান্নামও। আর আমার কাছে ওহী পাঠানো হয়েছে যে, কবরে তোমাদের পরীক্ষা করা হবে দাজ্জালের ফিতনার ন্যায় অথবা তার কাছাকাছি। বর্ণনাকারী বলেন, আসমা (রাঃ) কোনটি বলেছিলেন, আমি জানিনা। তোমাদের প্রত্যেকের কাছে (ফিরিশতা) উপস্থিত হবে এবং তাকে জিজ্ঞাসা করা হবে, “এ ব্যাক্তি সম্পর্কে তোমার কি জ্ঞান আছে?” –তারপর ‘মু’মিন, বা ‘মু’কিন’ ব্যাক্তি বলবে- আসমা ‘মুমিন’ বলেছিলেন না ‘মুকিন’ তা আমি জানিনা- ইনি মুহাম্মদুর রাসূলুল্লাহ। তিনি আমাদের কাছে মু‘জিযা ও হিদায়ত নিয়ে এসেছিলেন। আমরা তাঁর ডাকে সাড়া দিয়েছি, তাঁর প্রতি ঈমান এনেছি এবং তাঁর অনুসরণ করেছি। তারপর তাকে বলা হবে নিশ্চিন্তে ঘুমাও। আমরা জানলাম যে, তুমি মু’মিন ছিলে। আর ‘মুনাফিক’ বা ‘মুরতাব’ বলবে, আমি জানিনা। আসমা এর কোনটি বলেছিলেন তা আমি জানিনা- লোকজনকে এঁর সম্পর্কে কিছু একটা বলতে শুনেছি আর আমিও তা-ই বলেছি।',
              ref:
                  '',),
        ]),
 PorichedModel(
        id: 'পরিচ্ছেদঃ ১৩৪।  ',
        name: ' পূর্ণ মাথা মসেহ করা।',
        hadisNumberList: [
          HadisNumberModel(
              id: ' ',
              name:
                  'لِقَوْلِ اللَّهِ تَعَالَى: (وَامْسَحُوا بِرُءُوسِكُمْ). وَقَالَ ابْنُ الْمُسَيَّبِ الْمَرْأَةُ بِمَنْزِلَةِ الرَّجُلِ تَمْسَحُ عَلَى رَأْسِهَا. وَسُئِلَ مَالِكٌ أَيُجْزِئُ أَنْ يَمْسَحَ بَعْضَ الرَّأْسِ فَاحْتَجَّ بِحَدِيثِ عَبْدِ اللَّهِ بْنِ زَيْدٍ আল্লাহ্‌ তা‘আলার এ বাণীর পরিপ্রেক্ষিতে (وَامْسَحُوا بِرُءُوسِكُمْ) (আর তোমাদের মাথা মসেহ কর) (৫ঃ ৬)। ইবনুল মুসায়্যিব বলেনঃ স্ত্রীলোকও (এ ক্ষেত্রে) পুরুষের সমপর্যায়ে। সে তার মাথা মসেহ করবে। ইমাম মালিক (রহঃ)-কে জিজ্ঞাসা করা হল, মাথার কিছু অংশ মসেহ করা কি যথেষ্ট হবে? তিনি ‘আবদুল্লাহ ইবন যায়দ (রাঃ) এর হাদিস দলীল হেসেবে পেশ করলেন। ১৮৫। আবদুল্লাহ ইবনু ইউসুফ (রহঃ) .... ইয়াহইয়া আল-মাযিনী (রহঃ) থেকে বর্ণিত, এক ব্যাক্তি ‘আবদুল্লাহ ইবনু যায়দ (রাঃ)-কে (তিনি আমর ইবনু ইয়াহিয়ার দাদা) জিজ্ঞাসা করলঃ আপনি কি আমাদেরকে দেখাতে পারেন, কিভাবে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উযূ (ওজু/অজু/অযু) করতেন? ‘আবদুল্লাহ ইবনু যায়দ (রাঃ) বলেনঃ হ্যাঁ। তারপর তিনি পানি আনালেন। হাতের উপর সে পানি ঢেলে দু’বার তাঁর হাত ধুইলেন। তারপর কুলি করলেন এবং তিনবার নাকে পানি দিয়ে ঝেড়ে পরিস্কার করলেন। এরপর চেহারা তিনবার ধুইলেন। তারপর দু’ হাত কনুই পর্যন্ত দু’বার করে ধুইলেন। তারপর দু\' হাত দিয়ে মাথা মাসেহ করলেন। অর্থাৎ হাত দু’টি সামনে ও পিছনে নিলেন। মাথার সম্মুখ ভাগ থেকে শুরু করে উভয় হাত গর্দান পর্যন্ত নিলেন। তারপর আবার যেখান থেকে নিয়েছিলেন, সেখানেই ফিরিয়ে আনলেন। তারপর দু’পা ধুইলেন। ',
              ref:
                  '',),
        ]),
 PorichedModel(
        id: 'পরিচ্ছেদঃ ১৩৫। ',
        name: '  উভয় পা গিরা পর্যন্ত ধোয়া',
        hadisNumberList: [
          HadisNumberModel(
              id: '১৮৬। ',
              name:
                  ' মূসা (রহঃ) .... ‘আমর ইবনু আবূ হাসান (রহঃ) থেকে বর্ণিতঃ তিনি ‘আবদুল্লাহ ইবনু যায়দ (রাঃ)-কে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর উযূ (ওজু/অজু/অযু) সম্পর্কে প্রশ্ন করলেন। তখন তিনি এক পাত্র পানি আনালেন এবং তাঁদের (দেখাবার) জন্য নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর মত উযূ (ওজু/অজু/অযু) করলেন। তিনি পাত্র থেকে দু’হাতে পানি ঢাললেন। তা দিয়ে হাত দুটি তিনবার ধুইলেন। তারপর পাত্রের মধ্যে হাত ঢুকিয়ে তিন আঁজলা পানি দিয়ে কুলি করলেন এবং নাকে পানি দিয়ে নাক ঝাড়লেন। তারপর আবার হাত ঢুকালেন। তিনবার তাঁর চেহারা মুবারক ধুইলেন। তারপর আবার হাত ঢুকিয়ে (পানি নিয়ে) দুই হাত কনুই পর্যন্ত দু’বার ধুইলেন। তারপর আবার হাত ঢুকিয়ে উভয় হাত দিয়ে সামনে এবং পেছনে একবার মাথা মাসেহ করলেন। তারপর দু’ পা গিরা পর্যন্ত ধুইলেন। ',
              ref:
                  '',),
        ]),
 PorichedModel(
        id: ' পরিচ্ছেদঃ ১৩৬।',
        name: ' মানুষের উযূর অবশিষ্ট পানি ব্যবহার করা। ',
        hadisNumberList: [
          HadisNumberModel(
              id: ' ',
              name:
                  'وَأَمَرَ جَرِيرُ بْنُ عَبْدِ اللَّهِ أَهْلَهُ أَنْ يَتَوَضَّئُوا بِفَضْلِ سِوَاكِهِ  জাবির ইবন আবদুল্লাহ (রাঃ) তাঁর পরিবারকে মিসওয়াক ধোয়া অবশিষ্ট পানি দিয়ে উযূ করতে নির্দেশ দেন।  ১৮৭। আদম (রহঃ) ... আবূ জুহায়ফা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, একবার দুপুরে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের সামনে বেরিয়ে এলেন। তাঁকে উযূর পানি এনে দেওয়া হল। তখন তিনি উযূ (ওজু/অজু/অযু) করলেন। লোকে তাঁর উযূর ব্যবহৃত পানি নিয়ে গায়ে মাখতে লাগল। এরপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যোহরের দু’রাকআত সালাত (নামায/নামাজ) আদায় করলেন। আর তাঁর সামনে ছিল একটি লাঠি। আবূ মূসা (রাঃ) বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একটি পাত্র আনালেন যাতে পানি ছিল। তারপর তিনি তার মধ্যে উভয় হাত ও চেহারা মুবারক ধুইলেন এবং তার মধ্যে কুলি করলেন। তারপর তাঁদের দু’জন [আবূ মূসা (রাঃ) ও বিলাল (রাঃ)]-কে বললেন, তোমরা এ থেকে পান কর এবং তোমাদের মুখমণ্ডল ও বুকে ঢাল।',
              ref:
                  '',),
                  HadisNumberModel(
              id: ' ১৮৮।',
              name:
                  '  আলী ইবনু ‘আবদুল্লাহ (রহঃ) .... মাহমুদ ইবনুুর-রবী (রাঃ) থেকে বর্ণিত, বর্ণনাকারী বলেনঃ তিনি সে ব্যাক্তি, যার মুখমণ্ডলে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁদের কুয়া থেকে পানি নিয়ে কুলির পানি দিয়েছিলান। তিনি তখন বালক ছিলেন। ‘উরওয়া (রহঃ) মিসওয়া (রহঃ) প্রমুখের কাছ থেকে হাদীস বর্ণনা করেন। এ উভয় বর্ণনা একটি অন্যটির সত্যায়ন করে। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন উযূ (ওজু/অজু/অযু) করতেন তখন তাঁর ব্যবহৃত পানির উপর তাঁরা (সাহাবায়ে কিরাম) যেন হুমড়ি খেয়ে পড়তেন।',
              ref:
                  '',),
        ]),
 PorichedModel(
        id: 'পরিচ্ছেদঃ ১৩৭। ',
        name: '  পরিচ্ছেদ নাই',
        hadisNumberList: [
          HadisNumberModel(
              id: '১৮৯। ',
              name:
                  '  আবদুর রহমান ইবনু ইউনুস (রহঃ) .... সায়িব ইবনু ইয়াযীদ (রাঃ) বলেনঃ আমার খালা আমাকে নিয়ে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর খিদমতে হাযির হলেন এবং বললেনঃ ‘ইয়া রাসুলাল্লাহ! আমার ভাগ্নে অসুস্থ’। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার মাথায় হাত বুলালেন এবং বরকতের দু‘আ করলেন। তারপর উযূ (ওজু/অজু/অযু) করলেন। আমি তাঁর উযূর (অবশিষ্ট) পানি পান করলাম। তারপর তাঁর পেছনে দাঁড়ালাম। তখন আমি তাঁর উভয় কাঁধের মধ্যস্থলে মোহরে নুবূওয়াত দেখতে পেলাম। তা ছিল নওশার আসনের ঘুন্টির মত।',
              ref:
                  '',),
        ]),
 PorichedModel(
        id: 'পরিচ্ছেদঃ ১৩৮।  ',
        name: ' এক আঁজলা পানি দিয়ে কুলি করা ও নাকে পানি দেওয়া',
        hadisNumberList: [
          HadisNumberModel(
              id: ' ১৯০। ',
              name:
                  ' মূসা’দ্দাদ (রহঃ) .... ‘আবদুল্লাহ ইবনু যায়দ (রাঃ) থেকে বর্ণত, একবার তিনি পাত্র থেকে উভয় হাতে পানি ঢেলে দু’হাত ধৌত করলেন। তারপর এক আঁজলা পানি দিয়ে (মুখ) ধুইলেন বা কুলি করলেন এবং নাকে পানি দিলান। তিনবার এরূপ করলেন। তারপর দু’ হাত কনুই পর্যন্ত দু’-দু’বার ধুইলেন এবং মাথার সামনের অংশ এবং পেছনের অংশ মাসেহ করলেন। আর গিরা পর্যন্ত দু’ পা ধুইলেন। এরপর বললেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর উযূ (ওজু/অজু/অযু) এরূপ ছিল।',
              ref:
                  '',),
        ]),
 PorichedModel(
        id: 'পরিচ্ছেদঃ ১৩৯। ',
        name: '  একবার মাথা মসেহ করা',
        hadisNumberList: [
          HadisNumberModel(
              id: '১৯১।  ',
              name:
                  'সুলায়মান ইবনু হারব (রহঃ) ... ইয়াহইয়া (রহঃ) থেকে বর্ণিত, তিনি বলেন, ‘আমি একবার ‘আমার ইবনু আবূ হাসান (রাঃ) এর কাছে উপস্থিত ছিলাম। তিনি ‘আবদুল্লাহ ইবনু যায়দ (রাঃ)-কে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর উযূ (ওজু/অজু/অযু) সম্পর্কে জিজ্ঞাসা করলেন। তারপর তিনি পানির একটি পাত্র আনালেন এবং উযূ (ওজু/অজু/অযু) করে তাঁদের দেখালেন। তিনি পাত্রটি কাত করে উভয় হাতের উপর পানি ঢেলে তিনবার তা ধুয়ে ফেলেন। তারপর পাত্রের মধ্যে হাত ঢুকালেন এবং তিন আঁজলা পানি দিয়ে তিনবার করে কুলি করলেন এবং নাকে পানি দিয়ে তা ঝেড়ে ফেললেন। তারপর আবার পাত্রের মধ্যে হাত ঢুকালেন (এবং পানি দিয়ে) তিনবার মুখমণ্ডল ধুইলেন। তারপর আবার পাত্রের মধ্যে হাত ঢুকালেন এবং উভয় হাত কনুই পর্যন্ত দু\'-দু\'বার ধুইলেন। তারপর আবার পাত্রের মধ্যে হাত ঢুকালেন। তাঁর মাথা হাত দিয়ে সামনে এবং পেছনে মাসেহ করলেন। তারপর আবার পাত্রের মধ্যে তাঁর হাত ঢুকালেন এবং উভয় পা ধুইলেন। ',
              ref:
                  '',),
                  HadisNumberModel(
              id: '১৯২। ',
              name:
                  ' উহয়র (রহঃ) সুত্রে মূসা (রহঃ) বর্ণনা করেন যে, মাথা একবার মসেহ করেন। ',
              ref:
                  '',),
        ]),
 PorichedModel(
        id: 'পরিচ্ছেদঃ ১৪০।  ',
        name: 'নিজ স্ত্রীর সাথে উযূ করা এবং স্ত্রীর উযূর অবশিষ্ট পানি (ব্যবহার করা)। ',
        hadisNumberList: [
          HadisNumberModel(
              id: ' ',
              name:
                  'وَتَوَضَّأَ عُمَرُ بِالْحَمِيمِ مِنْ بَيْتِ نَصْرَانِيَّةٍ ‘উমর (রাঃ) গরম পানি দিয়ে এবং খৃস্টান মহিলাদের ঘরের পানি দিয়ে উযূ করেন। ১৯৩। আবদুল্লাহ ইবনু ইউসুফ (রহঃ) ..... ইবনু ‘উমর (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর যামানায় পুরুষ এবং মহিলা একত্রে উযূ (ওজু/অজু/অযু) করতেন।',
              ref:
                  '',),
        ]),
  PorichedModel(
        id: ' পরিচ্ছেদঃ ১৪১।',
        name: ' বেহুশ লোকদের ওপর নবী (ﷺ) এর উযূর পানি ছিটিয়ে দেওয়া ',
        hadisNumberList: [
          HadisNumberModel(
              id: '১৯৪।  ',
              name:
                  'আবূল ওলীদ (রহঃ) .... জাবির (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমার পীড়িত অবস্থায় একবার রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার খোঁজ-খবর নিতে এলেন। আমি তখন এতই অসুস্থ ছিলাম যে আমার জ্ঞান ছিল না। তারপর তিনি উযূ (ওজু/অজু/অযু) করলেন এবং তাঁর উযূর পানি আমার ওপর ছিটিয়ে দিলেন। তখন আমার জ্ঞান ফিরে এল। আমি বললাম, ইয়া রাসূলাল্লাহ! (আমার) ‘মীরাস’ কে পাবে? আমার একমাত্র ওয়ারিস হল কালালা (অর্থ পিতামাতা ও সন্তান-সন্ততি ছাড়া অন্যেরা)। তখন ফারায়েযের আয়াত নাযিল হল। ',
              ref:
                  '',),
        ]),
  PorichedModel(
        id: ' পরিচ্ছেদঃ ১৪২।',
        name: ' গামলা, কাঠ ও পাথরের পাত্রে উযূ-গোসল করা ',
        hadisNumberList: [
          HadisNumberModel(
              id: '১৯৫। ',
              name:
                  ' আবদুল্লাহ ইবনু মুনীর (রহঃ) ... আনাস (রাঃ) থেকে বর্ণিত, তিনি বলেন, একবার সালাত (নামায/নামাজ)-এর সময় উপস্থিত হলে যাঁদের বাড়ী নিকটে ছিল তাঁরা (উযূ করার জন্য) বাড়ী চলে গেলেন। আর কিছু লোক রয়ে গেলেন (তাঁদের কোন উযূর ব্যবস্থা ছিল না)। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর জন্য একটি পাথরের পাত্রে পানি আনা হল। পাত্রটি এত ছোট ছিল যে, তার মধ্যে তাঁর উভয় হাত মেলে দেওয়া সম্ভব ছিল না। তা থেকেই কওমের সকল লোক উযূ (ওজু/অজু/অযু) করলেন। আমরা জিজ্ঞাসা করলাম, আপনারা কতজন ছিলেন? তিনি বললেন, আশিজন বা আরো বেশী। ',
              ref:
                  '',),
                  HadisNumberModel(
              id: '১৯৬। ',
              name:
                  ' মুহাম্মদ ইবনুল ‘আলা (রহঃ) .... আবূ মূসা (রাঃ) থেকে বর্ণনা করেন যে, একবার রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একটি পানি ভর্তি পাত্র আনালেন। তাতে তাঁর উভয় হাত ও মুখমণ্ডল ধুইলেন এবং কুলি করলেন। ',
              ref:
                  '',),
                  HadisNumberModel(
              id: ' ১৯৭।',
              name:
                  ' আহমদ ইবনু ইউনুস (রহঃ) .... আবদুল্লাহ ইবনু যায়দ (রাঃ) বলেন, একবার রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের বাড়ীতে এলেন। আমরা তাঁকে পিতলের একটি পাত্রে পানি দিলাম। তিনি তা দিয়ে উযূ (ওজু/অজু/অযু) করলেন। তাঁর মুখমণ্ডল তিনবার ও উভয় হাত দু’ দু’বার করে ধুইলেন এবং তাঁর হাত সামনে ও পেছনে এনে মাথা মাসেহ করলেন আর উভয় পা ধুইলেন। ',
              ref:
                  '',),
                  HadisNumberModel(
              id: '১৯৮। ',
              name:
                  ' আবূল ইয়ামান (রহঃ) .... ‘আয়িশা (রাঃ) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর রোগ যন্ত্রণা বেড়ে গেলে তিনি আমার ঘরে শুশ্রূষার জন্য তাঁর পত্নীগনের অনুমতি চাইলেন। তাঁরা অনুমতি দিলে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (আমার ঘরে আসার জন্য) দু’ব্যাক্তির ওপর ভর করে বের হলেন। আর তাঁর পা দু’খানি তখন মাটিতে চিহ্ন রেখে যাচ্ছিল। তিনি ‘আব্বাস (রাঃ) ও অন্য এক ব্যাক্তির মাঝখানে ছিলেন। ‘উবায়দুল্লাহ (রহঃ) বলেন, আমি ‘আবদুল্লাহ ইবনু ‘আব্বাস (রাঃ)-কে এ কথা অবহিত করলাম। তিনি বললেন, সে অন্য ব্যাক্তিটি কে তা কি তুমি জানো? আমি বললাম, না। তিনি বললেন, তিনি হলেন ‘আলী ইবনু আবূ তালিব (রাঃ)। ‘আয়িশা (রাঃ) বর্ণনা করেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর ঘরে আসার পর রোগ আরো বেড়ে গেলে তিনি বললেন, তোমরা আমার উপর মুখের বাঁধন খোলা হয়নি এমন সাতটি মশকের পানি ঢেলে দাও, তাহলে হয়ত আমি মানুষকে কিছু ওয়াসিয়্যাত করব। তাঁকে তাঁর সহধর্মিণী হাফসা (রাঃ) এর একটি বড় পাত্রের মধ্যে বসিয়ে দেওয়া হল। তারপর আমরা তাঁর ওপর সেই সাত মশক পানি ঢালতে শুরু করলাম। এভাবে ঢালার পর এক সময় তিনি আমাদের প্রতি ইশারা করলেন, (এখন থাম) তোমরা তোমাদের কাজ করেছ। এরপর তিনি বের হয়ে জনসমক্ষে গেলেন। ',
              ref:
                  '',),
        ]),
  PorichedModel(
        id: ' পরিচ্ছেদঃ ১৪৩।',
        name: ' গামলা থেকে উযূ করা ',
        hadisNumberList: [
          HadisNumberModel(
              id: ' ১৯৯।',
              name:
                  ' খালিদ ইবনু মাখলাদ (রহঃ) .... ইয়াহইয়া (রহঃ) বলেন, আমার চাচা উযূর পানি বেশী খরচ করতেন। একদিন তিনি ‘আবদুল্লাহ ইবনু যায়দ (রাঃ)-কে বললেন, ‘আপনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে কিভাবে উযূ (ওজু/অজু/অযু) করতে দেখেছেন? তিনি এক গামলা পানি আনালেন। সেটি উভয় হাতের ওপর কাত করে (তা থেকে পানি ঢেলে) হাত দু’খানি তিনবার ধুইলেন, তারপর তাঁর হাত গামলায় ঢুকালেন। তারপর এক আঁজলা পানি দিয়ে তিনবার কুলি করলেন এবং নাক পরিষ্কার করলেন। তারপর পানিতে তাঁর হাত ঢুকালেন। উভয় হাতে এক আঁজলা পানি নিয়ে মুখমণ্ডল তিনবার ধুইলেন। তারপর উভয় হাত কনুই পর্যন্ত দু’বার করে ধুইলেন। তারপর উভয় হাতে পানি নিয়ে মাথার সামনে এবং পেছনে মাসেহ করলেন এবং দু’পা ধুইলেন। তারপর বললেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে এভাবেই উযূ (ওজু/অজু/অযু) করতে দেখেছি। ',
              ref:
                  '',),
                  HadisNumberModel(
              id: '২০০। ',
              name:
                  ' মূসা’দ্দাদ (রহঃ) .... আনাস (রাঃ) থেকে বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একপাত্র পানি চাইলেন। একটি বড় পাত্র তাঁর কাছে আনা হল, তাতে সামান্য পানি ছিল। তারপর তিনি তার মধ্যে তাঁর আঙ্গুল রাখলেন। আনাস (রাঃ) বলেন, আমি পানির দিকে তাকাতে লাগলাম। তাঁর আঙ্গুলের ভেতর দিয়ে পানি উথলে উঠতে লাগল। আনাস (রাঃ) বলেন, যারা উযূ (ওজু/অজু/অযু) করেছিল, আমি অনুমান করলাম তাদের সংখ্যা ছিল ৭০ থেকে ৮০ জন। ',
              ref:
                  '',),
        ]),
  PorichedModel(
        id: 'পরিচ্ছেদঃ ১৪৪। ',
        name: ' এক মুদ (পানি) দিয়ে উযূ করা ',
        hadisNumberList: [
          HadisNumberModel(
              id: ' ২০১।',
              name:
                  ' আবূ নু’আয়ম (রহঃ) ... আনাস (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক সা’ (৪ মুদ*) থেকে পাঁচ মুদ পর্যন্ত পানি দিয়ে গোসল করতেন এবং উযূ (ওজু/অজু/অযু) করতেন এক মুদ দিয়ে। চার মুদ = ১ সা, প্রায় ৮৩০ গ্রাম। ',
              ref:
                  '',),
        ]),
 PorichedModel(
        id: ' পরিচ্ছেদঃ ১৪৫।',
        name: '  উভয় মোজার ওপর মসেহ করা',
        hadisNumberList: [
          HadisNumberModel(
              id: ' ২০২।',
              name:
                  ' আসবাগ ইবনুল ফারাজ (রহঃ) ... সা’দ ইবনু আবূ ওয়াক্কাস (রাঃ) থেকে বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর উভয় মোজার ওপর মাসেহ করেছেন। ‘আবদুল্লাহ ইবনু উমর (তার পিতা) উমর (রাঃ)-কে এ ব্যাপারে জিজ্ঞাসা করলে তিনি বললেনঃ হ্যাঁ! সা’দ (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে কিছু বর্ণনা করলে সে ব্যাপারে আর অন্যকে জিজ্ঞাসা করো না। মুসা ইবন উকবা (রহঃ) ... সা\'দ (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ অতঃপর উমর (রাঃ) আবদুল্লাহ (রাঃ) কে অনুরূপ বললেন। ',
              ref:
                  '',),
                   HadisNumberModel(
              id: '২০৩।  ',
              name:
                  ' আমর ইবনু খালিদ আল-হাররানী (রহঃ) .... মুগীরা ইবনু শু’বা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ একবার রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম প্রাকৃতিক প্রয়োজনে বাইরে গেলে মুগীরা (রাঃ) পানি সহ একটি পাত্র নিয়ে তাঁর অনুসরণ করলেন। তারপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম প্রাকৃতিক প্রয়োজন শেষ করে এলে মুগীরা (রাঃ) তাঁকে পানি ঢেলে দিলেন। আর তিনি উযূ (ওজু/অজু/অযু) করলেন এবং উভয় মোজার উপর মাসেহ করলেন।',
              ref:
                  '',),
                   HadisNumberModel(
              id: '২০৪। ',
              name:
                  ' আবূ নু’আয়ম (রহঃ) ... উমায়্যা যামরী (রাঃ) থেকে বর্ণনা করেন, তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে উভয় মোজার ওপর মাসেহ করতে দেখেছেন। হারব ও আবান (রহঃ) ইয়াহ্ইয়া (রহঃ) থেকে অনুরূপ বর্ণনা করেছেন। ',
              ref:
                  '',),
                   HadisNumberModel(
              id: '২০৫। ',
              name:
                  '  আবদান (রহঃ) .... উমায়্যা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে তাঁর পাগড়ীর ওপর এবং উভয় মোজার ওপর মাসেহ করতে দেখেছি। মা’মার (রহঃ) আমর (রহঃ) থেকে অনুরূপ বর্ণনা করেনঃ আমি রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে তা করতে দেখেছি।',
              ref:
                  '',),
        ]),
 PorichedModel(
        id: ' পরিচ্ছেদঃ ১৪৬।',
        name: '  পবিত্র অবস্থায় উভয় পা (মোজায়) প্রবেশ করানো',
        hadisNumberList: [
          HadisNumberModel(
              id: '২০৬। ',
              name:
                  '  আবূ নু’আয়ম (রহঃ) ... মুগীরা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে এক সফরে ছিলাম। (উযূ (ওজু/অজু/অযু) করার সময়) আমি তাঁর মোজাদ্বয় খুলতে চাইলে তিনি বললেনঃ ওদুটো থাকুক, আমি পবিত্র অবস্থায় ও দু’টি পরেছিলাম। (এই বলে) তিনি তার ওপর মাসেহ করলেন।',
              ref:
                  '',),
        ]),
  PorichedModel(
        id: ' পরিচ্ছেদঃ ১৪৭।',
        name: '  বকরীর গোশত এবং ছাতু খেয়ে উযূ না করা।',
        hadisNumberList: [
          HadisNumberModel(
              id: ' ',
              name:
                  ' وَأَكَلَ أَبُو بَكْرٍ وَعُمَرُ وَعُثْمَانُ رَضِيَ اللَّهُ عَنْهُمْ لَحْمًا فَلَمْ يَتَوَضَّئُوا আবু বকর, উমর ও উসমান (রাঃ) গোশত খেয়ে উযূ করেন নি। ২০৭। আবদুল্লাহ ইবনু ইউসুফ (রহঃ) .... আবদুল্লাহ ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ একবার রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বকরীর কাঁধের গোশত খেলেন। তারপর সালাত (নামায/নামাজ) আদায় করলেন; কিন্তু উযূ (ওজু/অজু/অযু) করলেন না।',
              ref:
                  '',),
                  HadisNumberModel(
              id: ' ২০৮।',
              name:
                  ' ইয়াহ্ইয়া ইবনু বুকায়র (রহঃ) .... উমায়্যা (রাঃ) থেকে বর্ণিত, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে একটি ববরীর কাঁধের গোশত কেটে খেতে দেখলেন। এ সময় সালাত (নামায/নামাজ)-এর জন্য ডাকা হল। তখন তিনি ছুরি ফেলে দিয়ে সালাত (নামায/নামাজ) আদায় করলেন; কিন্তু উযূ (ওজু/অজু/অযু) করলেন না। ',
              ref:
                  '',),
        ]),
  PorichedModel(
        id: ' পরিচ্ছেদঃ ১৪৮।',
        name: '  ছাতু খেয়ে উযূ না করে কেবল কুলি করা',
        hadisNumberList: [
          HadisNumberModel(
              id: '২০৯।  ',
              name:
                  'আবদুল্লাহ ইবনু ইউসুফ (রহঃ) .... সুওযায়দ ইবনুু\'ন-নু\'মান (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ খায়বর যুদ্ধের বছর তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে রওয়ানা হলেন। চলতে চলতে তাঁরা যখন সাহবা-য় পৌঁছলেন, এটি খায়বরের নিবটবর্তী অঞ্চল, তখন তিনি আসরের সালাত (নামায/নামাজ) আদায় করলেন। তারপর খাবার আনতে বললেনঃ কিন্তু ছাতু ছাড়া আর কিছুই আনা হল না। তারপর তিনি নির্দেশ দেওয়ায় তা (পানিতে) মেশানো হল। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তা খেলেন এবং আমরাও খেলাম। তারপর তিনি মাগরিবের জন্য দাঁড়িয়ে কুলি করলেন এবং আমরাও কুলি করলাম। পরে তিনি সালাত আদায় করলেন; উযূ (ওজু/অজু/অযু) করলেন না। ',
              ref:
                  '',),
                  HadisNumberModel(
              id: '২১০।  ',
              name:
                  ' আসবাগ (রহঃ) .... মায়মূনা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ একবার রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর কাছে (একটি বকরীর) কাঁধের গোশত খেলেন, তারপর সালাত (নামায/নামাজ) আদায় করলেন, আর উযূ (ওজু/অজু/অযু) করলেন না।',
              ref:
                  '',),
                  
        ]),
  PorichedModel(
        id: ' পরিচ্ছেদঃ ১৪৯',
        name: '  দুধ পান করলে কি কুলি করতে হবে?',
        hadisNumberList: [
          HadisNumberModel(
              id: '২১১। ',
              name:
                  '  ইয়াহ্ইয়া ইবনু বুকায়র ও কুতায়বা (রহঃ) .... ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিত, একবার রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দুধ পান করলেন। তারপর কুলি করলেন এবং বললেনঃ এতে তৈলাক্ত পদার্থ রয়েছে (এজন্য কুলি করা ভাল)। ইউসুন ও সালিহ ইবনু কায়সান (রহঃ) যুহরী (রহঃ) থেকে অনুরূপ বর্ণনা করেছেন।',
              ref:
                  '',),
        ]),
  PorichedModel(
        id: ' পরিচ্ছেদঃ ১৫০। ',
        name: 'ঘুমের পরে উযূ করা এবং দু’একবার ঝিমালে বা মাথা ঝুঁকে পড়লে উযূ না করা ',
        hadisNumberList: [
          HadisNumberModel(
              id: '২১২। ',
              name:
                  '  আবদুল্লাহ ইবনু ইউসুফ (রহঃ) .... ‘আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ সালাত (নামায/নামাজ) আদায়ের অবস্থায় তোমাদের কারো যদি তন্দ্রা আসে তবে সে যেন ঘুমের রেশ কেটে না যাওয়া পর্যন্ত ঘুমিয়ে নেয়। কারন, তন্দ্রাবস্থায় সালাত (নামায/নামাজ) আদায় করলে সে জানতে পারবে না, সে কি ক্ষমা চাইছে, না নিজেকে গালি দিচ্ছে।',
              ref:
                  '',),
                   HadisNumberModel(
              id: ' ২১৩।',
              name:
                  ' আবূ মা’মার (রহঃ) .... আনাস (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কেউ যদি সালাতে ঝিমায়, সে যেন ততক্ষণ ঘুমিয়ে নেয়, যতক্ষন না সে কি পড়ছে, তা বুঝতে পারে। ',
              ref:
                  '',),
        ]),
  PorichedModel(
        id: ' পরিচ্ছেদঃ ১৫১।',
        name: ' হাদস ছাড়া উযূ করা ',
        hadisNumberList: [
          HadisNumberModel(
              id: ' ২১৪। ',
              name:
                  'মুহাম্মদ ইবনু ইউসুফ (রহঃ) ও মূসা’দ্দাদ (রহঃ) ... আনাস (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম প্রত্যেক সালাতের সময় উযূ (ওজু/অজু/অযু) করতেন। আমি বললামঃ আপনারা কিরূপ করতেন? তিনি বললেনঃ হাদস (উযূ ভঙ্গের কারন) না হওয়া পর্যন্ত আমাদের (পূর্বের) উযূই যথেষ্ট হত। ',
              ref:
                  '',),
                  HadisNumberModel(
              id: ' ২১৫।',
              name:
                  ' খালিদ ইবনু মাখলাদ (রহঃ) ... সুওয়ায়দ ইবনুু’ন-নু‘মান (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ খায়বার যুদ্ধের বছর আমরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে বের হলাম। সাহবা নামক স্থানে পৌঁছে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের নিয়ে আসরের সালাত (নামায/নামাজ) আদায় করলেন। সালাত শেষে তিনি খাবার আনতে বললেন। ছাতু ছাড়া আর কিছু আনা হল না। আমরা তা খেলাম এবং পান করলাম। তারপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মাগরিবের জন্য দাঁড়িয়ে কুলি করলেন; তিনি (নতুন) উযূ (ওজু/অজু/অযু) করলেন না। ',
              ref:
                  '',),
        ]),
  PorichedModel(
        id: 'পরিচ্ছেদঃ ১৫২। ',
        name: '  পেশাবের অপবিত্রতা থেকে সতর্ক না থাকা কবীরা গুনাহ',
        hadisNumberList: [
          HadisNumberModel(
              id: '২১৬।  ',
              name:
                  ' উসমান (রহঃ) ... ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একবার মদিনা বা মক্কার কোন এক বাগানের কাছ দিয়ে যাচ্ছিলেন। তিনি এমন দু’ব্যাক্তির আওয়াজ পেলেন, যাদের কবরে আযাব হচ্ছিল। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ এদের দু’জনকে আযাব দেওয়া হচ্ছে, অথচ কোন বড় গুনাহের জন্য এদের আযাব দেওয়া হচ্ছে না। তারপর তিনি বললেনঃ হ্যাঁ, এদের একজন তার পেশাবের নাপাকি থেকে সতর্কতা অবলম্বন করত না। আর একজন চোগলখুরী করত। তারপর তিনি একটি খেজুরের ডাল আনালেন এবং তা ভেঙ্গে দু’খন্ড করে প্রত্যেকের কবরের উপর একখন্ড রাখলেন। তাঁকে জিজ্ঞাসা করা হল, ‘ইয়া রাসুলাল্লাহ! এরূপ কেন করলেন?’ তিনি বললেনঃ হয়ত তাদের আযাব কিছুটা লাঘব করা হবে, যতদিন পর্যন্ত এ দু’টি না শুকায়। প্রাসঙ্গিক আলোচনা হাদীসে উল্লিখিত ব্যক্তিদেরকে কবরে আযাব দেওয়ার যে কারণ, তা ত্যাগ করা তাদের ওপর কঠিন ছিল না। বস্তুত কেউ যদি অন্যায় থেকে বাঁচার চেষ্টা করে আল্লাহ তাকে সাহায্য করেন। কিন্তু অধিকাংশ মানুষ চেষ্টা করে না। জীবিত মানুষের যেসব আমল মৃতদের কাজে লাগে সর্বসম্মত মতে, জীবিত মানুষের পক্ষ থেকে দো\'আ ঈমানদার মৃত মানুষের কাজে লাগে। এখানে রাসূলুল্লাহ সাল্লাল্লাহু \'আলাইহি ওয়াসাল্লাম যা করেছেন তা দো\'আর সমতুল্য। সুতরাং সেটা কাজে লাগবে। কিন্তু অন্য কারো জন্য এ ধরনের গাছ ভেঙ্গে দেয়ার ব্যাপারটি কোথাও বর্ণিত হয়নি। সুতরাং, বর্তমানে কারো জন্য গাছ ভেঙ্গে রোপন করলে সেটা কার্যকরী হবে বলা যায় না। রাসূলুল্লাহ সাল্লাল্লাহু \'আলাইহি ওয়াসাল্লামের উক্ত কাজটি তার সাথে বিশেষভাবে সংশ্লিষ্ট, অন্য কারো সাথে তা কার্যকারী হওয়ার প্রমাণ নেই। কারণ, এ হাদীসেরই অপর বর্ণনায় যা সহীহ মুসলিমে এসেছে, “আমার সুপারিশের কারণে আল্লাহ তাদের শাস্তি গাছের ডালটি শুষ্ক হওয়া পর্যন্ত লাঘব করবেন।” [সহীহ মুসলিম ৩০০৬] ইমাম খাত্তাবী রাহিমাহুল্লাহ বলেন, এটা এর উপর ধরা হবে যে, রাসূলুল্লাহ সাল্লাল্লাহু \'আলাইহি ওয়াসাল্লাম এ দুই কবরবাসীর ‘আযাব লাঘবের জন্য দো\'আ করেছেন; যতক্ষণ তা তরতাজা থাকবে। এটা নয় যে, আযাব বন্ধ করার ব্যাপারে গাছের ডালে এমন কোনো বৈশিষ্ট্য রয়েছে বা কাঁচা ডালে কোনো বৈশিষ্ট্য রয়েছে যা শুকনো ডালে নেই। [আউনুল মাবুদ (১/২৫)] অথচ আফসোসের বিষয় হচ্ছে, অনেক মুসলিমকে দেখা যায় তারা কবরের উপর ফুল দিচ্ছে, যা কখনও জয়েয নেই, প্রথমত: এটাতো নাসারাদের কাজ। দ্বিতীয়ত: যদি এ হাদীস দলীল হয় তবে এ হাদীস তো প্রমাণ করছে যে, এখানে মৃতব্যক্তির আযাব হচ্ছে, তারা যেখানে ফুল দিচ্ছে কিংবা খেজুর ডাল পুঁতে দিচ্ছে তাদের কাছে কি এসব কবরে আযাব হওয়ার বিষয়টির সংবাদ এসেছে? হাদীসের শিক্ষা ১. কবরের আযাব হক্ব ও যথার্থ। ২. আরো বুঝা যায় যে, চোগলখুরী বা একের কথা অন্যের কাছে লাগানো হারাম ও কবীরা গুনাহ। এর মাধ্যমে স্বার্থ হাসিল করা আরো বড় হারাম। ৩. চোগলখুরী ও পেশাব থেকে পবিত্র না হওয়া কবর আযাবের অন্যতম কারণ। ৪. আল্লাহ তা\'আলা কখনও কখনও মানুষের জন্য নবী সাল্লাল্লাহু \'আলাইহি ওয়াসাল্লামের কোনো নিদর্শন প্রকাশ করে দেন; যাতে মানুষ তা থেকে শিক্ষা গ্রহণ করতে পারে। ৫. সালাতের বিষয়টি অত্যধিক মহৎ হওয়া; কারণ এর একটি শর্ত বাস্তবায়ন না হওয়ায় বান্দার ওপর শাস্তি হচ্ছে। যারা সালাত ত্যাগ করে তাদের পরিণতি কত ভয়াবহ হতে পারে তা থেকেই অনুমেয়। ৬. উম্মতের প্রতি নবী সাল্লাল্লাহু \'আলাইহি ওয়াসাল্লামের ভালোবাসা; এমনকি তাদের মধ্যে যারা গুনাহগার তাদের নাজাতের জন্যও রাসূলুল্লাহ সাল্লাল্লাহু \'আলাইহি ওয়াসাল্লাম ঐকান্তিক প্রচেষ্টা চালাতেন। ৭. নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সুপারিশ কখনও কখনও কিছু সময়ের জন্য বা বড় কষ্ট থেকে ছোট কষ্টে নিয়ে যাওয়ার জন্য হতে পারে; কারণ রাসূলুল্লাহ্ সাল্লাল্লাহ "আলাইহি ওয়াসাল্লাম বলেছেন, \'আশা করা যায় যতক্ষণ এ দু\'টি ডাল শুষ্ক না হলে ততক্ষণ তাদের ওপর সে আযাব হালকা করা হবে। ৮. সাহাবায়ে কেরাম সর্বদা রাসুলুল্লাহ সাল্লাল্লাহু \'আলাইহি ওয়াসাল্লামের কাজের কারণ ও হিকমত জানতে সচেষ্ট থাকতেন। এজন্য তারা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে জিজ্ঞেস করলেন, হে আল্লাহর রাসূল আপনি এ কাজটি কেন করলেন? ৯. সাধারণ অপরাধী ও গুনাহগারদের অপমান না করে তাদেরকে গোপন করা জরুরী। কারণ রাসুলুল্লাহ সাল্লাল্লাহু \'আলাইহি ওয়াসাল্লাম এ দু\'জনের নাম বর্ণনা করেননি।',
              ref:
                  '',),
        ]),
  PorichedModel(
        id: ' পরিচ্ছেদঃ ১৫৩।',
        name: '  পেশাব ধোয়া সম্বন্ধে যা বর্ণিত হয়েছে।',
        hadisNumberList: [
          HadisNumberModel(
              id: ' ',
              name:
                  ' وَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِصَاحِبِ الْقَبْرِ: كَانَ لاَ يَسْتَتِرُ مِنْ بَوْلِهِ». وَلَمْ يَذْكُرْ سِوَى بَوْلِ النَّاسِ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জনৈক কবরবাসী সম্পর্কে বলেছে, সে তার পেশাব থেকে সতর্ক থাকত না। তিনি শুধু মানুষের পেশাব সম্পর্কেই উল্লেখ করেছেন। ২১৭। ইয়া’কুব ইবনু ইবরাহীম (রহঃ) .... আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম প্রাকৃতিক প্রয়োজনে বের হলে আমি তাঁর কাছে পানি নিয়ে যেতাম। তিনি তা দিয়ে ইসতিন্জা করতেন।',
              ref:
                  '',),
        ]),
  PorichedModel(
        id: ' পরিচ্ছেদঃ ১৫৪।',
        name: ' পরিচ্ছেদ নাই। ',
        hadisNumberList: [
          HadisNumberModel(
              id: ' ',
              name:
                  '২১৮। মুহাম্মদ ইবনুল মূসান্না (রহঃ) .... ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একবার দু’টি কররের কাছ দিয়ে যাচ্ছিলেন। এ সময় তিনি বললেনঃ এদের আযাব দেওয়া হচ্ছে, কোন কঠিন পাপের জন্য তাদের আযাব হচ্ছে না। তাদের একজন পেশাব থেকে সতর্ক থাকত না। আর অপরজন চোগলখুরী করে বেড়াত। তারপর তিনি একখানি কাঁচা খেজুরের ডাল নিয়ে ভেঙ্গে দু’ভাগ করলেন এবং প্রত্যেক কবরের ওপর একখানি পুঁতে দিলেন। সাহাবায়ে কিরাম (রাঃ) জিজ্ঞাসা করলেন, ‘ইয়া রাসূলাল্লাহ! এরূপ কেন করলেন?’ তিনি বললেনঃ হয়তো তাদের থেকে (আযাব) কিছুটা লাঘব করা হবে, যতদিন পর্যন্ত এ’টি না শুকাবে। ইবনুল মূসান্না (রহঃ)-আ’মাশ (রহঃ) বলেনঃ আমি মুজাহিদ (রহঃ) থেকে অনুরূপ শুনেছি। প্রাসঙ্গিক আলোচনা হাদীসে উল্লিখিত ব্যক্তিদেরকে কবরে আযাব দেওয়ার যে কারণ, তা ত্যাগ করা তাদের ওপর কঠিন ছিল না। বস্তুত কেউ যদি অন্যায় থেকে বাঁচার চেষ্টা করে আল্লাহ তাকে সাহায্য করেন। কিন্তু অধিকাংশ মানুষ চেষ্টা করে না। জীবিত মানুষের যেসব আমল মৃতদের কাজে লাগে সর্বসম্মত মতে, জীবিত মানুষের পক্ষ থেকে দো\'আ ঈমানদার মৃত মানুষের কাজে লাগে। এখানে রাসূলুল্লাহ সাল্লাল্লাহু \'আলাইহি ওয়াসাল্লাম যা করেছেন তা দো\'আর সমতুল্য। সুতরাং সেটা কাজে লাগবে। কিন্তু অন্য কারো জন্য এ ধরনের গাছ ভেঙ্গে দেয়ার ব্যাপারটি কোথাও বর্ণিত হয়নি। সুতরাং, বর্তমানে কারো জন্য গাছ ভেঙ্গে রোপন করলে সেটা কার্যকরী হবে বলা যায় না। রাসূলুল্লাহ সাল্লাল্লাহু \'আলাইহি ওয়াসাল্লামের উক্ত কাজটি তার সাথে বিশেষভাবে সংশ্লিষ্ট, অন্য কারো সাথে তা কার্যকারী হওয়ার প্রমাণ নেই। কারণ, এ হাদীসেরই অপর বর্ণনায় যা সহীহ মুসলিমে এসেছে, “আমার সুপারিশের কারণে আল্লাহ তাদের শাস্তি গাছের ডালটি শুষ্ক হওয়া পর্যন্ত লাঘব করবেন।” [সহীহ মুসলিম ৩০০৬] ইমাম খাত্তাবী রাহিমাহুল্লাহ বলেন, এটা এর উপর ধরা হবে যে, রাসূলুল্লাহ সাল্লাল্লাহু \'আলাইহি ওয়াসাল্লাম এ দুই কবরবাসীর ‘আযাব লাঘবের জন্য দো\'আ করেছেন; যতক্ষণ তা তরতাজা থাকবে। এটা নয় যে, আযাব বন্ধ করার ব্যাপারে গাছের ডালে এমন কোনো বৈশিষ্ট্য রয়েছে বা কাঁচা ডালে কোনো বৈশিষ্ট্য রয়েছে যা শুকনো ডালে নেই। [আউনুল মাবুদ (১/২৫)] অথচ আফসোসের বিষয় হচ্ছে, অনেক মুসলিমকে দেখা যায় তারা কবরের উপর ফুল দিচ্ছে, যা কখনও জয়েয নেই, প্রথমত: এটাতো নাসারাদের কাজ। দ্বিতীয়ত: যদি এ হাদীস দলীল হয় তবে এ হাদীস তো প্রমাণ করছে যে, এখানে মৃতব্যক্তির আযাব হচ্ছে, তারা যেখানে ফুল দিচ্ছে কিংবা খেজুর ডাল পুঁতে দিচ্ছে তাদের কাছে কি এসব কবরে আযাব হওয়ার বিষয়টির সংবাদ এসেছে? হাদীসের শিক্ষা ১. কবরের আযাব হক্ব ও যথার্থ। ২. আরো বুঝা যায় যে, চোগলখুরী বা একের কথা অন্যের কাছে লাগানো হারাম ও কবীরা গুনাহ। এর মাধ্যমে স্বার্থ হাসিল করা আরো বড় হারাম। ৩. চোগলখুরী ও পেশাব থেকে পবিত্র না হওয়া কবর আযাবের অন্যতম কারণ। ৪. আল্লাহ তা\'আলা কখনও কখনও মানুষের জন্য নবী সাল্লাল্লাহু \'আলাইহি ওয়াসাল্লামের কোনো নিদর্শন প্রকাশ করে দেন; যাতে মানুষ তা থেকে শিক্ষা গ্রহণ করতে পারে। ৫. সালাতের বিষয়টি অত্যধিক মহৎ হওয়া; কারণ এর একটি শর্ত বাস্তবায়ন না হওয়ায় বান্দার ওপর শাস্তি হচ্ছে। যারা সালাত ত্যাগ করে তাদের পরিণতি কত ভয়াবহ হতে পারে তা থেকেই অনুমেয়। ৬. উম্মতের প্রতি নবী সাল্লাল্লাহু \'আলাইহি ওয়াসাল্লামের ভালোবাসা; এমনকি তাদের মধ্যে যারা গুনাহগার তাদের নাজাতের জন্যও রাসূলুল্লাহ সাল্লাল্লাহু \'আলাইহি ওয়াসাল্লাম ঐকান্তিক প্রচেষ্টা চালাতেন। ৭. নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সুপারিশ কখনও কখনও কিছু সময়ের জন্য বা বড় কষ্ট থেকে ছোট কষ্টে নিয়ে যাওয়ার জন্য হতে পারে; কারণ রাসূলুল্লাহ্ সাল্লাল্লাহ "আলাইহি ওয়াসাল্লাম বলেছেন, \'আশা করা যায় যতক্ষণ এ দু \'টি ডাল শুষ্ক না হলে ততক্ষণ তাদের ওপর সে আযাব হালকা করা হবে। ৮. সাহাবায়ে কেরাম সর্বদা রাসুলুল্লাহ সাল্লাল্লাহু \'আলাইহি ওয়াসাল্লামের কাজের কারণ ও হিকমত জানতে সচেষ্ট থাকতেন। এজন্য তারা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে জিজ্ঞেস করলেন, হে আল্লাহর রাসূল আপনি এ কাজটি কেন করলেন? ৯. সাধারণ অপরাধী ও গুনাহগারদের অপমান না করে তাদেরকে গোপন করা জরুরী। কারণ রাসুলুল্লাহ সাল্লাল্লাহু \'আলাইহি ওয়াসাল্লাম এ দু\'জনের নাম বর্ণনা করেননি। ',
              ref:
                  '',),
        ]),
  PorichedModel(
        id: ' পরিচ্ছেদঃ ১৫৫। ',
        name: 'এক বেদুঈনকে মসজিদে পেশাব শেষ করা পর্যন্ত নবী (ﷺ) এবং অন্যান্য লোকের পক্ষ থেকে অবকাশ দেওয়া। ',
        hadisNumberList: [
          HadisNumberModel(
              id: ' ২১৯।',
              name:
                  ' মূসা ইবনু ইসমা’ঈল (রহঃ) .... আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক বেদুঈনকে মসজিদে পেশাব করতে দেখলেন। তখন তিনি বললেনঃ ওকে ছেড়ে দাও। সে পেশাব শেষ করলে পানি আনিয়ে সেখানে পানি ঢেলে দিলেন। ',
              ref:
                  '',),
        ]),
  PorichedModel(
        id: ' পরিচ্ছেদঃ ১৫৬।',
        name: ' মসজিদে পেশাবের উপর পানি ঢেলে দেওয়া ',
        hadisNumberList: [
          HadisNumberModel(
              id: '২২০। ',
              name:
                  '  আবূল ইয়ামান (রহঃ) .... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ এক বেদুঈন দাঁড়িয়ে মসজিদে পেশাব করে দিল। তখন লোকজন তাকে বাধা দিতে যাচ্ছিল। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের বললেনঃ ওকে ছেড়ে দাও এবং ওর পেশাবের উপর এক বালতি পানি ঢেলে দাও। কারন তোমাদের সহজ ও বিনম্র আচরণ করার জন্য পাঠানো হয়েছে, কঠোর আচরণের জন্য পাঠানো হয়নি।',
              ref:
                  '',),
                  HadisNumberModel(
              id: '২২১। ',
              name:
                  ' আবদান (রহঃ) ও খালিদ ইবনু মাখলাদ (রহঃ) ... আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ একবার এক বেদুঈন এসে মসজিদের এক কোণে পেশাব করে দিল। তা দেখে লোকজন তাকে ধমকাতে লাগল। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের নিষেধ করলেন। তার পেশাব শেষ হলে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর আদেশে এর উপর এক বালতি পানি ঢেলে দেওয়া হল। ',
              ref:
                  '',),
        ]),
  PorichedModel(
        id: 'পরিচ্ছেদঃ ১৫৭। ',
        name: ' শিশুদের পেশাব ',
        hadisNumberList: [
          HadisNumberModel(
              id: '২২২। ',
              name:
                  '  আবদুল্লাহ ইবনু ইউসুফ (রহঃ) ... উম্মুল মু’মিনীন আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে একটি শিশুকে আনা হল। শিশুটি তাঁর কাপড়ে পেশাব করে দিল। তিনি পানি আনালেন এবং এর ওপর ঢেলে দিলেন।',
              ref:
                  '',),
                  HadisNumberModel(
              id: ' ২২৩। ',
              name:
                  'আবদুল্লাহ ইবনু ইউসুফ (রহঃ) .... উম্মু কায়স বিনত মিহসান (রাঃ) থেকে বর্ণিত যে, তিনি তার এক ছোট ছেলেকে, যে তখনো খাবার খেতে শিখেনি, নিয়ে রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এলেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম শিশুটিকে তাঁর কোলে বসালেন। তখন সে তাঁর কাপড়ে পেশাব করে দিল। তিনি পানি আনিয়ে এর উপর ছিটিয়ে দিলেন এবং তা (ভাল করে) ধুইলেন না। ',
              ref:
                  '',),
        ]),
  PorichedModel(
        id: ' পরিচ্ছেদঃ ১৫৮।',
        name: '  দাঁড়িয়ে এবং বসে পেশাব করা',
        hadisNumberList: [
          HadisNumberModel(
              id: ' ',
              name:
                  ' ২২৪। আদম (রহঃ) ... হুযায়ফা (রাঃ) থেকে বর্ণিত, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একবার কওমের আবর্জনা ফেলার স্থানে এলেন। তিনি সেখানে দাঁড়িয়ে পেশাব করলেন। তারপর পানি চাইলেন। আমি তাঁকে পানি নিয়ে দিলাম। তিনি উযূ (ওজু/অজু/অযু) করলেন।* * সাধারণত বসে পেশাব করাই ছিল রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর অভ্যাস। আ জন্যই আয়েশা (রাঃ) বলেন, যে ব্যাক্তি তোমাদের বলবে যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দাঁড়িয়ে পেশাব করেছেন- তার কথা বিশ্বাস করো না। (তিরমিযি, নাসাঈ)। এই একটি মাত্র স্থানেই তাঁর অভ্যাসের ব্যাতিক্রম পাওয়া যায়।এর কারণ সম্পর্কে আবু হুরাইরা (রাঃ) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কোমর ব্যাথার কারণে দাঁড়িয়ে পেশাব করেছেন। (বায়হাকি, হাকেম )।',
              ref:
                  '',),
        ]),
  PorichedModel(
        id: 'পরিচ্ছেদঃ ১৫৯। ',
        name: '  সঙ্গীর কাছে বসে পেশাব করা এবং দেয়ালের আড়ালে করা',
        hadisNumberList: [
          HadisNumberModel(
              id: '২২৫। ',
              name:
                  '  উসমান ইবনু আবূ শায়বা (রহঃ) .... হুযায়ফা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমার স্মরণ আছে যে, একবার আমিও নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক সাথে চলছিলাম। তিনি দেয়ালের পেছনে মহল্লার একটি আবর্জনা ফেলার জায়গায় এলেন। তারপর তোমাদের কেউ যেভাবে দাঁড়ায় সেভাবে দাঁড়িয়ে তিনি পেশাব করলেন। এ সময় আমি তাঁর কাছ থেকে সরে যাচ্ছিলাম কিন্তু তিনি আমাকে ইশারা করলেন। আমি এসে তাঁর পেশাব করা শেষ না হওয়া পর্যন্ত তাঁর পিছনে দাঁড়িয়ে থাকলাম।',
              ref:
                  '',),
        ]),
  PorichedModel(
        id: 'পরিচ্ছেদঃ ১৬০। ',
        name: '  মহল্লার আবর্জনা ফেলার স্থানে পেশাব করা',
        hadisNumberList: [
          HadisNumberModel(
              id: '২২৬। ',
              name:
                  ' মুহাম্মদ ইবনু ‘আর ‘আরা (রহঃ) .... আবূ ওয়াইল (রহঃ) থেকে বর্ণিত, তিনি বলেনঃ আবূ মূসা (রাঃ) পেশাবের ব্যাপারে খুব কড়াকড়ি করতেন এবং বলতেনঃ বনী ইসরাঈলের কারো কাপড়ে (পেশাব) লাগলে তা কেটে ফেলত। হুযায়ফা (রাঃ) বললেন, আবূ মূসা (রাঃ) যদি এ থেকে বিরত থাকতেন (তবে ভাল হত)। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মহল্লার আবর্জনা ফেলার স্থানে দাঁড়িয়ে পেশাব করেছেন। ',
              ref:
                  '',),
        ]),
  PorichedModel(
        id: 'পরিচ্ছেদঃ ১৬১।  ',
        name: 'রক্ত দুয়ে ফেলা। ',
        hadisNumberList: [
          HadisNumberModel(
              id: ' ২২৭।',
              name:
                  '  মুহাম্মদ ইবনুল মূসান্না (রহঃ) ..... আসমা (রাঃ) থেকে বর্ণিত, তিনি বলেন, এক মহিলা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এসে বললেনঃ ইয়া রাসূলাল্লাহ! বলুন, আমাদের কারো কাপড়ে হায়েযের রক্ত লেগে গেলে সে কি করবে? তিনি বললেনঃ সে তা ঘষে ফেলবে, তারপর পানি দিয়ে রগড়াবে এবং ভাল করে ধুয়ে ফেলবে। এরপর সেই কাপড়ে সালাত (নামায/নামাজ) আদায় করবে।',
              ref:
                  '',),
                  HadisNumberModel(
              id: '২২৮।  ',
              name:
                  'মুহাম্মদ (রহঃ) .... আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ ফাতিমা বিনত আবূ হুবায়শ (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এসে বললেন ইয়া রাসূলাল্লাহ! আমার এত বেশি রক্তস্রাব হয় যে, আর পবিত্র হই না। এমতাবস্থায় আমি কি সালাত (নামায/নামাজ) ছেড়ে দেব? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ না, এ তো ধমনি নির্গত রক্ত, হায়েয় নয়। তাই যখন তোমার হায়েয আসবে তখন সালাত ছেড়ে দিও। আর যখন তা বন্ধ হবে তখন রক্ত ধুয়ে ফেলবে, তারপর সালাত আদায় করবে। বর্ণনাকারী বলেন, আমার পিতা বলেছেনঃ তারপর এভাবে আরেক হায়েয না আসা পর্যন্ত প্রত্যেক সালাতের জন্য উযূ (ওজু/অজু/অযু) করবে। ',
              ref:
                  '',),
        ]),
  PorichedModel(
        id: ' পরিচ্ছেদঃ ১৬২।',
        name: '  বীর্য ধোয়া এবং ঘষে ফেলা এবং স্ত্রীলোক থেকে যা লেগে যায় তা ধুয়ে ফেলা',
        hadisNumberList: [
          HadisNumberModel(
              id: '২২৯। ',
              name:
                  ' আবদান (রহঃ) .... ‘আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাপড় থেকে জানবাতের চিহ্ন ধুয়ে দিতাম এবং কাপড়ে ভিজা চিহ্ন নিয়ে তিনি সালাতে (নামাযে) বের হতেন। ',
              ref:
                  '',),
                  HadisNumberModel(
              id: '২৩০।  ',
              name:
                  ' কুতয়বা ও মূসা’দ্দাদ (রহঃ) .... সুলায়মান ইবনু ইয়াসর (রহঃ) থেকে বর্ণিত, আমি ‘আয়িশা (রাঃ)-কে কাপড়ে লাগা বীর্য সম্পর্কে জিজ্ঞাসা করলাম। তিনি বললেনঃ আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাপড় থেকে তা ধুয়ে ফেলতাম। তিনি কাপড় ধোয়ার ভিজা দাগ নিয়ে সালাতে (নামাযে) বের হতেন।',
              ref:
                  '',),
        ]),
 PorichedModel(
        id: 'পরিচ্ছেদঃ ১৬৩। ',
        name: ' জানাবাতের নাপাকী বা অন্য কিছু ধোয়ার পর যদি ভিজা দাগ থেকে যায় ',
        hadisNumberList: [
          HadisNumberModel(
              id: '২৩১। ',
              name:
                  ' মূসা ইবনু ইসমা’ঈল (রহঃ) ...... আমর ইবনু মায়মুন (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ কাপড়ে জানবাতের নাপাকী লাগা সম্পর্কে আমি সুলায়মান ইবনু ইয়াসার (রহঃ)-কে জিজ্ঞাসা করলে তিনি বললেনঃ ‘আয়িশা (রাঃ) বলেছেনঃ আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাপড় থেকে তা ধুয়ে ফেলতাম। এরপর তিনি সালাতে (নামাযে) বেরিয়ে যেতেন আর তাতে পানি দিয়ে ধোয়ার চিহ্ন থাকত। ',
              ref:
                  '',),
                  HadisNumberModel(
              id: ' ২৩২।',
              name:
                  ' আমর ইবনু খালিদ (রহঃ) ... আয়িশা (রাঃ) থেকে বর্ণিত, তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাপড় থেকে বীর্য ধুয়ে ফেলতেন। আয়িশা (রাঃ) বলেনঃ তারপর আমি তাতে পানির একটি বা কয়েকটি দাগ দেখতে পেতাম। ',
              ref:
                  '',),
        ]),
  PorichedModel(
        id: 'পরিচ্ছেদঃ ১৬৪।  ',
        name: ' উট, চতুস্পদ জন্তু ও বকরীর পেশাব এবং বকরীর খায়াড় প্রসঙ্গে',
        hadisNumberList: [
          HadisNumberModel(
              id: '২৩৩। ',
              name:
                  '  সুলায়মান ইবনু হারব (রহঃ) ... আনাস (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ উকল বা উরায়না গোত্রের কিছু লোক (ইসলাম গ্রহণের জন্য) মদিনায় এলে তারা পীড়িত হয়ে পড়ল। রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের (সদকার) উটের কাছে যাবার এবং ওর পেশাব ও দুধ পান করার নির্দেশ দিলেন। তারা সেখানে চলে গেল। তারপর তারা সুস্থ হয়ে রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর রাখালকে হত্যা করে ফেলল এবং উটগুলি হাঁকিয়ে নিয়ে গেল। এ খবর দিনের প্রথম ভাগেই এসে পৌঁছল। তিনি তাদের পেছনে লোক পাঠালেন। বেলা বেড়ে উঠলে তাদেরকে (গ্রেফতার করে) আনা হল। তারপর তাঁর আদেশে তাদের হাত পা কেটে দেওয়া হল। উত্তপ্ত শলাকা দিয়ে তাদের চোখ ফুঁড়ে দেওয়া হল এবং গরম পাথুরে ভূমিতে তাদের নিক্ষেপ করা হল। তারা পানি চাইছিল, কিন্তু দেওয়া হয়নি। আবূ কিলাবা (রহঃ) বলেন, এরা চুরি করেছিল, হত্যা করেছিল, ঈমান আনার পর কুফরী করেছিল এবং আল্লাহ্ ও তার রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর বিরুদ্ধে যুদ্ধ করেছিল।',
              ref:
                  '',),
                  HadisNumberModel(
              id: ' ২৩৪। ',
              name:
                  'আদম (রহঃ .... আনাস (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মসজিদ নির্মিত হবার পূর্বে বকরীর খোয়াড়ে সালাত (নামায/নামাজ) আদায় করতেন। ',
              ref:
                  '',),
        ]),
  PorichedModel(
        id: ' পরিচ্ছেদঃ ১৬৫।',
        name: '  ঘি এবং পানিতে নাপাকী পড়া।',
        hadisNumberList: [
          HadisNumberModel(
              id: ' ',
              name:
                  'وَقَالَ الزُّهْرِيُّ لاَ بَأْسَ بِالْمَاءِ مَا لَمْ يُغَيِّرْهُ طَعْمٌ أَوْ رِيحٌ أَوْ لَوْنٌ. وَقَالَ حَمَّادٌ لاَ بَأْسَ بِرِيشِ الْمَيْتَةِ. وَقَالَ الزُّهْرِيُّ فِي عِظَامِ الْمَوْتَى نَحْوَ الْفِيلِ وَغَيْرِهِ أَدْرَكْتُ نَاسًا مِنْ سَلَفِ الْعُلَمَاءِ يَمْتَشِطُونَ بِهَا، وَيَدَّهِنُونَ فِيهَا، لاَ يَرَوْنَ بِهِ بَأْسًا. وَقَالَ ابْنُ سِيرِينَ وَإِبْرَاهِيمُ وَلاَ بَأْسَ بِتِجَارَةِ الْعَاجِ যুহরী (রহঃ) বলেনঃ পানিতে নাপাকী পড়লে কোন ক্ষতি নেই, যতক্ষন তার স্বাদ, গন্ধ বা রং পরিবর্তন না হয়। হাম্মদ (রহঃ) বলেনঃ মৃত (পাখীর) পালক (পানিতে পড়লে) কোন দোষ নেই। যুহরী (রহঃ) মৃত জন্তু, যথাঃ হাতী প্রভৃতির হাড় সম্পর্কে বলেনঃ আমি পূর্ববর্তী উলামায়ে কিরামের মধ্যে কিছু আলিমকে পেয়েছি, তাঁরা তা দিয়ে (চিরুণী বানিয়ে) চুল আঁচড়াতেন এবং তার পাত্রে তেল রেখে ব্যবহার করতেন, এতে তাঁরা কোনরূপ দোষ মনে করতেন না। ইবন সীরীন (রহঃ) ও ইবরাহীম (রহঃ) বলেনঃ হাতীর দাঁতের ব্যবসায়ে কোন দোষ নেই। ২৩৫। ইসমা‘ঈল (রহঃ) .... মায়মূনা (রাঃ) থেকে বর্ণিত, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে ‘ঘি’র মধ্যে ইঁদুর পড়া সম্পর্কে জিজ্ঞাসা করা হল। তিনি বললেনঃ ইঁদুরটি এবং তার আশপাশ থেকে ফেলে দাও এবং তোমাদের ঘি ব্যবহার কর।',
              ref:
                  '',),
                  HadisNumberModel(
              id: '২৩৬। ',
              name:
                  ' আলী ইবনু ‘আবদুল্লাহ (রহঃ) .... মায়মূনা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে ‘ঘি’র মধ্যে ইঁদুর পড়ে যাওয়া সম্পর্কে জিজ্ঞাসা করা হল। তিনি বললেনঃ ইঁদুরটি এবং তার আশপাশ থেকে ফেলে দাও। মা’ন (রহঃ) বলেন, মালিক (রহঃ) আমার কাছে বহুবার এভাবে বর্ণনা করেছেনঃ ইবনু ‘আব্বাস (রাঃ) থেকে এবং ইবনু ‘আব্বাস (রাঃ) মায়মূনা (রাঃ) থেকেও। ',
              ref:
                  '',),
                   HadisNumberModel(
              id: '২৩৭। ',
              name:
                  ' আহমদ ইবনু মুহাম্মদ (রহঃ) ... আবূ হুরায়রা (রাঃ) রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণনা করেন, তিনি বলেনঃ আল্লাহর রাস্তায় মুসলিমদের যে যখম হয়, কিয়ামতের দিন তার প্রতিটি যখম আঘাতকালীন সময়ে যে অবস্থায় ছিল তদ্রুপ হবে। রক্ত ছুটে বের হতে থাকবে। তার রং হবে রক্তের রং কিন্তু গন্ধ হবে মিশকের ন্যায়। ',
              ref:
                  '',),
        ]),
 PorichedModel(
        id: ' পরিচ্ছেদঃ ১৬৬।',
        name: ' স্থির পানিতে পেশাব করা ',
        hadisNumberList: [
          HadisNumberModel(
              id: '২৩৮।  ',
              name:
                  'আবূল ইয়ামান (রহঃ) ... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছেন যে, আমরা শেষে আগমনকারী এবং (কিয়ামত দিবসে) অগ্রগামী। এ সনদেই তিনি বলেনঃ তোমাদের কেউ যেন স্থির- যা প্রবাহিত নয় এমন পানিতে কখনো পেশাব না করে। (সম্ভবত) পরে সে আবার তাতে গোসল করবে। প্রাসঙ্গিক আলোচনা পানি ও তার প্রকারভেদ যা প্রবাহমান নয় এমন পানি হলো, টাঙ্কির পানি, ছোট জলাধারের পানি ইত্যাদি। রাসূলুল্লাহ সাল্লাল্লাহু \'আলাইহি ওয়াসাল্লাম এগুলোতে ময়লা ফেলতে নিষেধ করেছেন যাতে করে তা দূষিত হয়ে না পড়ে। কারণ, এর মাধ্যমে ভাইরাস ছড়িয়ে পড়তে পারে। মারাত্মক রোগ ব্যাধির প্রাদুর্ভাব ঘটতে পারে। মানুষের মধ্যে এ জাতীয় পানি ব্যবহারে ঘৃণার জন্ম হতে পারে। পানি বিশুদ্ধ ও পরিচ্ছন্ন রাখা, নষ্ট ও দূষিত না করা ঈমানের দাবি। পানি তিন প্রকার ১. পবিত্র পানিঃ আর তা হলো পানি তার সৃষ্টিগত স্বাভাবিক অবস্থায় বিদ্যমান থাকা। আর তা হলো- যে পানি দ্বারা অপবিত্রতা ও শরীরের পবিত্র অঙ্গের আপতিত নাজাসাত দূর করা হয়েছে। আল্লাহ তাআলা বলেছেন, “এবং আকাশ থেকে তোমাদের উপর বৃষ্টি বর্ষণ করেন, আর যাতে এর মাধ্যমে তিনি তোমাদেরকে পবিত্র করেন।” [সূরা আল ১১] ২. পবিত্র পানিঃ যে পানি নাজাসাত ছাড়াই রঙ বা স্বাদ বা গন্ধ পরিবর্তন হয়ে গেছে। এ ধরনের পানি নিজে পবিত্র; তবে এর যে কোনো একটি গুণ পরিবর্তন হওয়ার কারণে এর দ্বারা অপবিত্রতা দূর করা যাবে না। ৩. অপবিত্র পানি: যে পানি অল্প বা বেশি নাজাসাতের কারণে এর ৩টি গুণের যেকোনো একটি গুণ পরিবর্তন হয়ে গেছে। অপবিত্র পানি পবিত্র হয়ে যাবে, তার পরিবর্তনের কারণ নিজে নিজে দূর হলে বা উক্ত পানি শুকিয়ে ফেললে অথবা এর সাথে এতটুকু পরিমাণ পানি মিশানো; যাতে পরিবর্তনের কারণ দূরীভূত হয়ে যায়। যখন কোনো মুসলিম পানির অপবিত্রতা বা পবিত্রতার ব্যাপারে সন্দেহ পোষণ করবে তখন সে তার নিশ্চিত ধারণার ওপর ভিত্তি করে পবিত্রতা অর্জন করবে। আর তা হলো, পবিত্র বস্তুসমূহের আসল হচ্ছে পবিত্র থাকা। যখন কোনো পানি, যা দ্বারা পবিত্রতা অর্জন করা যায় আর যা দ্বারা পবিত্রতা অর্জন করা যায় না এমন কোন পানির সাথে সন্দেহে নিপতিত করবে তখন তা বাদ দিয়ে তায়াম্মুম করবে। যখন কোনো পবিত্র কাপড়, অপবিত্র বা হারাম কাপড়ের সাথে একাকার হওয়ার কারণে সন্দেহে নিপতিত করবে, তখন ইয়াকীনের ওপর ভিত্তি করবে এবং সে কাপড় দ্বারা কেবল একটি সালাত আদায় করবে। হাদিস থেকে শিক্ষা ১. বদ্ধ পানিতে পেশাব করা হারাম, পায়খানা করা আরো বড় হারাম। ২. এ নিষেধাজ্ঞা দ্বারা কি হারাম বুঝানো হয়েছে নাকি মাকরূহে তাহরীমী বুঝানো হয়েছে এ ব্যাপারে দু\'টি মত রয়েছে: মালেকীরা বলেন, তা মাকরূহ, আর হাম্বলী ও যাহেরীরা বলেন, তা হারাম বুঝাবে। কোনো কোনো আলেম বলেন, অল্প পানির জন্য তা হারাম, আর বেশি পানির জন্য তা মাকরূহ। তবে হারাম হওয়াই অধিক যুক্তিযুক্ত। ৩. যদি পানিতে পেশাব করা হয় তবে তা কি নাপাক হয়ে যাবে? এ ব্যাপারে সবাই একমত যে, যদি পেশাব দ্বারা সে পানি পরিবর্তিত হয়ে যায় তবে তা অপবিত্র হয়ে যাবে। পানি কম হোক কিংবা বেশি। আর যদি পানি এত বেশি হয় যে, তাতে পেশাব তেমন পরিবর্তন করতে পারেনি, তবে সকলের ঐকমত্যে তা পবিত্র। কিন্তু যদি অল্প পানি থাকে আর তা পেশাব বা পায়খানা দ্বারা পরিবর্তন না করে থাকে, তবে এ ব্যাপারে দু\'টি মত রয়েছে- ইমাম মালিক, বুখারী ও দাউদ এর মতে তা পবিত্র থেকে যাবে। অন্য দিকে ইমাম আবু হানীফা, শাফোয়ী, আহমাদের মতে তা অপবিত্র হয়ে যাবে। যদিও ইমাম মালিকের মতটি অনেক সত্যনিষ্ঠ আলেম, যেমন শাইখুল ইসলাম ইবন তাইমিয়্যাহ প্রমুখের মতে বেশি শক্তিশালী। ৪. এ হাদীস থেকে আরো বুঝা যায় যে, অপবিত্র অবস্থা থেকে মুক্ত হওয়ার জন্য বদ্ধ পানি অর্থাৎ টাঙ্কি বা পানির ছোট হাউজে ডুব দিয়ে গোসল করা একেবারেই নিষেধ; যদিও তাতে পেশাব না করা হয়। নিয়ম হচ্ছে সেখান থেকে হাত বা কোনো কিছু দিয়ে পানি নিয়ে পবিত্র হওয়া। ৫. সর্বাবস্থায় কষ্টদায়ক যাবতীয় কাজ ও সীমালঙ্ঘনকারী কোনো কিছু করা নিষেধ হওয়া। ',
              ref:
                  '',),
        ]),
 PorichedModel(
        id: 'পরিচ্ছেদঃ ১৬৭।  ',
        name: ' মুসল্লীর পিঠের উপর ময়লা বা মৃত জন্তু ফেললে তার সালাত নষ্ট হবে না।',
        hadisNumberList: [
          HadisNumberModel(
              id: ' ',
              name:
                  'ইবন উমর (রাঃ) সালাত আদায়ের অবস্থায় তাঁর কাপড়ে রক্ত দেখলে (সেভাবেই) তা রেখে দিতেন এবং সালাত আদায় করে নিতেন। ইবনুল মুসায়্যাব ও শা’বী (রহঃ) বলেন, যখন কেউ সালাত আদায় করে আর তার কাপড়ে রক্ত অথবা জানাবাতের নাপাকী থাকে অথবা সে কিবলা ছাড়া অন্যদিকে মুখ করে অথবা তায়াম্মুম করে সালাত আদায় করে এরপর ওয়াক্তের মধ্যেই যদি পানি পেয়ে যায় তবে (সালাত) দুহরাবে না। ২৩৯। আবদান (রহঃ) ..... আবদুল্লাহ ইবনু মাস’উদ (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ একবার রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সিজদারত অবস্থায় ছিলেন। অন্য সূত্রে আহমদ ইবনু ‘উসমান (রহঃ) ‘আবদুল্লাহ ইবনু মাস্’উদ (রাঃ) বর্ণনা করেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একবার বায়তুল্লাহর পাশে সালাত (নামায/নামাজ) আদায় করছিলেন এবং সেখানে আবূ জাহল ও তার সঙ্গীরা বসা ছিল। এমন সময় তাদের একজন অন্যজনকে বলে উঠল, তোমাদের মধ্যে কে অমুক গোত্রের উটনীর নাড়ীভুঁড়ি এনে মুহাম্মদ যখন সিজদা করেন তখন তার পিঠের উপর রাখতে পারে? তখন কওমের বড় পাষন্ড (উকবা) তাড়াতাড়ি গিয়ে তা নিয়ে এল এবং তাঁর প্রতি নজর রাখল। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন সিজদায় গেলেন, তখন সে তাঁর পিঠের উপর দুই কাঁধের মাঝখানে তা রেখে দিল। ইবনু মাস’উদ (রাঃ) বলেন, আমি (এ দৃশ্য) দেখেছিলাম কিন্তু আমার কিছু করার ছিল না। হায়! আমার যদি কিছু প্রতিরোধ শক্তি থাকত! তিনি বলেন, তারা হাসতে লাগল এবং একে অন্যের উপর লুটিয়ে পড়তে লাগল। আর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তখন সিজদায় থাকলেন, মাথা উঠালেন না। অবশেষে ফাতিমা (রাঃ) এলেন এবং সেটি তাঁর পিঠের উপর থেকে ফেলে দিলেন। তারপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মাথা উঠিয়ে বললেনঃ ইয়া আল্লাহ্! আপনি কুরায়শকে ধ্বংস করুন। এরূপ তিনবার বললেন। তিনি যখন তাদের বদ দু’আ করেন তখন তা তাদের অন্তরে ভীতির সঞ্চার করল। বর্ণনাকারী বলেন, তারা জনত যে, এ শহরে দু’আ কবূল হয়। এরপর তিনি নাম ধরে বললেনঃ ইয়া আল্লাহ্! আবূ জাহলকে ধ্বংস করুন। এবং ‘উতবা ইবনু রাবী’আ, শায়বা ইবনু রবী’আ, ওয়ালীদ ইবনু ‘উতবা, উময়্যা ইবনু খালাফ ও ‘উকবা ইবনু মু’আইতকে ধ্বংস করুন। রাবী বলেন, তিনি সপ্তম ব্যাক্তির নামও বলেছিলেন কিন্তু তিনি স্মরণ রাখতে পারেন নি। ইবনু মাস’উদ (রাঃ) বলেনঃ সেই সত্তার কসম! যার হাতে আমার জান, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যাদের নাম উচ্চারণ করেছিলেন, তাদের আমি বদরের কূপের মধ্যে নিহত অবস্থায় পড়ে থাকতে দেখেছি। ',
              ref:
                  '',),
        ]),
 PorichedModel(
        id: ' পরিচ্ছেদঃ ১৬৮।',
        name: '  থুথু, শ্লেষ্মা ইত্যাদি কাপড়ে লেগে গেলে।',
        hadisNumberList: [
          HadisNumberModel(
              id: ' ',
              name:
                  'قَالَ عُرْوَةُ عَنِ الْمِسْوَرِ وَمَرْوَانَ خَرَجَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَمَنَ حُدَيْبِيَةَ فَذَكَرَ الْحَدِيثَ. وَمَا تَنَخَّمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نُخَامَةً إِلاَّ وَقَعَتْ فِي كَفِّ رَجُلٍ مِنْهُمْ فَدَلَكَ بِهَا وَجْهَهُ وَجِلْدَهُ উরওয়া (রহঃ) মিসওয়ার ও মাওয়ান (রহঃ) থেকে বর্ণনা করেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হুদায়বিয়ার সময় বের হলেন। তারপর পূর্ণ হাদীস বর্ণনা করার পর তিনি বলেন, আর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (সেদিন) যখনই কোন শ্লেষ্মা ঝেড়ে ফেলছিলেন, তখন তা কারো না কারো হাতে পড়ছিল। তারপর (বরকতস্বরূপ) ঐ ব্যক্তি তা তার মুখমন্ডল ও শরীরে মেখে নিচ্ছিল। ২৪০। মুহাম্মদ ইবনু ইউসুফ (রহঃ) ... আনাস (রাঃ) থেকে বর্ণিত, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একবার তাঁর কাপড়ে থুথু ফেললেন। ইমাম বুখারী (রহঃ) বলেন যে, ইবনু মারয়াম এই হাদীসটি বিস্তারিতরূপে বর্ণনা করেছেন। ',
              ref:
                  '',),
        ]),
 PorichedModel(
        id: ' পরিচ্ছেদঃ ১৬৯।',
        name: ' নাবীয (খেজুর, কিসমিস, মনাক্কা ইত্যাদি ভিজানো পানি) এবং নেশাকারক পানীয় দ্বারা উযূ করা না-জায়েয।  ',
        hadisNumberList: [
          HadisNumberModel(
              id: ' ',
              name:
                  'كَرِهَهُ الْحَسَنُ وَأَبُو الْعَالِيَةِ. وَقَالَ عَطَاءٌ التَّيَمُّمُ أَحَبُّ إِلَيَّ مِنَ الْوُضُوءِ بِالنَّبِيذِ وَاللَّبَنِ হাসান (রহঃ) ও আবুল ‘আলিয়া (রহঃ) একে মাকরূহ বলেছেন। আতা (রহঃ) বলেনঃ নবীয এবং দুধ দিয়ে উযূ করার চাইতে তায়াম্মুম করাই আমার কাছে পছন্দনীয়। ২৪১। আলী ইবনু ‘আবদুল্লাহ (রহঃ) .... ‘আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে সকল পানীয় নেশা সৃষ্টি করে, তা হারাম। ',
              ref:
                  '',),
        ]),
 PorichedModel(
        id: 'পরিচ্ছেদঃ ১৭০। ',
        name: '  পিতার মুখমন্ডল থেকে কন্যা কর্তৃক রক্ত ধুয়ে ফেলা।',
        hadisNumberList: [
          HadisNumberModel(
              id: ' ',
              name:
                  'وَقَالَ أَبُو الْعَالِيَةِ امْسَحُوا عَلَى رِجْلِي فَإِنَّهَا مَرِيضَةٌ আবুল আলিয়া (রহঃ) বলেনঃ আমার পায়ে ব্যাথা, তোমরা আমার পা মসেহ করে দাও। ২৪২। মুহাম্মদ (রহঃ) .... আবূ হাযিম (রহঃ) বলেন, যখন আমার এবং সাহল ইবনু সা’দ আস-সা’ইদী (রাঃ)-এর মাঝখানে কেউ ছিল না, তখন লোকে প্রশ্ন করলঃ (উহুদ যুদ্ধে) কী দিয়ে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর যখমের চিকিৎসা করা হয়েছিল? তখন তিনি বললেনঃ এ ব্যাপারে আমার চেয়ে ভাল একজন জানে এমন কেউ জীবিত নেই। ‘আলী (রাঃ) তাঁর ঢালে করে পানি আনছিলেন আর ফাতিমা (রাঃ) তাঁর মুখমন্ডল থেকে রক্ত ধুইয়ে দিলেন। অবশেষে চাটাই পুড়িয়ে (তার ছাই) তাঁর ক্ষতস্থানে দেওয়া হল। ',
              ref:
                  '',),
        ]),
 PorichedModel(
        id: ' পরিচ্ছেদঃ ১৭১।',
        name: '  মিসওয়াক করা।',
        hadisNumberList: [
          HadisNumberModel(
              id: ' ',
              name:
                  'وَقَالَ ابْنُ عَبَّاسٍ بِتُّ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاسْتَنَّ ইবন আব্বাস (রাঃ) বলেনঃ আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের কাছে রাত কাটিয়েছিলাম। তখন তিনি মিসওয়াক করলেন। ২৪৩। আবূ’ন-নু’মান (রহঃ) .... আবূ বুরদা (রহঃ)-এর পিতা [আবূ মূসা (রাঃ)] থেকে বর্ণিত, তিনি বলেনঃ একবার আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এলাম। তখন তাঁকে দেখলাম তিনি মিসওয়াক করছেন এবং মিসওয়াক মুখে দিয়ে তিনি উ’, উ’, শব্দ করছেন যেন তিনি বমি করছেন। ',
              ref:
                  '',),
               HadisNumberModel(
              id: '২৪৪। ',
              name:
                  ' উসমান ইবনু আবূ শায়বা (রহঃ) ... হুযায়ফা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন রাতে (সালাত (নামায/নামাজ)-এর জন্য) উঠতেন তখন মিসওয়াক দিয়ে মুখ পরিষ্কার করতেন। ',
              ref:
                  '',),   
        ]),
PorichedModel(
        id: 'পরিচ্ছেদঃ ১৭৩। ',
        name: '  উযূ সহ রাতে ঘুমাবার ফযীলত',
        hadisNumberList: [
          HadisNumberModel(
              id: ' ',
              name:
                  ' وَقَالَ عَفَّانُ حَدَّثَنَا صَخْرُ بْنُ جُوَيْرِيَةَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ "‏ أَرَانِي أَتَسَوَّكُ بِسِوَاكٍ، فَجَاءَنِي رَجُلاَنِ أَحَدُهُمَا أَكْبَرُ مِنَ الآخَرِ، فَنَاوَلْتُ السِّوَاكَ الأَصْغَرَ مِنْهُمَا، فَقِيلَ لِي كَبِّرْ‏.‏ فَدَفَعْتُهُ إِلَى الأَكْبَرِ مِنْهُمَا ‏"‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ اخْتَصَرَهُ نُعَيْمٌ عَنِ ابْنِ الْمُبَارَكِ عَنْ أُسَامَةَ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ পরিচ্ছেদঃ ১৭২. বয়সে বড় ব্যক্তিকে মিসওয়াক প্রদান করা ‘আফফান (রহঃ) .... ইবন ‘উমর (রাঃ) থেকে বর্ণনা করেন যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আমি (স্বপ্নে) দেখলাম যে, আমি মিসওযাক করছি। আমার কাছে দুই ব্যক্তি এলেন। একজন অপরজন থেকে বয়সে বড়। তারপর আমি তাদের মধ্যে কনিষ্ঠ ব্যক্তিকে মিসওয়াক দিতে গেলাম। তখন আমাকে বলা হল, ‘বড়কে দাও। তখন আমি তাদের মধ্যে বয়সে বড় ব্যক্তিকে দিলাম। আবূ আবদুল্লাহ্ বলেন, নু’আয়ম, ইবনুল মুবারক সূত্রে ইবন ‘উমর (রাঃ) থেকে হাদীসটি সংক্ষেপে বর্ণনা করেছেন। ২৪৫। মুহাম্মদ ইবনু মুকতিল (রহঃ) .... বারা ইবনু ‘আযিব (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যখন তুমি বিছানায় যাবে তখন সালাত (নামায/নামাজ)-এর উযূর মতো উযূ (ওজু/অজু/অযু) করে নেবে। তারপর ডান পার্শ্বে শুয়ে বলবেঃ اللَّهُمَّ أَسْلَمْتُ وَجْهِي إِلَيْكَ وَفَوَّضْتُ أَمْرِي إِلَيْكَ وَأَلْجَأْتُ ظَهْرِي إِلَيْكَ رَغْبَةً وَرَهْبَةً إِلَيْكَ لاَ مَلْجَأَ وَلاَ مَنْجَا مِنْكَ إِلاَّ إِلَيْكَ اللَّهُمَّ آمَنْتُ بِكِتَابِكَ الَّذِي أَنْزَلْتَ “হে আল্লাহ্! আমার জীবন আপনার কাছে সমর্পণ করলাম। আমার সকল কাজ আপনার কাছে সোপর্দ করলাম এবং আমি আপনার আশ্রয় গ্রহণ করলাম, আপনার প্রতি আগ্রহ ও ভয় নিয়ে। আপনি ছাড়া কোন আশ্রয়স্থল ও নাজাতের স্থান নেই। হে আল্লাহ্! আমি ঈমান আনলাম আপনার নাযিলকৃত কিতাবের উপর এবং আপনার প্রেরিত নবীর উপর।” তারপর যদি সে রাতেই তোমার মৃত্যু হয় তবে ফিতরাতে ইসলামের উপর তোমার মৃত্যু হবে। এ কথাগুলি তোমার শেষ কথা বনিয়ে নাও। তিনি বললেন, ‘আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে এ কথাগুলি পুনরায় শোনালাম। যখন اللَّهُمَّ آمَنْتُ بِكِتَابِكَ الَّذِي أَنْزَلْتَ পর্যন্ত পৌঁছে وَرَسُولِكَ বললাম, তখন তিনি বললেনঃ না; বরং وَنَبِيِّكَ الَّذِي أَرْسَلْتَ বল।',
              ref:
                  '',),
        ]),
 






























  ];
}
