import 'package:bokhari_shorif/app/data/models/hadis_number.dart';
import 'package:bokhari_shorif/app/data/models/poriched.dart';
import 'package:get/get.dart';

class hadisProvider extends GetConnect {
  @override
  void onInit() {
    httpClient.baseUrl = 'YOUR-API-URL';
  }

  List<PorichedModel> chapterOne = [
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১',
        name: 'রাসুলুল্লাহ (ﷺ) এর প্রতি কিভাবে ওহী শুরু হয়েছিল',
        hadisNumberList: [
          HadisNumberModel(
            id: '১।',
            name:
                ' হুমায়দী (রহঃ) ... আলকামা ইবনু ওয়াক্কাস আল-লায়সী (রহঃ) থেকে বর্ণিত, আমি উমর ইবনুল খাত্তাব (রাঃ)-কে মিম্বরের ওপর দাঁড়িয়ে বলতে শুনেছিঃ আমি রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছিঃ প্রত্যেক কাজ নিয়তের সাথে সম্পর্কিত। আর মানুষ তার নিয়ত অনুযায়ী ফল পাবে। তাই যার হিজরত হবে দুনিয়া লাভের অথবা নারীকে বিয়ে করার উদ্দেশ্যে- সেই উদ্দেশ্যেই হবে তার হিজরতের প্রাপ্য।',
            ref:
                'তাহক্বীক: মারফু হাদিস। তাখরীজ : বুখারীঃ তাওহীদ.পাবলিকেশান্স ১, ৫৪, ২৫২৯, ৩৮৯৮, ৫০৭০, ৬৬৮৯, ৬৯৫৩; মুসলিমঃ ৫০৩৬; আবূ দাউদঃ ২২০৩; তিরমিযীঃ ১৭৪৮; দারাকুতনীঃ ১৩৪; নাসাঈঃ ৭৫, ৩৪৫০, ৩৮১০; আহমাদঃ ১৭০, ৩০৭। মুসলিম ২৩/৪৫ হা: ১৯০৭ , (আধুনিক প্রকাশনী. ১ , ইসলামিক ফাউন্ডেশন. ১)',
          ),
          HadisNumberModel(
              id: '২। ',
              name:
                  'আবদুল্লাহ ইবনু ইউসুফ (রহঃ) ... আয়িশা (রাঃ) থেকে বর্ণিত, হারিস ইবনু হিশাম (রাঃ) রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে জিজ্ঞাসা করলেন, ইয়া রাসুলুল্লাহ! আপনার প্রতি ওহী কিভাবে আসে? রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ কোন সময় তা ঘন্টাধ্বনির ন্যায় আমার নিকট আসে। আর এটি-ই আমার উপর সবচাইতে কষ্টদায়ক হয় এবং তা সমাপ্ত হতেই ফিরিশতা যা বলেন আমি তা মুখস্থ করে নিই, আবার কখনো ফিরিশতা মানুষের আকৃতিতে আমার সঙ্গে কথা বলেন। তিনি যা বলেন আমি তা মুখস্থ করে ফেলি। আয়িশা (রাঃ) বলেন, আমি প্রচন্ড শীতের দিনে ওহী নাযিলরত অবস্থায় তাঁকে দেখেছি। ওহী শেষ হলেই তাঁর কপাল থেকে ঘাম ঝরে পড়ত।',
              ref:
                  'তাহক্বীক: মারফু হাদিস। তাখরীজ: ( বুখারীঃ তা.পা ২, ৩২১৫; তিরমিযীঃ ৩৯৯৪; নাসাঈঃ ৯৪২; আহমাদঃ ২৬৯৫২; মুয়াত্তাঃ ৪৭৯। মুসলিম ৪৩/২৩, হা: ২৩৩৩ , আহমাদ ২৫৩০৭ ( আধুনিক প্রকাশনী. ২ , ই.ফা. ২)শরীআহর মূল উৎস হচ্ছে ওয়াহী। ওয়াহী ২ প্রকার । ওয়াহী মাতলু (আল-কুরআন) ও ওয়াহী গাইরে মাতলু (সুন্নাহ ও হাদীস) । এবং দ্বীনে ইলাহীর ভিত্তি শুধু ২ টি জিনিসের উপর প্রতিষ্ঠিত । ইজমা ও কিয়াস কোন শারঈ দলীল নয়। বরং ইজমা ও কিয়াস ওয়াহীর পক্ষে অর্থাৎ কুরআন ও সুন্নাহ মুতাবিক হবে তা গ্রহণযোগ্য এবং যেটা বিপক্ষে যারে সেটা পরিত্যাজ্য ও অগ্রহণযোগ্য। এ প্রসঙ্গে আল্লাহর বানী :[يَا أَيُّهَا الَّذِينَ آمَنُوا أَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ وَأُولِي الْأَمْرِ مِنكُمْ ۖ فَإِن تَنَازَعْتُمْ فِي شَيْءٍ فَرُدُّوهُ إِلَى اللَّهِ وَالرَّسُولِ إِن كُنتُمْ تُؤْمِنُونَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ ۚ ذَٰلِكَ خَيْرٌ وَأَحْسَنُ تَأْوِيلًا [٤:٥٩]][يَا أَيُّهَا الَّذِينَ آمَنُوا أَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ وَلَا تُبْطِلُوا أَعْمَالَكُمْ [٤٧:٣٣]][ওহে যারা ঈমান এনেছ! আল্লাহকে অনুসরণ করো, ও রসূলের অনুগমন করো, আর তোমাদের মধ্যে যাদের হুকুম দেবার ভার আছে। তারপর যদি কোনো বিষয়ে তোমরা মতভেদ করো তবে তা পেশ করো আল্লাহ ও রসূলের কাছে, যদি তোমরা আল্লাহতে ও আখেরাতের দিনে বিশ্বাস করে থাকো। এটিই হচ্ছে শ্রেষ্ঠ ও সর্বাঙ্গ সুন্দর সমাপ্তিকরণ। (নিসাঃ ৪ : ৫৯)ওহে যারা ঈমান এনেছ! আল্লাহকে মেনে চলো ও রসূলের আজ্ঞা পালন করো, আর তোমাদের ক্রিয়াকর্ম বিফল করো না (মুহাম্মাদঃ ৪৭ : ৩৩)]কিন্তু বাতিলি ফির্কার লোকেরা ইজমা ও কিয়াসকে ওয়াহীর আসনে বসিয়েছে এবং বলে থাকে : শরীআহর ভিত্তি ভিত্তি ৪ টি বিষয়ের উপর । কুরআন , সুন্নাহ , ইজমা, কিয়াস । বড় আশ্চর্জের বিষয় এই যে, সাহাবায়ে কেরাম যাদের উপর আল্লাহ তা’আলা তার সন্তুষ্টির ঘোষনা দিয়েছেন, তাদেরকে সত্যবাদী বলে স্বীকৃতি দেয়া হয়েছে এবং মুসলিম উম্মাহ এ ব্যপারে সকলেই একমত। অথচ তারা সাহবায়ে কেরামকে ২ ভাগে ভাগ করেছেন। [১] ফকীগ [২] গাইরে ফকীহ। আর বলেছেন যে সকল সাহাবী ফকীহ ছিলেন তার আযদি কিয়াসের বীপরীতে হাদীস বর্ণনা করেন তবে তা গ্রহণযোগ্য কিন্তু যে সকল সাহাবী গাইরে ফকীহ অর্থাৎ ফকীহ নন তাঁরা যদি কিয়াসের খেলাফ হাদীস বর্ণনা করেন তাহলে তা গ্রহণযোগ্য বলে বিবেচিত হবে না।প্রকৃতপক্ষে এটা উম্মতে মুহাম্মাদিয়াকে সিরাতে মুস্তাকীমের পথ হতে সরিয়ে দেয়ার একটা বড় অস্ত্র এবং পরিকল্পনা। কেননা তারা কিয়াসকে মূল আর হাদীসকে ২য় স্থানে রেখেছেন। সকল সাহাবীর উপর আল্লাহ তা’আলা সন্তুষ্ট কিন্তু তারা খুশী নন। সকল সাহাবীর ব্যাপারে উম্মতের ঐক্যমত রয়েছে। কিন্তু তাদের নিকট গাইরে ফকীহ সাহাবীগণ ‘আদীল নন।ধোকাঁবাজির কিছু নমুনা : তারা বলেন, ফকীহ সাহাবীগণ কিয়াসের খেলাফ হাদীস বর্ণনা করলে তা গ্রহণীয় হবে। কিন্তু গাইরে ফকীহ সাহাবীগণ কিয়াসের খেলাফ হাদীস বর্ণনা করলে তা গ্রহণীয় হবে না এবং কিয়াসের উপর আ‘মাল করতে হবে। বাই’য়ি মুসারাহ এর হাদীস আবূ হুরাইরাহ হতে বর্ণিত এবং কিয়াসের খেলাফ। এই জন্য তা বাতিল। এবং কিয়াসের উপর আ‘মালযোগ্য। অথচ এই হাদীস ‘আবদুল্লাহ ইবনু মাসঊদ হতেও বর্ণিত হয়েছে। (দেখুন সহীহ বুখারী ২৮৮ পৃষ্ঠা রশিদিয়া ছাপা)'),
          HadisNumberModel(
              id: '4',
              name:
                  '৩। ইয়াহ্ইয়া ইবনু বুকায়র (রহঃ) আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেন, রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর প্রতি সর্বপ্রথম যে ওহী আসে, তা ছিল ঘুমের মধ্যে সত্য স্বপ্নরূপে। যে স্বপ্নই তিনি দেখতেন তা একেবারে ভোরের আলোর ন্যায় প্রকাশ পেত। তারপর তাঁর কাছে নির্জনতা প্রিয় হয়ে পড়ে এবং তিনি হেরার গুহায় নির্জনে থাকতেন। আপন পরিবারের কাছে ফিরে আসা এবং কিছু খাদ্যসামগ্রী সঙ্গে নিয়ে যাওয়া এইভাবে সেখানে তিনি একাধারে বেশ কয়েক রাত ইবাদতে নিমগ্ন থাকতেন।তারপর খাদীজা (রাঃ)-এর কাছে ফিরে এসে আবার অনুরূপ সময়ের জন্য কিছু খাদ্যসামগ্রী নিয়ে যেতেন। এমনিভাবে হেরা’ গুহায় অবস্থানকালে একদিন তাঁর কাছে ওহী এলো। তাঁর কাছে ফিরিশতা এসে বললেন, পড়ুন’। রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ “আমি বললাম, আমি পড়িনা’। তিনি বলেনঃ তারপর তিনি আমাকে জড়িয়ে ধরে এমন ভাবে চাপ দিলেন যে, আমার অত্যন্ত কষ্ট হল। তারপর তিনি আমাকে ছেড়ে দিয়ে বললেন, পড়ুন’। আমি বললামঃ আমি তো পড়ি না। তিনি দ্বিতীয়বার আমাকে জড়িয়ে ধরে এমন ভাবে চাপ দিলেন যে, আমার অত্যন্ত কষ্ট হল। এরপর তিনি আমাকে ছেড়ে দিয়ে বললেনঃ পড়ুন’। আমি জবাব দিলাম, আমিতো পড়িনা’। রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, তারপর তৃতীয়বার তিনি আমাকে জড়িয়ে ধরে চাপ দিলেন। এরপর ছেড়ে দিয়ে বললেন, “পড়ুন আপনার রবের নামে যিনি সৃষ্টি করেছেন। সৃষ্টি করেছেন মানুষকে আলাক থেকে। পড়ুন আর আপনার রব্ মহামহিমান্বিত।” (৯৬: ১-৩)তারপর এ আয়াত নিয়ে রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফিরে এলেন। তাঁর অন্তর তখন কাঁপছিল। তিনি খাদীজা বিন্‌ত খুওয়ালিদের কাছে এসে বললেন, আমাকে চাঁদর দিয়ে ঢেকে দাও, আমাকে চাঁদর দিয়ে ঢেকে দাও। ’ তাঁরা তাঁকে চাঁদর দিয়ে ঢেকে দিলেন। অবশেষে তাঁর ভয় দূর হল। তখন তিনি খাদীজা (রাঃ) এর কাছে সকল ঘটনা জানিয়ে তাঁকে বললেন, আমি নিজের উপর আশংকা বোধ করছি। খাদীজা (রাঃ) বললেন, আল্লাহ্‌র কসম, কক্ষনো না। আল্লাহ্ আপনাকে কক্ষনো অপমানিত করবেন না। আপনিতো আত্মীয়-স্বজনের সাথে সদ্ব্যবহার করেন, অসহায় দুর্বলের দায়িত্ব বহন করেন, নিঃস্বকে সাহায্য করেন, মেহমানের মেহমানদারী করেন এবং দুর্দশাগ্রস্তকে সাহায্য করেন।এরপর তাঁকে নিয়ে খাদীজা (রাঃ) তাঁর চাচাতো ভাই ওয়ারাকা ইবনু নাওফিল ইবনু আবদুল আসা’দ ইবনু আবদুল উযযার কাছে গেলেন, যিনি জাহিলী যুগে ঈসায়ী ধর্ম গ্রহণ করেছিলেন। তিনি ইবরানী ভাষা লিখতে জানতেন এবং আল্লাহ্‌র তওফীক অনুযায়ী ইবরানী ভাষায় ইনজীল থেকে অনুবাদ করতেন। তিনি ছিলেন অত্যন্ত বয়োবৃদ্ধ এবং অন্ধ হয়ে গিয়েছিলেন। খাদীজা (রাঃ) তাঁকে বললেন, হে চাচাতো ভাই! আপনার ভাতিজার কথা শুনুন। ওয়ারাকা তাঁকে জিজ্ঞেস করলেন, ভাতিজা! তুমি কী দেখ?’ রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যা দেখেছিলেন, সবই খুলে বললেন।তখন ওয়ারাকা তাঁকে বললেন, ইনি সে দূত যাঁকে আল্লাহ্ মূসা আলাইহিস সালাম এর কাছে পাঠিয়েছিলেন। আফসোস! আমি যদি সেদিন যুবক থাকতাম। আফসোস! আমি যদি সেদিন জীবিত থাকতাম, যেদিন তোমার কাওম তোমাকে বের করে দেবে। রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তাঁরা কি আমাকে বের করে দিবে? তিনি বললেন, হ্যাঁ, অতীতে যিনই তোমার মত কিছু নিয়ে এসেছেন তাঁর সঙ্গেই শত্রুতা করা হয়েছে। সেদিন যদি আমি থাকি, তবে তোমাকে প্রবলভাবে সাহায্য করব। এর কিছুদিন পর ওয়ারাকা (রাঃ) ইন্তেকাল করেন। আর ওহী স্থগিত থাকে।ইবনু শিহাব (রহঃ) ... জাবির ইবনু আবদুল্লাহ আনসারী (রাঃ) ওহী স্থগিত হওয়া প্রসঙ্গে বর্ণনা করেন যে, রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ একদা আমি হেঁটে চলেছি, হঠাৎ আকাশ থেকে একটি আওয়াজ শুনতে পেয়ে চোখ তুলে তাকালাম। দেখলাম, সেই ফিরিশতা, যিনি হেরায় আমার কাছে এসেছিলেন, আসমান ও যমিনের মাঝখানে একটি কুরসীতে বসে আছেন। এতে আমি ভয় পেয়ে গেলাম। তৎক্ষণাৎ আমি ফিরে এসে বললাম, আমাকে বস্ত্রাবৃত কর, আমাকে বস্ত্রাবৃত কর। তারপর আল্লাহ তা আলা নাযিল করলেন, হে বস্ত্রাচ্ছাদিত! উঠুন, সতর্কবানী প্রচার করুন এবং আপনার রবের শ্রেষ্ঠত্ব ঘোষণা করুন। আপনার পোশাক পবিত্র রাখুন। অপবিত্রতা থেকে দূরে থাকুন (৭৪: ১-৪)। এরপর ব্যাপকভাবে পর পর ওহী নাযিল হতে লাগল।আবদুল্লাহ ইবনু ইউসুফ (রহঃ) ও আবূ সালেহ (রহঃ) অনুরুপ বর্ণনা করেছেন। হেলাল ইবনু রাদদাদ (রহঃ) যুহরী (রহঃ) থেকেও অনুরুপ বর্ণনা করেছেন। ইউনুস ও মা মার فؤاده এর স্থলেبَوَادِرُهُ শব্দ উল্লেখ করেছেন।',
              ref:
                  'তাখরীজ: ( বুখারীঃ তা.পা ৩, ৩৩৯২, ৪৯৫৩, ৪৯৫৫, ৪৯৫৬, ৪৯৫৭, ৬৯৮২; মুসলিম ১/৭৩ হাঃ ১৬০, আহমদ ২৬০১৮ ( আ.প্রঃ ৩, ইঃফাঃ ৩)।'),
          HadisNumberModel(
              id: '৪।',
              name:
                  ' মূসা ইবনু ইসমাঈল (রহঃ) ... ইবনু আব্বাস (রাঃ) থেকে বর্ণিত, মহান আল্লাহর বাণীঃ তাড়াতাড়ি ওহী আয়ত্ত করার জন্য আপনার জিহ্বা তার সাথে নাড়বেন না’ (৭৫:১৬) এর ব্যাখ্যায় তিনি বলেন, রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ওহী নাযিলের সময় তা আয়ত্ত করতে বেশ কষ্ট স্বীকার করতেন এবং প্রায়ই তিনি তাঁর উভয় ঠোঁট নাড়াতেন। ইবনু আব্বাস (রাঃ) বলেন, আমি তোমাকে দেখানোর জন্য ঠোঁট দুটি নাড়ছি যেভাবে রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নাড়াতেন। ’সা’ঈদ (রহঃ) (তাঁর শাগরিদদের) বললেন, আমি ইবনু ’আব্বাস (রাঃ)-কে যেভাবে তাঁর ঠোঁট দুটি নাড়াতে দেখেছি, সেভাবেই আমার ঠোঁট দুটি নাড়াচ্ছি। ’ এই বলে তিনি তাঁর ঠোঁট দুটি নাড়ালেন। এ সম্পর্কে আল্লাহ্ তা’আলা নাযিল করলেনঃ “তাড়াতাড়ি ওহী আয়ত্ত করার জন্য আপনি আপনার জিহবা তার সাথে নাড়াবেন না। এর সংরক্ষণ ও পাঠ করানোর দায়িত্ব আমারই। ” (৭৫:১৬-১৮)ইবনু আব্বাস (রাঃ) বলেন এর অর্থ হলঃ আপনার অন্তরে তা সংরক্ষণ করা এবং আপনার দ্বারা তা পাঠ করানো। সুতরাং যখন আমি তা পাঠ করি আপনি সে পাঠের অনুসরণ করুন (৭৫:১৯) ইবনু আব্বাস (রাঃ) বলেন অর্থাৎ মনোযোগ সহকারে শুনুন এবং চুপ থাকুন। এরপর এর বিশদ ব্যাখ্যার দায়িত্ব আমারই (৭৫:১৯)। ’ অর্থাৎ আপনি তা পাঠ করবেন এটাও আমার দায়িত্ব। তারপর যখন রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে জিবরাঈল আলাইহি ওয়া সাল্লাম আসতেন, তখন তিনি মনোযোগ সহকারে কেবল শুনতেন। জিবরাঈল আলাইহি ওয়া সাল্লাম চলে গেলে তিনি যেমন পড়েছিলেন, রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও ঠিক তেমনি পড়তেন।',
              ref: ''),
          HadisNumberModel(
              id: '4',
              name:
                  '৫। আবদান (রহঃ) ও বিশর ইবনু মুহাম্মদ (রহঃ) ... ইবনু আব্বাস (রাঃ) থেকে বর্ণিত, তিনি বলেন, রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ছিলেন সর্বশ্রেষ্ঠ দাতা। রমযানে তিনি আরো বেশী দানশীল হতেন, যখন জিবরীল (আঃ) তাঁর সাথে সাক্ষাৎ করতেন। আর রমযানের প্রতি রাতেই জিবরীল (আঃ) তাঁর সাথে সাক্ষাৎ করতেন এবং তাঁরা পরস্পর কুরআন তিলাওয়াত করে শোনাতেন। নিশ্চয়ই রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রহমতের বাতাস থেকেও অধিক দানশীল ছিলেন।',
              ref: ''),
          HadisNumberModel(
              id: '4',
              name:
                  '৬। আবূল ইয়ামান হাকাম ইবনু নাফি (রহঃ) ... আবদুল্লাহ ইবনু আব্বাস (রাঃ) থেকে বর্ণনা করেন যে, আবূ সুফিয়ান ইবনু হরব তাকে বলেছেন, বাদশাহ হিরাকল একবার তাঁর কাছে লোক পাঠালেন। তিনি কুরাইশদের কাফেলায় তখন ব্যবসা উপলক্ষে সিরিয়ায় ছিলেন। সে সময় রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আবূ সুফিয়ান ও কুরাইশদের সাথে নির্দিষ্ট সময়ের জন্য সন্ধিবদ্ধ ছিলেন। আবূ সুফিয়ান তার সঙ্গীদের সহ হিরাকলের কাছে এলেন এবং তখন হিরাকল জেরুযালেমে অবস্থান করছিলেন। হিরাকল তাদেরকে তাঁর নিকটে ডাকলেন। তার পাশে তখন রোমের নেত্রীস্থানীয় ব্যাক্তিগন উপস্থিত ছিল। এরপর তাদের কাছে ডেকে নিলেন এবং দোভাষীকে ডাকলেন।তারপর জিজ্ঞাসা করলেন, এই যে ব্যাক্তি নিজেকে নবী বলে দাবী করে — তোমাদের মধ্যে বংশের দিক দিয়ে তাঁর সবচেয়ে নিকটাত্মীয় কে? আবূ সুফিয়ান বললেন, আমি বললাম, বংশের দিক দিয়ে আমিই তাঁর নিকটাত্মীয়। তিনি বললেন, তাঁকে আমার খুব কাছে নিয়ে এস এবং তাঁর সঙ্গীদেরও কাছে এনে পেছনে বসিয়ে দাও। এরপর তাঁর দোভাষীকে বললেন, তাদের বলে দাও, আমি এর কাছে সে ব্যাক্তি সম্পর্কে কিছু জিজ্ঞাসা করবো, সে যদি আমার কাছে মিথ্যা বলে, তবে সাথে সাথে তোমরা তাকে মিথ্যাবাদী বলে প্রকাশ করবে। আবূ সুফিয়ান বলেন, আল্লাহ্‌র কসম! তারা আমাকে মিথ্যাবাদী বলে প্রচার করবে-এ লজ্জা যদি আমার না থাকত, তবে অবশ্যই আমি তাঁর সম্পর্কে মিথ্যা বলতাম।এরপর তিনি তাঁর সম্পর্কে আমাকে প্রথম প্রশ্ন যে করেন তা হচ্ছে, তোমাদের মধ্যে তাঁর বংশমর্যাদা কেমন?’ আমি বললাম, তিনি আমাদের মধ্যে অতি সম্ভ্রান্ত বংশের। তিনি বললেন, তোমাদের মধ্যে এর আগে আর কখনো কি কেউ একথা বলেছে? আমি বললাম, না। তিনি বললেন, তাঁর বাপ-দাদাদের মধ্যে কি কেউ বাদশাহ ছিলেন? আমি বললাম, না। তিনি বললেন, তারা কি সংখ্যায় বাড়ছে, না কমছে? আমি বললাম, তারা বেড়েই চলেছে। তিনি বললেন, তাঁর দ্বীন গ্রহণ করার পর কেউ কি নারায হয়ে তা পরিত্যাগ করে? আমি বললাম, না। তিনি বললেন, নবূয়তের দাবীর আগে তোমরা কি কখনো তাঁকে মিথ্যার দায়ে অভিযুক্ত করেছ? আমি বললাম, না। তিনি বললেন, তিনি কি চুক্তি ভঙ্গ করেন?’ আমি বললাম, না। তবে আমরা তাঁর সঙ্গে একটি নির্দিষ্ট সময়ের চুক্তিতে আবদ্ধ আছি। জানিনা, এর মধ্যে তিনি কি করবেন।আবূ সুফিয়ান বলেন, এ কথাটুকু ছাড়া নিজের পক্ষ থেকে আর কোন কথা সংযোজনের সুযোগই আমি পাইনি। তিনি বললেন, তোমরা কি তাঁর সাথে কখনো যুদ্ধ করেছ?’ আমি বললাম, হাঁ। তিনি বললেন, তাঁর সঙ্গে তোমাদের যুদ্ধ কেমন হয়েছে?’ আমি বললাম, তাঁর ও আমাদের মধ্যে যুদ্ধের ফলাফল কুয়ার বালতির ন্যায়। কখনো তাঁর পক্ষে যায়, আবার কখনো আমাদের পক্ষে আসে। ’ তিনি বললেন, তিনি তোমাদের কিসের আদেশ দেন?’ আমি বললাম, তিনি বলেনঃ তোমরা এক আল্লাহ্‌র ইবাদত কর এবং তাঁর সঙ্গে কোন কিছুর শরীক করো না এবং তোমাদের বাপ-দাদার ভ্রান্ত মতবাদ ত্যাগ কর। আর তিনি আমাদের সালাত (নামায/নামাজ) আদায় করার, সত্য কথা বলার, নিষ্কলুষ থাকার এবং আত্মীয়দের সাথে সদ্ব্যবহার করার আদেশ দেন।তারপর তিনি দোভাষীকে বললেন, তুমি তাকে বল, আমি তোমার কাছে তাঁর বংশ সম্পর্কে জিজ্ঞাসা করেছি। তুমি তার জওয়াবে উল্লেখ করেছ যে, তিনি তোমাদের মধ্যে সম্ভ্রান্ত বংশের। প্রকৃতপক্ষে রাসূল গণকে তাঁদের কওমের উচ্চ বংশেই প্রেরণ করা হয়ে থাকে। তোমাকে জিজ্ঞাসা করেছি, এ কথা তোমাদের মধ্যে ইতিপূর্বে আর কেউ বলেছে কিনা? তুমি বলেছ, না। তাই আমি বলছি যে, আগে যদি কেউ এ কথা বলে থাকত, তবে অবশ্যই আমি বলতে পারতাম, এ এমন ব্যাক্তি, যে তাঁর পূর্বসূরীর কথারই অনুসরণ করছে। আমি তোমাকে জিজ্ঞাসা করেছি, তাঁর পূর্বপুরুষের মধ্যে কোন বাদশাহ ছিলেন কি না? তুমি তার জবাবে বলেছ, না। তাই আমি বলছি যে, তাঁর পূর্বপুরুষের মধ্যে যদি কোন বাদশাহ থাকতেন, তবে আমি বলতাম, ইনি এমন এক ব্যাক্তি যিনি তাঁর বাপ-দাদার বাদশাহী ফিরে পেতে চান।আমি তোমাকে জিজ্ঞাসা করেছি- এর আগে কখনো তোমরা তাঁকে মিথ্যার দায়ে অভিযুক্ত করেছ কি না? তুমি বলেছ, না। এতে আমি বুঝলাম, এমনটি হতে পারে না যে, কেউ মানুষের ব্যাপারে মিথ্যা ত্যাগ করবে অথচ আল্লাহ্‌র ব্যাপারে মিথ্যা কথা বলবে। আমি তোমাকে জিজ্ঞাসা করেছি, শরীফ লোক তাঁর অনুসরন করে, না সাধারণ লোক? তুমি বলেছ, সাধারণ লোকই তাঁর অনুসরণ করে। আর বাস্তবেও এরাই হন রাসূল গণের অনুসারী। আমি তোমাকে জিজ্ঞাসা করেছি, তারা সংখ্যায় বাড়ছে না কমছে? তুমি বলেছ বাড়ছে। প্রকৃতপক্ষে ঈমানে পূর্ণতা লাভ করা পর্যন্ত এ রকমই হয়ে থাকে। আমি তোমাকে জিজ্ঞাসা করেছি, তাঁরা দ্বীনে দাখিল হওয়ার পর নারায হয়ে কেউ কি তা ত্যাগ করে? তুমি বলেছ, না। ঈমানের স্নিগ্ধতা অন্তরের সাথে মিশে গেলে ঈমান এরূপই হয়। আমি তোমাকে জিজ্ঞাসা করেছি তিনি চুক্তি ভঙ্গ করেন কি না? তুমি বলেছ, না। প্রকৃতপক্ষে রাসূলগণ এরূপই, চুক্তি ভঙ্গ করেন না।আমি তোমাকে জিজ্ঞাসা করেছি তিনি তোমাদের কিসের নির্দেশ দেন। তুমি বলেছ, তিনি তোমাদের এক আল্লাহ্‌র ইবাদত করা ও তাঁর সাথে অন্য কিছুকে শরীক না করার নির্দেশ দেন। তিনি তোমাদের নিষেধ করেন মূর্তিপূজা করতে আর তোমাদের আদেশ করেন সালাত (নামায/নামাজ) আদায় করতে, সত্য কথা বলতে ও কলুষমুক্ত থাকতে। তুমি যা বলেছ তা যদি সত্য হয়, তবে শীঘ্রই তিনি আমার এ দু’পায়ের নীচের জায়গার মালিক হবেন। আমি নিশ্চিত জানতাম, তাঁর আবির্ভাব হবে; কিন্তু তিনি যে তোমাদের মধ্যে থেকে হবেন, এ কথা ভাবিনি। যদি জানতাম, আমি তাঁর কাছে পৌঁছাতে পারব, তাঁর সঙ্গে সাক্ষাৎ করার জন্য আমি যে কোন কষ্ট স্বীকার করতাম। আর আমি যদি তাঁর কাছে থাকতাম তবে অবশ্যই তাঁর দু’খানা পা ধুয়ে দিতাম। এরপর তিনি রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সেই পত্রখানি আনতে বললেন, যা তিনি দিহয়াতুল কালবীর মাধ্যমে বসরার শাসকের কাছে পাঠিয়েছিলেন। তিনি তা পাঠ করলেন। তাতে লেখা ছিলঃবিসমিল্লাহির রাহমানির রাহীম (দয়াময় পরম দয়ালু আল্লাহ্‌র নামে)। আল্লাহ্‌র বান্দা ও তাঁর রাসুল মুহাম্মদএর পক্ষ থেকে রোম সম্রাট হিরাকল এর প্রতি। --শান্তি (বর্ষিত হোক) তার প্রতি, যে হিদায়াতের অনুসরণ করে। তারপর আমি আপনাকে ইসলামের দাওয়াত দিচ্ছি। ইসলাম গ্রহণ করুন, নিরাপদে থাকবেন। আল্লাহ্ আপনাকে দ্বিগুণ পুরষ্কার দান করবেন। আর যদি মুখ ফিরিয়ে নেন, তবে সব প্রজার পাপই আপনার উপর বর্তাবে। হে আহলে কিতাব! এস সে কথার দিকে, যা আমাদের ও তোমাদের মধ্যে একই; যেন আমরা আল্লাহ্ ব্যতীত আর কারো ইবাদত না করি, কোন কিছুকেই তাঁর শরীক না করি এবং আমাদের কেউ কাউকে আল্লাহ্ ব্যতীত রব রূপে গ্রহণ না করি। যদি তারা মুখ ফিরিয়ে নেয়, তবে বলো, তোমরা সাক্ষী থাক, আমরা মুসলিম’ (৩:৬৪)।আবূ সুফিয়ান বলেন, হিরাকল যখন তাঁর বক্তব্য শেষ করলেন এবং পত্র পাঠও শেষ করলেন, তখন সেখানে শোরগোল পড়ে গেল, চীৎকার ও হৈ-হল্লা তুঙ্গে উঠল এবং আমাদের বের করে দেওয়া হল। আমাদের বের করে দিলে আমি আমার সঙ্গীদের বললাম, আবূ কাবশার ছেলের বিষয়তো শক্তিশালী হয়ে উঠেছে, বনূ আসফার (রোম)-এর বাদশাহও তাকে ভয় পাচ্ছে। তখন থেকে আমি বিশ্বাস করতে লাগলাম, তিনি শীঘ্রই জয়ী হবেন। অবশেষে আল্লাহ্ তা’আলা আমাকে ইসলাম গ্রহণের তওফীক দান করলেন।ইবনু নাতূর ছিলেন জেরুযালেমের শাসনকর্তা এবং হিরাকলের বন্ধু ও সিরিয়ার খৃষ্টানদের পাদ্রী। তিনি বলেন, হিরাকল যখন জেরুযালেম আসেন, তখন একদিন তাঁকে বিমর্ষ দেখাচ্ছিল। তাঁর একজন বিশিষ্ট সহচর বলল, আমরা আপনার চেহারা আজ বিবর্ণ দেখতে পাচ্ছি, ইবনু নাতূর বলেন, হিরাকল ছিলেন জ্যোতিষী, জ্যোতির্বিদ্যায় তাঁর দক্ষতা ছিল। তারা জিজ্ঞাসা করলে তিনি তাদের বললেন, আজ রাতে আমি তারকারাজির দিকে তাকিয়ে দেখতে পেলাম, খতনাকারীদের বাদশাহ আবির্ভূত হয়েছেন। বর্তমান যুগে কোন্ জাতি খতনা করে?’ তারা বলল, ইয়াহূদী ছাড়া কেউ খতনা করে না। কিন্তু তাদের ব্যাপার যেন আপনাকে মোটেই চিন্তিত না করে। আপনার রাজ্যের শহরগুলোতে লিখে পাঠান, তারা যেন সেখানকার সকল ইয়াহূদীকে হত্যা করে ফেলে। তারা যখন এ ব্যাপারে ব্যতিব্যস্ত ছিল, তখন হিরাকলের কাছে এক ব্যাক্তিকে উপস্থিত করা হল, যাকে গাসসানের শাসনকর্তা পাঠিয়েছিল। সে রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সম্পর্কে খবর দিচ্ছিল। হিরাকল তার কাছ থেকে খবর জেনে নিয়ে বললেন, তোমরা একে নিয়ে গিয়ে দেখ, তার খতনা হয়েছে কি-না। তারা তাকে নিয়ে দেখে এসে সংবাদ দিল, তার খতনা হয়েছে।হিরাকল তাকে আরবদের সম্পর্কে জিজ্ঞাসা করলেন। সে জওয়াব দিল, তারা খতনা করে। তারপর হিরাকল তাদের বললেন, ইনি [রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম] এ উম্মতের বাদশাহ। তিনি আবির্ভূত হয়েছেন। এরপর হিরাকল রোমে তাঁর বন্ধুর কাছে লিখলেন। তিনি জ্ঞানে তাঁর সমকক্ষ ছিলেন। পরে হিরাকল হিমস চলে গেলেন। হিমসে থাকতেই তাঁর কাছে তাঁর বন্ধুর চিঠি এলো, যা রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর আবির্ভাব এবং তিনই যে প্রকৃত নবী, এ ব্যাপারে হিরাকলের মতকে সমর্থন করছিল। তারপর হিরাকল তাঁর হিমসের প্রাসা’দ রোমের নেতৃস্থানীয় ব্যাক্তিদের ডাকলেন এবং প্রাসা’দর সব দরজা বন্ধ করে দেওয়ার নির্দেশ দিলেন। দরজা বন্ধ করা হল। তারপর তিনি সামনে এসে বললেন, হে রোমবাসী! তোমরা কি কল্যাণ, হিদায়ত এবং তোমাদের রাষ্ট্রের স্থায়িত্ব চাও? তাহলে এই নবী র রায় আত গ্রহণ কর।এ কথা শুনে তারা জংলী গাধার মত ঊর্ধ্বশ্বাসে দরজার দিকে ছুটল, কিন্তু তারা তা বন্ধ অবস্থায় পেল। হিরাকল যখন তাদের অনীহা লক্ষ্য করলেন এবং তাদের ঈমান থেকে নিরাশ হয়ে গেলেন, তখন বললেন, ওদের আমার কাছে ফিরিয়ে আন। তিনি বললেন, আমি একটু আগে যে কথা বলেছি, তা দিয়ে তোমরা তোমাদের দ্বীনের উপর কতটুকু অটল, কেবল তার পরীক্ষা করেছিলাম। এখন আমি তা দেখে নিলাম। একথা শুনে তারা তাঁকে সিজদা করল এবং তাঁর প্রতি সন্তুষ্ট হল। এই ছিল হিরাকল এর শেষ অবস্থা।আবূ আবদুল্লাহ [বুখারী (রহঃ)] বলেন, সালেহ ইবনু কায়সান (রহঃ), ইউনুস (রহঃ) ও মা’মার (রহঃ) এ হাদীস যুহরী (রহঃ) থেকে রিওয়ায়েত করেছেন।',
              ref: ''),
        ]),
  ];
  List<PorichedModel> chapterTwo = [
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২',
        name: 'রাসুলুল্লাহ (ﷺ) এর বাণীঃ ইসলামের ভিত্তি পাঁচটি',
        hadisNumberList: [
          HadisNumberModel(
              id: '৭',
              name:
                  'রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর বাণীঃ ইসলামের ভিত্তি পাঁচটিঃ মৌখিক স্বীকৃতি (ইয়াকীনসহ) এবং কর্মই ঈমান এবং তা বাড়ে ও কমে। আল্লাহ্‌ তা\'আলা ইরশাদ করেনঃ যাতে তারা তাদের ঈমানের সাথে ঈমান দৃঢ় করে নেয় (৪৮ : ৪)। আমরা তাদের সৎ পথে চলার শক্তি বাড়িয়ে দিয়েছিলাম। (১৮ঃ ১৩)। এবং যারা সৎপথে চলে আল্লাহ্‌ তাদের অধিক হেদায়াত দান করেন (১৯ঃ ৭৬)। এবং যারা সৎপথ অবলম্বন করে আল্লাহ্‌ তাদের অধিক হেদায়াত বাড়িয়ে দেন এবং তাদের সৎপথে চলার শক্তি বাড়িয়ে দেন (৪৭ঃ ১৭), যাতে মু মিনদের ঈমান বেড়ে যায় (৭৪ঃ ৩১)। আল্লাহ্‌ তা\'আলা আরো ইরশাদ করেন, এটা তোমাদের মধ্যে কার ঈমান বাড়িয়ে দিল? যারা মু\'মিন এ তো তাদের ঈমান বাড়িয়ে দেয়। (৯ঃ ১২৪) এবং তাঁর বাণীঃ (فَاخْشَوْهُمْ فَزَادَهُمْ إِيمَانًا) "সুতরাং তোমরা তাদের ভয় কর; আর এটা তাদের ঈমান বাড়িয়ে দিয়েছিল" (৩ঃ ২৭৩)। (وَمَا زَادَهُمْ إِلاَّ إِيمَانًا وَتَسْلِيمًا) "আর এতে তাদের ঈমান ও আনুগত্য বাড়লো।" (৩৩ঃ ২২)। আর আল্লাহ্‌র জন্য ভালবাসা ও আল্লাহ্‌র জন্য ঘৃণা করা ঈমানের অংশ।উমর ইবনু আবদুল আযীয (রহঃ) আদী ইবনু আদী (রহঃ) এর কাছে এক পত্রে লিখেছিলেন, ‘ঈমানের কতকগুলো ফরয, কতকগুলো হুকুম-আহকাম, বিধি-নিষেধ এবং সুন্নাত রয়েছে। যে এগুলো পরিপূর্ণরূপে আদায় করে তার ঈমান পূর্ণ হয়। আর যে এগুলো পূর্ণভাবে আদায় করে না, তার ঈমান পূর্ণ হয় না। আমি যদি বেঁচে থাকি তবে অচিরেই এগুলো তোমাদের নিকট বর্ণনা করব, যাতে তোমরা তার উপর ‘আমল করতে পার। আর যদি আমার মৃত্যু হয় তাহলে জেনে রাখ, তোমাদের সাহচর্যে থাকার জন্য আমি লালায়িত নই।ইবরাহীম (‘আ.) বলেন, (وَلَكِنْ لِيَطْمَئِنَّ قَلْبِي) ‘তবে এ তো কেবল চিত্ত প্রশান্তির জন্য’- (২ঃ ২৬০)। মু‘আয (রাঃ) বলেন, ‘এসো আমাদের সঙ্গে বস, কিছুক্ষণ ঈমানের আলোচনা করি।’ ইবনু মাস‘ঊদ (রাঃ) বলেন, ‘ইয়াকীন হল পূর্ণ ঈমান।’ ইবনু ‘উমার (রাঃ) বলেন, ‘বান্দা প্রকৃত তাকওয়ায় পৌঁছতে পারে না, যতক্ষণ পর্যন্ত সে, মনে যে বিষয় সন্দেহের সৃষ্টি করে, তা পরিত্যাগ না করে।’ মুজাহিদ (রহঃ) এ আয়াতের ব্যাখ্যায় বলেন, অর্থাৎ হে মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম! আমি আপনাকে এবং নূহকে একই ধর্মের আদেশ করেছি। ইবনু ‘আব্বাস (রাঃ) বলেন, (شِرْعَةً وَمِنْهَاجًا) অর্থাৎ পথ ও পন্থা—এবং তোমাদের দু\'আ অর্থাৎ তোমাদের ঈমান।৭। উবায়দুল্লাহ্ ইবনু মূসা (রহঃ) ... ইবনু উমর (রাঃ) থেকে বর্ণিত, তিনি বলেন, রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেন, ইসলামের ভিত্তি পাঁচটি।১। আল্লাহ্ ছাড়া ইলাহ্ নেই এবং নিশ্চয় মুহাম্মদ আল্লাহ্‌র রাসূল-এ কথার সাক্ষ্য দান।২। সালাত (নামায/নামাজ) কায়েম করা৩। যাকাত দেওয়া৪। হাজ্জ (হজ্জ) করা এবং ৫। রামাদান এর সিয়াম পালন করা।',
              ref: 'ref'),
        ]),
    PorichedModel(id: 'পরিচ্ছেদঃ ৩', name: 'ঈমানের বিষয়সমূহ', hadisNumberList: [
      HadisNumberModel(
          id: '৮। ',
          name:
              'আল্লাহ্ তা‘আলার বাণীঃ পূর্ব এবং পশ্চিম দিকে তোমাদের মুখ ফেরানোতে কোন কল্যাণ নেই; কিন্তু কল্যাণ আছে কেউ ঈমান আনলে আল্লাহ তা\'আলার উপর, আখিরাত, ফেরেশতাগণ, কিতাবসমূহ ও নবীগণের উপর ঈমান আনলে এবং আল্লাহ্‌র মুহাব্বতে আত্মীয়-স্বজন, ইয়াতিম, অভাভগ্রস্থ, মুসাফির, সাহায্য-প্রার্থীদের এবং দাসত্ব মোচনের জন্য সম্পদ দান করলে, সালাত কায়িম করলে ও যাকাত দিলে এবং ওয়াদা দিয়ে তা পূরণ করলে, অর্থসংকটে, দুঃখ-কষ্টে ও যুদ্ধকালে ধৈর্য ধারণ করলে। তারাই সত্যপরায়ণ, ও তারা মুত্তাকী’’- (২ঃ ১৭৭)। (... قَدْ أَفْلَحَ الْمُؤْمِنُونَ) ‘‘অবশ্যই সফলকাম হয়েছে মু\'মিনগণ, যারা বিনয়-নম্র নিজেদের সালাতে ... (২৩ঃ ১-২)আবদুল্লাহ ইবনু জু’ফী (রহঃ) ... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, রাসুল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেন, ঈমানের শাখা রয়েছে ষাটের কিছু বেশি। আর লজ্জা ঈমানের একটি শাখা।',
          ref: ''),
    ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৪',
        name:
            'প্রকৃত মুসলিম সে-ই, যার জিহ্বা ও হাত থেকে অন্য মুসলিম নিরাপদ থাকে',
        hadisNumberList: [
          HadisNumberModel(
              id: '৯।',
              name:
                  ' আদম ইবনু ইয়াস (রহঃ) ... আবদুল্লাহ ইবনু আমর (রাঃ) থেকে বর্ণিত, রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেন, প্রকৃত মুসলিম সে-ই, যার জিহ্বা ও হাত থেকে সকল মুসলিম নিরাপদ থাকে এবং প্রকৃত মুহাজির সে-ই, যে আল্লাহ্ তা’আলার নিষিদ্ধ কাজ ত্যাগ করে।আবূ আবদুল্লাহ (রহঃ) বলেন, আবূ মু’আবিয়া (রহঃ) বলেছেন, আমার কাছে দাউদ ইবনু আবূ হিন্দ (রহঃ) আমির (রহঃ) সূত্রে বর্ণনা করেছেনঃ তিনি বলেছেন যে, আমি আবদুল্লাহ ইবনু আমর (রাঃ) কে রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে হাদীস বর্ণনা করতে শুনেছি এবং আবদুল আ’লা (রহঃ) দাউদ (রহঃ) থেকে, দাউদ (রহঃ) আমির (রহঃ) থেকে, আমির (রহঃ) আবদুল্লাহ (রাঃ) থেকে, তিনি রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে হাদীস বর্ণনা করেছেন।',
              ref: ''),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৫',
        name: ' ইসলামে কোন কাজটি উত্তম',
        hadisNumberList: [
          HadisNumberModel(
              id: '১০।',
              name:
                  ' সা’ঈদ ইবনু ইয়াহ্ইয়া ইবনু সা’ঈদ আল উমাবী আল কুরাশী (রহঃ) ... আবূ মূসা (রাঃ) থেকে বর্ণিত, তিনি বলেন, সাহাবায়ে কিরাম জিজ্ঞাসা করলেন, ইয়া রাসুলাল্লাহ! ইসলামে কোন্ কাজটি উত্তম? তিনি বললেনঃ যার জিহ্বা ও হাত থেকে মুসলিমগণ নিরাপদ থাকে।',
              ref: ''),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৬  ',
        name: 'খাবার খাওয়ানো ইসলামী গুন',
        hadisNumberList: [
          HadisNumberModel(
              id: '১১।',
              name:
                  '  অমর ইবনু খালিদ (রহঃ) ... আবদুল্লাহ ইবনু আমর (রাঃ) থেকে বর্ণনা করেন, এক ব্যাক্তি রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে জিজ্ঞাসা করল, ইসলামের কোন কাজটি উত্তম? তিনি বললেন, তুমি খাবার খাওয়াবে ও পরিচিত অপরিচিত সবাইকে সালাম দিবে।',
              ref: ''),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৭ ',
        name: ' নিজের জন্য যা পছন্দনীয়, ভাইয়ের জন্যও তা পছন্দ করা ঈমানের অংশ',
        hadisNumberList: [
          HadisNumberModel(
              id: '১২। ',
              name:
                  'মূসা’দ্দাদ (রহঃ) ও হুসাইন আল মু\'আল্লিম (রহঃ) ... আনাস (রাঃ) থেকে বর্ণিত, রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেনঃ তোমাদের কেউ প্রকৃত মু’মিন হবে না, যতক্ষণ না সে তার ভাইয়ের জন্য তা-ই পছন্দ করবে, যা নিজের জন্য পছন্দ করে। ',
              ref: ''),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৮ ',
        name: ' রাসুলুল্লাহ (ﷺ)-কে ভালোবাসা ঈমানের অঙ্গ',
        hadisNumberList: [
          HadisNumberModel(
              id: '১৩।',
              name:
                  ' আবূল ইয়ামান (রহঃ) ... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেনঃ সেই পবিত্র সত্তার কসম, যাঁর হাতে আমার প্রাণ, তোমাদের কেউ প্রকৃত মু’মিন হতে পারবে না, যতক্ষণ না আমি তার কাছে তার পিতা ও সন্তানের চেয়ে বেশি প্রিয় হই। ',
              ref: ''),
          HadisNumberModel(
              id: '১৪।',
              name:
                  ' ইয়া’কুব ইবনু ইবরাহীম ও আদম (রহঃ) ... আনাস (রাঃ) থেকে বর্ণিত, রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেনঃ তোমাদের কেউ মু’মিন হতে পারবে না, যতক্ষন না আমি তার কাছে তার পিতা, সন্তান ও সব মানুষের চেয়ে বেশী প্রিয় হই। ',
              ref: ''),
        ]),
    PorichedModel(id: 'পরিচ্ছেদঃ ৯ ', name: ' ঈমানের স্বাদ', hadisNumberList: [
      HadisNumberModel(
          id: '১৫।',
          name:
              ' মুহাম্মদ ইবনুল মূসান্না (রহঃ) ... আনাস (রাঃ) থেকে বর্ণিত, রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেনঃ তিনটি গুণ যার মধ্যে থাকে, সে ঈমানের স্বাদ পায়। ১। আল্লাহ্ ও তাঁর রাসূল তার কাছে অন্য সব কিছুর থেকে প্রিয় হওয়া; ২। কাউকে খালিস আল্লাহ্‌র জন্যই মুহব্বত করা; ৩। কুফ্‌রীতে ফিরে যাওয়াকে আগুনে নিক্ষিপ্ত হওয়ার মত অপছন্দ করা। ',
          ref: ''),
    ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১০ ',
        name: ' আনসারকে ভালোবাসা ঈমানের লক্ষণ',
        hadisNumberList: [
          HadisNumberModel(
              id: '১৬।',
              name:
                  ' আবূল ওয়ালীদ (রহঃ) ... আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত, রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেনঃ ঈমানের চিহ্ন হল আনসারকে ভালবাসা এবং মুনাফিকীর চিহ্ন হল আনসারদের প্রতি বিদ্বেষ পোষণ করা। ',
              ref: ''),
        ]),
    PorichedModel(id: 'পরিচ্ছেদঃ ১১ ', name: ' পরিচ্ছদ নেই', hadisNumberList: [
      HadisNumberModel(
          id: '১৭।',
          name:
              ' আবূল ইয়ামান (রহঃ) ... ‘আয়িনুল্লাহ্ ইবনু আবদুল্লাহ (রহঃ) বলেন, বদর যুদ্ধে অংশগ্রহণকারী ও লায়লাতুল ‘আকাবার একজন নকীব ‘উবাদা ইবনুস সামিত (রাঃ) বর্ণনা করেন, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর পার্শ্বে একজন সাহাবীর উপস্থিতিতে তিনি ইরশাদ করেনঃ তোমরা আমার কাছে এই মর্মে বায়’আত গ্রহণ কর যে, আল্লাহ্‌র সঙ্গে কিছু শরীক করবে না, চুরি করবে না, যিনা করবে না, তোমাদের সন্তানদের হত্যা করবে না, কাউকে মিথ্যা অপবাদ দেবে না এবং নেক কাজে নাফরমানী করবে না। তোমাদের মধ্যে যে তা পূরণ করবে, তার বিনিময় আল্লাহ্‌র কাছে। আর কেউ এর কোন একটিতে লিপ্ত হয়ে পড়লে এবং দুনিয়াতে তার শাস্তি পেয়ে গেলে, তবে তা হবে তার জন্য কাফ্‌ফারা। আর কেউ এর কোন একটিতে লিপ্ত হয়ে পড়লে এবং আল্লাহ্ তা অপ্রকাশিত রাখলে, তবে তা আল্লাহ্‌র ইচ্ছাধীন। তিনি যদি চান, তাকে মাফ করে দেবেন আর যদি চান, তাকে শাস্তি দেবেন। আমরা এর উপর বায়’আত গ্রহণ করলাম। ',
          ref: ''),
    ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১২  ',
        name: 'ফিতনা থেকে পলায়ন দ্বীনের অংশ',
        hadisNumberList: [
          HadisNumberModel(
              id: ' ১৮।',
              name:
                  ' আবদুল্লাহ ইবনু মাসলামা (রহঃ) ... আবূ সা’ঈদ খুদরী (রাঃ) থেকে বর্ণিত, তিনি বলেন, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ সেদিন দূরে নয়, যেদিন মুসলিমের উত্তম সম্পদ হবে কয়েকটি বকরী, যা নিয়ে সে পাহাড়ের চুড়ায় অথবা বৃষ্টিপাতের স্থানে চলে যাবে। ফিতনা থেকে বাঁচতে সে তার দ্বীন নিয়ে পালিয়ে যাবে।',
              ref: ''),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১৩ ',
        name:
            ' নাবী করীম (ﷺ) এর বাণী, আমি তোমাদের তুলনায় আল্লাহকে সম্পর্কে অধিক জ্ঞানী। আর মারেফাত (আল্লাহ্‌র পরিচয়) অন্তরের কাজ। যেমন আল্লাহ্‌ ইরশাদ করেছেনঃ কিন্তু তিনি তোমাদের অন্তরের সংকল্পের জন্য দায়ী করবেন। (২ঃ ২২৫)',
        hadisNumberList: [
          HadisNumberModel(
              id: '১৯।',
              name:
                  ' মুহাম্মদ ইবনু সালাম (রহঃ) ... ‘আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেন, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সাহাবীদের যখন কোন আমলের নির্দেশ দিতেন তখন তাঁরা যতটুকু সমর্থ্য রাখতেন ততটুকুরই নির্দেশ দিতেন। একবার তাঁরা বললেন, হে আল্লাহ্‌র রাসূল! আমরা তো আপনার মত নই। আল্লাহ্ তা’আলা আপনার পূর্ববর্তী এবং পরবর্তী সকল ত্রুটি মাফ করে দিয়েছেন। একথা শুনে তিনি রাগ করলেন, এমনকি তাঁর চেহারা মুবারকে রাগের চিহ্ন প্রকাশ পাচ্ছিল। এরপর তিনি বললেনঃ তোমাদের চাইতে আল্লাহকে আমিই বেশি ভয় করি ও বেশি জানি। ',
              ref: ''),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১৪ ',
        name:
            ' কুফরীতে ফিরে যাওয়াকে আগুনে নিক্ষিপ্ত হবার ন্যায় অপছন্দ করা ঈমানের অঙ্গ',
        hadisNumberList: [
          HadisNumberModel(
            id: '২০।',
            name:
                ' সুলায়মান ইবনু হারব (রহঃ) ... আনাস (রাঃ) থেকে বর্ণিত, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তিনটি গুণ যার মধ্যে থাকে, সে ঈমানের স্বাদ পায়—(১) যার কাছে আল্লাহ্ ও তাঁর রাসূল অন্য সব কিছু থেকে প্রিয়; (২) যে একমাত্র আল্লাহ্‌রই জন্য কোন বান্দাকে মুহব্বত করে এবং (৩) আল্লাহ্ তা’আলা কুফর থেকে মুক্তি দেওয়ার পর যে কুফর-এ ফিরে যাওয়াকে আগুনে নিক্ষিপ্ত হওয়ার মতোই অপছন্দ করে। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১৫ ',
        name: ' আমলের দিক থেকে ঈমানদারদের শ্রেষ্ঠত্বের স্তরভেদ',
        hadisNumberList: [
          HadisNumberModel(
            id: '২১। ',
            name:
                ' ইসমা’ঈল (রহঃ) ... আবূ সাঈদ খুদরী (রাঃ) থেকে বর্ণিত, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ জান্নাতীগণ জান্নাতে এবং জাহান্নামীরা জাহান্নামে প্রবেশ করবেন। পরে আল্লাহ্ তা’আলা (ফিরিশতাদের) বলবেন, যার অন্তরে একটি সরিষা পরিমানও ঈমান রয়েছে, তাকে দোযখ থেকে বের করে নিয়ে আস। তারপর তাদের দোযখ থেকে বের করা হবে এমন অবস্থায় যে, তারা (পুড়ে) কালো হয়ে গেছে। এরপর তাদের বৃষ্টিতে বা হায়াতের [বর্ণনাকারী মালিক (রহঃ) শব্দ দু’টির কোনটি এ সম্পর্কে সন্দেহ পোষণ করেছেন] নদীতে ফেলা হবে। ফলে তারা সতেজ হয়ে উঠবে, যেমন নদীর পাশে ঘাসের বীজ গজিয়ে উঠে। তুমি কি দেখতে পাওনা সেগুলো কেমন হলুদ রঙের হয় ও ঘন হয়ে গজায়? উহাইব (রহঃ) বলেন, ‘আমর (রহঃ) আমাদের কাছেحيا এর স্থলেحياة এবং خردل من ايمان এর স্থলেخردل من خير বর্ণনা করেছেন।',
            ref: '',
          ),
          HadisNumberModel(
            id: '২২।',
            name:
                '  মুহাম্মদ ইবনু উবায়দুল্লাহ্ (রহঃ) ... আবূ উমামা ইবনু সাহল ইবনু হুনাইফ (রহঃ) থেকে বর্ণিত, তিনি আবূ সাঈদ খুদরী (রাঃ)-কে বলতে শুনেছেন, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ একবার আমি ঘুমন্ত অবস্থায় (স্বপ্নে) দেখলাম যে, লোকদেরকে আমার সামনে হাযির করা হচ্ছে। আর তাদের পরণে রয়েছে জামা। কারো জামা বুক পর্যন্ত আর কারো জামা এর নীচ পর্যন্ত। আর উমর ইবনুল খাত্তাব (রাঃ)-কে আমার সামনে হাযির করা হল এমন অবস্থায় যে, তিনি তাঁর জামা (এত লম্বা যে) টেনে নিয়ে যাচ্ছিলেন। সাহাবায়ে কিরাম বললেন, ইয়া রাসূলাল্লাহ! আপনি',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১৬ ',
        name: ' লজ্জা ঈমানের অঙ্গ',
        hadisNumberList: [
          HadisNumberModel(
            id: '২৩।',
            name:
                ' আবদুল্লাহ ইবনু ইউসুফ (রহঃ) ... আবদুল্লাহ ইবনু উমর (রাঃ) থেকে বর্ণিত যে, একদিন রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক আনসারীর পাশ দিয়ে যাচ্ছিলেন। তিনি তাঁর ভাইকে তখন (অধিক) লজ্জা ত্যাগের জন্য নসীহত করছিলেন। রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে বললেনঃ ওকে ছেড়ে দাও। কারন লজ্জা ঈমানের অঙ্গ। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১৭',
        name:
            ' যদি তারা তওবা করে, সালাত কায়েম করে ও যাকাত দেয়, তবে তাদের পথ ছেড়ে দেবে (৯:৫)',
        hadisNumberList: [
          HadisNumberModel(
            id: '২৪।',
            name:
                ' আবদুল্লাহ ইবনু মুহাম্মদ আল-মুসনাদী (রহঃ) ... ইবনু উমর (রাঃ) থেকে বর্ণিত যে, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেনঃ আমি লোকদের সাথে যুদ্ধ চালিয়ে যাবার জন্য আদিষ্ট হয়েছে, যতক্ষন না তারা সাক্ষ্য দেয় যে, আল্লাহ্ ছাড়া কোন ইলাহ্ নেই ও মুহাম্মদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আল্লাহ্‌র রাসূল, আর সালাত (নামায/নামাজ) কায়েম করে ও যাকাত দেয়। তারা যদি এ কাজগুলো করে, তবে আমার পক্ষ থেকে তাদের জান ও মালের ব্যাপারে নিরাপত্তা লাভ করল; অবশ্য ইসলামের বিধান অনুযায়ী যদি কোন কারন থাকে, তাহলে স্বতন্ত্র কথা। আর তাদের হিসাবের ভার আল্লাহ্‌র ওপর ন্যাস্ত। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১৮/ ',
        name: ' যে বলে ঈমান আমলেরই নাম',
        hadisNumberList: [
          HadisNumberModel(
            id: '',
            name:
                ' আল্লাহ্ তা‘আলার এ বাণীর পরিপ্রেক্ষিতেঃ وَتِلْكَ الْجَنَّةُ الَّتِي أُورِثْتُمُوهَا بِمَا كُنْتُمْ تَعْمَلُونَ এটাই জান্নাত, তোমাদেরকে যার অধিকারী করা হয়েছে তোমাদের কর্মের ফলস্বরূপ। (সূরা যুখরুফঃ ৭২) فَوَرَبِّكَ لَنَسْأَلَنَّهُمْ أَجْمَعِينَ عَمَّا كَانُوا يَعْمَلُونَসুতরাং কসম আপনার রবের। আমি তাদের সবাইকে প্রশ্ন করবই সে বিষয়ে, যা তারা করে- (সূরাহ্ হিজরঃ ৯০)। আল্লাহ তা\'আলার এ বাণী সম্পর্কে আলিমদের এক দল বলেন, لآ إِلَهَ إِلاَّ اللهُ এর স্বীকারোক্তি সম্পর্কে প্রশ্ন করা হবে।আল্লাহ্ তা‘আলার বাণীঃ لِمِثْلِ هَذَا فَلْيَعْمَلِ الْعَامِلُونَ এরূপ সাফল্যের জন্য ‘আমলকারীদের উচিত ‘আমল করা। (সূরাহ্ সাফফাতঃ ৬১)২৫। আহমদ ইবনু ইউনুস ও মূসা ইবনু ইসমা’ঈল (রহঃ) ... আবূ হুরায়রা (রাঃ) থেকে বর্ণনা করেন, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে জিজ্ঞাসা করা হল, ‘কোন্ আমলটি উত্তম?’ তিনি বললেনঃ আল্লাহ্ ও তাঁর রাসূলের ওপর ঈমান আনা। প্রশ্ন করা হল, তারপর কোনটি? তিনি বললেনঃ আল্লাহ্‌র রাস্তায় জিহাদ করা। প্রশ্ন করা হল, তারপর কোনটি। তিনি বললেনঃ মকবূল হাজ্জ (হজ্জ)।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১৯',
        name:
            'ইসলাম গ্রহন যদি খাঁটি না হয় বরং বাহ্যিক আনুগত্য প্রদর্শনের জন্য বা হত্যার ভয়ে হয়।',
        hadisNumberList: [
          HadisNumberModel(
            id: '',
            name:
                'তবে তাঁর ইসলাম গ্রহণ মহান আল্লাহর এ বাণী অনুযায়ী হবেঃقَالَتِ الأَعْرَابُ آمَنَّا قُلْ لَمْ تُؤْمِنُوا وَلَكِنْ قُولُوا أَسْلَمْنَا ‘‘আরব মরুবাসীরা বলে, আমরা ঈমান আনলাম; আপনি বলে দিন, তোমরা ঈমান আন নি; বরং তোমরা বল, ‘আমরা বাহ্যত মুসলিম হয়েছি। (সূরা হুজরাতঃ ১৪) আর ইসলাম গ্রহণ খাঁটি হলে তা হবে আল্লাহ্ তা‘আলার এ বাণী অনুযায়ীঃ (إِنَّ الدِّينَ عِنْدَ اللَّهِ الإِسْلاَمُ) ‘‘নিশ্চয়ই ইসলাম আল্লাহর নিকট একমাত্র দ্বীন’’- (সূরাহ্ আলে ‘ইমরানঃ ১৯)। ২৬। আবূল ইয়ামান (রহঃ) ... সা’দ (রাঃ) থেকে বর্ণিত, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একদল লোককে কিছু দান করলেন। সা’দ (রাঃ) সেখানে বসা ছিলেন। সা’দ (রাঃ) বললেন, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের এক ব্যাক্তিকে কিছু দিলেন না। সে ব্যাক্তি আমার কাছে তাদের চেয়ে অধিক পছন্দনীয় ছিল। তাই আমি বললাম, ইয়া রাসূলল্লাহ্‌! অমুক ব্যাক্তিকে আপনি বাদ দিলেন কেন? আল্লাহ্‌র কসম! আমিতো তাকে মু’মিন বলেই জানি। তিনি বললেনঃ (মু’মিন) না মুসলিম? তখন আমি কিছুক্ষণ চুপ থাকলাম। তারপর আমি তার সম্পর্কে যা জানি, তা প্রবল হয়ে উঠল। তাই আমি আমার বক্তব্য আবার বললাম, আপনি অমুককে দানের ব্যপারে বিরত রইলেন? আল্লাহ্‌র কসম! আমিতো তাকে মু’মিন বলেই জানি। তিনি বললেনঃ ‘না মুসলিম?’ তখন আমি কিছুক্ষণ চুপ থাকলাম। তারপর তার সম্পর্কে যা জানি তা প্রবল হয়ে উঠল। তাই আমি আমার বক্তব্য আবার বললাম। রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আবারও সেই জবাব দিলেন। তারপর বললেনঃ ‘সা’দ! আমি কখনো ব্যাক্তি বিশেষকে দান করি, অথচ অন্য লোক আমার কাছে তার চাইতে বেশি প্রিয়। তা এ আশঙ্কায় যে (সে ঈমান থেকে ফিরে যেতে পারে পরিণামে), আল্লাহ্ তা’আলা তাকে অধোমুখে জাহান্নামে ফেলে দেবেন।এ হাদীস ইউনুস, সালিহ, মা’মার এবং যুহরী (রহঃ)-এর ভাতিজা যুহরী (রহঃ) থেকে বর্ণনা করেছেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২০',
        name: ' সালামের প্রচলন করা ইসলামের অন্তর্ভুক্ত',
        hadisNumberList: [
          HadisNumberModel(
            id: '',
            name:
                'আম্মার (রাঃ) বলেন, ‘তিনটি গুণ যে আয়ত্ত করে, সে (পূর্ণ) ঈমান লাভ করেঃ (১) নিজ থেকে ইনসাফ করা, (২) বিশ্বে সালামের প্রচলন, এবং (৩) অভাবগ্রস্থ অবস্থায়ও দান করা। ২৭। কুতায়বা (রহঃ) ... আবদুল্লাহ ইবনু ‘আমর (রাঃ) থেকে বর্ণিত, এক ব্যাক্তি রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে জিজ্ঞাসা করল, ‘ইসলামের কোন্ কাজ সবচাইতে উত্তম?’ তিনি বললেনঃ তুমি লোকদের আহার করাবে এবং পরিচিত-অপরিচিত নির্বিশেষে সকলকে সালাম দিবে। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২১',
        name: ' স্বামীর প্রতি অকৃতজ্ঞতা আর এক কুফর অন্য কুফর থেকে ছোট।',
        hadisNumberList: [
          HadisNumberModel(
            id: '',
            name:
                'এ সম্পর্কে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে আবূ সাঈদ খুদরী (রাঃ) এর সূত্রে হাদিস বর্ণিত আছে। ২৮। আবদুল্লাহ ইবনু মাসলামা (রহঃ) ... ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিত, তিনি বলেন, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেনঃ আমাকে জাহান্নাম দেখানো হয়। (আমি দেখি), তার অধিবাসীদের অধিকাংশই স্ত্রীলোক; (কারন) তারা কুফরী করে। জিজ্ঞাসা করা হল, ‘তারা কি আল্লাহর সঙ্গে কুফরী করে? তিনি বললেনঃ ‘তারা স্বামীর অবাধ্য হয় এবং ইহসান অস্বীকার করে। তুমি যদি দীর্ঘকাল তাদের কারো প্রতি ইহসান করতে থাক, এরপর সে তোমার সামান্য অবহেলা দেখলেই বলে, ‘আমি কখনো তোমার কাছ থেকে ভালো ব্যবহার পাইনি। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২২',
        name: 'পাপ কাজ জাহেলী যুগের স্বভাব',
        hadisNumberList: [
          HadisNumberModel(
            id: '',
            name:
                'আর শির্‌ক ব্যতীত অন্য কোন গুনাহ্‌তে লিপ্ত হওয়াতে ঐ পাপীকে কাফির বলা যাবে না। যেহেতু নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম [আবূ যার (রাঃ)-কে লক্ষ্য করে] বলেছেনঃ তুমি এমন ব্যক্তি, তোমার মধ্যে জাহিলী যুগের অভ্যাস রয়েছে। আর আল্লাহর বাণীঃ إِنَّ اللَّهَ لاَ يَغْفِرُ أَنْ يُشْرَكَ بِهِ وَيَغْفِرُ مَا دُونَ ذَلِكَ لِمَنْ يَشَاءُ আল্লাহ্ তাঁর সাথে অংশীদার স্থাপন করার গুনাহ ক্ষমা করেন না। এছাড়া অন্যান্য গুনাহ যাকে ইচ্ছা ক্ষমা করেন। (সূরা আন-নিসাঃ ৪৮)২৯। ‘আবদুর রহমান ইবনুল মুবারক (রহঃ) ... আহনাফ ইবনু কায়স (রহঃ) থেকে বর্ণিত, তিনি বলেন, আমি (সিফফীনের যুদ্ধে) এ ব্যক্তিকে [আলী (রাঃ)-কে] সাহায্য করতে যাচ্ছিলাম। আবূ বাক্‌রা (রাঃ)-এর সাথে আমার সাক্ষাত হলে তিনি বললেনঃ ‘তুমি কোথায় যাচ্ছে?’ আমি বললাম, ‘আমি এ ব্যক্তিকে সাহায্য করতে যাচ্ছি। তিনি বললেনঃ ‘ফিরে যাও। কারন আমি রাসূলুল্লাহ্‌ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে বলতে শুনেছি যে, দু’জন মুসলিম তাদের তরবারি নিয়ে মুখোমুখি হলে হত্যাকারী এবং নিহত ব্যক্তি উভয়ে জাহান্নামে যাবে। আমি বললাম, ‘ইয়া রাসূলাল্লাহ্‌! এ হত্যাকারী (তো অপরাধী), কিন্তু নিহত ব্যক্তির কি অপরাধ? তিনি বললেন, (নিশ্চয়ই) সে তার সঙ্গীকে হত্যা করার জন্য উদগ্রীব ছিল। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '৩০।',
            name:
                ' সুলায়মান ইবনু হারব (রহঃ) ... মা’রূর (রহঃ) থেকে বর্ণিত আছে, তিনি বলেনঃ আমি একবার রাবাযা নামক স্থানে আবূ যর (রাঃ) এর সাথে সাক্ষাৎ করলাম। তখন তাঁর পরনে ছিল এক জোড়া কাপড় (লুঙ্গি ও চাঁদর) আর তাঁর চাকরের পরনেও ছিল ঠিক একই ধরনের এক জোড়া কাপড়। আমি তাঁকে এর (সমতার) কারন জিজ্ঞাসা করলাম। তিনি বললেনঃ একবার আমি এক ব্যাক্তিকে গালি দিয়েছিলাম এবং আমি তাকে তার মা সম্পর্কে লজ্জা দিয়েছিলাম। তখন রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে বললেনঃ ‘আবূ যর! তুমি তাকে তার মা সম্পর্কে লজ্জা দিয়েছ? তুমি তো এমন ব্যাক্তি, তোমার মধ্যে এখনো জাহিলী যুগের স্বভাব রয়েছে। জেনে রেখো, তোমাদের দাস-দাসী তোমাদেরই ভাই। আল্লাহ্ তা’আলা তাদের তোমাদের অধীনস্থ করে দিয়েছেন। তাই যার ভাই তার অধীনে থাকবে, সে যেন নিজে যা খায় তাকে তা-ই খাওয়ায় এবং নিজে যা পরে, তাকে তা-ই পরায়। তাদের উপর এমন কাজ চাপিয়ে দিও না, যা তাদের জন্য খুব কষ্টকর। যদি এমন কষ্টকর কাজ করতে দাও, তাহলে তোমরাও তাদের সে কাজে সাহায্য করবে। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২৩',
        name: ' যুলুমের প্রকারভেদ',
        hadisNumberList: [
          HadisNumberModel(
            id: '',
            name:
                '৩১। আবূল ওয়ালীদ এবং বিশ্‌র (রহঃ) ... আবদুল্লাহ‌ ইবনু মাসউদ (রাঃ) থেকে বর্ণনা করেনঃ (‏الَّذِينَ آمَنُوا وَلَمْ يَلْبِسُوا إِيمَانَهُمْ بِظُلْمٍ‏) “যারা ঈমান এনেছে এবং তাদের ঈমানকে যুলুম দ্বারা কলুষিত করেনি” (৬ঃ ৮২) এ আয়াত নাযিল হলে রাসূলুল্লাহ্‌ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাহাবিগণ বললেন, ‘আমাদের মধ্যে এমন কে আছে যে যুলুম করে নি?’ তখন আল্লাহ্‌ তা’আলা এ আয়াত নাযিল করেনঃ (إِنَّ الشِّرْكَ لَظُلْمٌ عَظِيمٌ) “নিশ্চয়ই শির্‌ক চরম যুলুম।” (৩১ঃ ১৩) ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২৪ ',
        name: ' মুনাফিকের আলামত',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ৩২।',
            name:
                ' সুলায়মান আবূর রাবী’ (রহঃ) ... আবূ হুরায়রা (রাঃ) থেকে বর্ণনা করেন, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেনঃ মুনাফিকের আলামত তিনটিঃ ১. যখন কথা বলে মিথ্যা বলে ২. যখন ওয়াদা করে ভঙ্গ করে এবং ৩. আমানত রাখা হলে খেয়ানত করে।',
            ref: '',
          ),
          HadisNumberModel(
            id: '৩৩। ',
            name:
                'কাবীসা ইবনু ‘উকবা (রহঃ) ... আবদুল্লাহ‌ ইবনু ‘আমর (রাঃ) থেকে বর্ণিত, নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ চারটি স্বভাব যার মধ্যে থাকে সে হবে খাঁটি মুনাফিক। যার মধ্যে এর কোন একটি স্বভাব থাকবে, তা পরিত্যাগ না করা পর্যন্ত তার মধ্যে মুনাফিকের একটি স্বভাব থেকে যায়।১. আমানত রাখা হলে খেয়ানত করে২. কথা বললে মিথ্যা বলে৩. চুক্তি করলে ভঙ্গ করে এবং৪. বিবাদে লিপ্ত হলে অশ্লীল গালি দেয়।শু’বা (রহঃ) আ’মাশ (রহঃ) থেকে হাদীস বর্ণনায় সুফিয়ান (রহঃ) এর অনুসরণ করেছেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২৫',
        name: ' লায়লাতুল কদরে ইবাদতে রাত্রি জাগরণ ঈমানের অন্তর্ভুক্ত',
        hadisNumberList: [
          HadisNumberModel(
            id: '৩৪।',
            name:
                '  আবূল ইয়ামান (রহঃ) ... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, তিনি বলেন, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেনঃ যে ব্যাক্তি ঈমানের সাথে সওয়াবের আশায় লায়লাতুল কদর-এ ইবাদতে রাত্রি জাগরণ করবে, তার অতীতের গুনাহ্ মাফ করে দেওয়া হবে।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২৬',
        name: ' জিহাদ ঈমানের অন্তর্ভুক্ত',
        hadisNumberList: [
          HadisNumberModel(
            id: '',
            name:
                ' ৩৫। হারামীয়া ইবনু হাফস (রহঃ) .... আবূ যুর’আ ইবনু ‘আমর ইবনু জারীর (রহঃ) থেকে বর্ণনা করেন, তিনি বলেন, আমি আবূ হুরায়রা (রাঃ)-কে রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণনা করতে শুনেছি যে, তিনি ইরশাদ করেনঃ যে ব্যাক্তি আল্লাহর রাস্তায় বের হয়, যদি সে শুধু আল্লাহর উপর ঈমান এবং তাঁর রাসূলগণের প্রতি বিশ্বাসের কারনে বের হয়ে থাকে, তবে আল্লাহ্ তা’আলা ঘোষণা দেন যে, আমি তাকে ঘরে ফিরিয়ে আনব তার সওয়াব বা গনীমত (ও সওয়ার) সহ কিংবা তাকে জান্নাতে দাখিল করব। আর আমার উম্মতের উপর কষ্টদায়ক হবে বলে যদি মনে না করতাম তবে কোন সেনাদলের সাথে না গিয়ে বসে থাকতাম না। আমি অবশ্যই এটা পছন্দ করি যে, আল্লাহর রাস্তায় শহীদ হই, আবার জীবিত হই, আবার শহীদ হই, আবার জীবিত হই, আবার শহীদ হই।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২৭',
        name: ' রমযানের রাতে নফল ইবাদত ঈমানের অঙ্গ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৩৬।',
            name:
                ' ইসমা’ঈল (রহঃ) ... আবূ হুরায়রা (রাঃ) থেকে বর্ণনা করেন, তিনি বলেন, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেনঃ যে ব্যাক্তি রমযানের রাতে সওয়াবের আশায় রাত জেগে ইবাদত করে, তার পূর্বের গুনাহ্ মাফ করে দেওয়া হয়। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২৮ ',
        name: 'সওয়াবের আশায় রমযানের সিয়াম পালন ঈমানের অঙ্গ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৩৭। ',
            name:
                'ইবনু সালাম (রহঃ) ... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, তিনি বলেন, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেনঃ যে ব্যাক্তি ঈমানসহ সওয়াবের আশায় রমযানের সিয়াম পালন করে, তার পূর্বের গুনাহ মাফ করে দেওয়া হয়। ',
            ref: '',
          ),
        ]),
    PorichedModel(id: 'পরিচ্ছেদঃ ২৯ ', name: ' দ্বীন সহজ', hadisNumberList: [
      HadisNumberModel(
        id: '',
        name:
            'নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর বাণীঃ আল্লাহর নিকট সবচাইতে পসন্দনীয় হল দীন-ই হানীফিয়্যা যা সহজ সরল। ৩৮। আবদুস সালাম ইবনু মুতাহ্‌হার (রহঃ) ... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেনঃ নিশ্চয়ই দ্বীন সহজ-সরল। দ্বীন নিয়ে যে কড়াকড়ি করে দ্বীন তার উপর বিজয়ী হয়। কাজেই তোমরা মধ্যপন্থা অবলম্বন কর এবং (মধ্যপন্থার) নিকটবর্তী থাক, আশান্বিত থাক এবং সকাল-সন্ধ্যায় ও রাতের কিছু অংশে (ইবাদতের মাধ্যমে) আল্লাহর সাহায্য প্রার্থনা কর। ',
        ref: '',
      ),
    ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩০ ',
        name: 'সালাত ঈমানের অন্তর্ভুক্ত',
        hadisNumberList: [
          HadisNumberModel(
            id: '',
            name:
                ' আর আল্লাহর বাণীঃ (وَمَا كَانَ اللَّهُ لِيُضِيعَ إِيمَانَكُمْ) আল্লাহ এরূপ নন যে তোমাদের ঈমান ব্যর্থ করবেন- (সূরা আল-বাক্বারাঃ ১৪৩)। অর্থাৎ বায়তুল্লাহর নিকট (বায়তুল মুকাদ্দাসমুখী হয়ে) আদায় করা তোমাদের সালাতকে তিনি নষ্ট করবেন না।৩৯। ‘আমর ইবনু খালিদ (রহঃ) ... বারা ইবনু ‘আযিব (রাঃ) থেকে বর্ণিত যে, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মদিনায় হিজরত করে সর্বপ্রথম আনসারদের মধ্যে তাঁর নানাদের গোত্র [আবূ ইসহাক (রহঃ) বলেন] বা মামাদের গোত্রে এসে ওঠেন। তিনি ষোল-সতের মাস বায়তুল মুকাদ্দসের দিকে সালাত (নামায/নামাজ) আদায় করেন। কিন্তু তাঁর পছন্দ ছিল যে, তাঁর কিবলা বায়তুল্লাহ্‌র দিকে হোক। আর তিনি (বায়তুল্লাহ্‌র দিকে) প্রথম যে সালাত (নামায/নামাজ) আদায় করেন, তা ছিল আসরের সালাত (নামায/নামাজ) এবং তাঁর সঙ্গে একদল লোক উক্ত সালাত (নামায/নামাজ) আদায় করেন। তাঁর সঙ্গে যাঁরা সালাত (নামায/নামাজ) আদায় করেছিলেন তাঁদের একজন লোক বের হয়ে এক মসজিদে মুসল্লীদের কাছ দিয়ে যাচ্ছিলেন, তাঁরা তখন রুকু’র অবস্থায় ছিলেন।তখন তিনি বললেনঃ “আমি আল্লাহকে সাক্ষী রেখে বলছি যে, এইমাত্র আমি রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে মক্কার দিকে ফিরে সালাত (নামায/নামাজ) আদায় করে এসেছি। তখন তাঁরা যে অবস্থায় ছিলেন সে অবস্থায়ই বায়তুল্লাহ্‌র দিকে ঘুরে গেলেন। রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন বায়তুল মুকাদ্দাসের দিকে সালাত (নামায/নামাজ) আদায় করতেন তখন ইয়াহূদীদের ও আহলি কিতাবদের কাছে এটা খুব ভাল লাগত; কিন্তু তিনি যখন বায়তুল্লাহ্‌র দিকে (সালাত (নামায/নামাজ)-এর জন্য) তাঁর মুখ ফিরালেন তখন তারা এর প্রতি চরম অসন্তুষ্ট হল।যুহায়র (রহঃ) বলেন, আবূ ইসহাক (রহঃ) বারা (রাঃ) থেকে আমার কাছে যে হাদীস বর্ণনা করেছেন, তাতে এ কথাও রয়েছে যে, কিবলা পরিবর্তনের পূর্বে বেশ কিছু লোক ইন্তেকাল করেছিলেন এবং শহীদ হয়েছিলেন, তাঁদের ব্যাপারে আমরা কি বলব, বুঝতে পারছিলাম না, তখন আল্লাহ্ তা’আলা নাযিল করেনঃ (وَمَا كَانَ اللَّهُ لِيُضِيعَ إِيمَانَكُمْ) “আল্লাহ্ তা’আলা তোমাদের সালাত (নামায/নামাজ)-কে (যা বায়তুল মুকাদ্দাসের দিকে আদায় করা হয়েছিল) বিনষ্ট করবেন না।”',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩১',
        name: ' উত্তমরূপে ইসলাম গ্রহন',
        hadisNumberList: [
          HadisNumberModel(
            id: '',
            name:
                'মালিক (রহঃ) ... আবূ সা’ঈদ খুদরী (রাঃ) বর্ণনা করেন যে, তিনি রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে বলতে শুনেছেন, বান্দা যখন ইসলাম গ্রহণ করে এবং তার ইসলাম উত্তম হয়, আল্লাহ্ তা’আলা তার আগের সব গুনাহ্ মাফ করে দেন। এরপর শুরু হয় প্রতিদান; একটি সৎ কাজের বিনিময়ে দশ গুণ থেকে সাতশ গুণ পর্যন্ত; আর একটি মন্দ কাজের বিনিময়ে ঠিক ততটুকু মন্দ প্রতিফল। অবশ্য আল্লাহ্ যদি মাফ করে দেন তবে ভিন্ন কথা।৪০। ইসহাক ইবনু মানসূর (রহঃ) ... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ্‌ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেনঃ তোমাদের মধ্যে কেউ যখন উত্তমরূপে ইসলামের উপর কায়েম থাকে তখন সে যে নেক আমল করে তার প্রত্যেকটির বিনিময়ে সাতশ গুণ পর্যন্ত (সওয়াব) লেখা হয়। আর সে যে মন্দ কাজ করে তার প্রত্যেকটির বিনিময়ে তার জন্য ঠিক ততটুকুই মন্দ লেখা হয়। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩২ ',
        name:
            'আল্লাহ্‌ তা\'আলার কাছে সবচাইতে পছন্দনীয় আমল সেটাই যা নিয়মিত করা হয়',
        hadisNumberList: [
          HadisNumberModel(
            id: '৪১।',
            name:
                ' মুহাম্মদ ইবনুল মূসান্না (রহঃ) ... ‘আয়িশা (রাঃ) থেকে বর্ণিত যে, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একবার তাঁর কাছে আসেন, তাঁর নিকট এক মহিলা ছিলেন। রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জিজ্ঞাসা করলেনঃ ‘ইনি কে? আয়িশা (রাঃ) উত্তর দিলেন অমুক মহিলা, এ বলে তিনি তাঁর সালাত (নামায/নামাজ)-এর উল্লেখ করলেন। রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ ‘থাম, তোমরা যতটুকু সামর্থ্য রাখ, ততটুকুই তোমাদের করা উচিৎ। আল্লাহর কসম! আল্লাহ্ তা’আলা ততক্ষন পর্যন্ত (সওয়াব দিতে) বিরত হন না, যতক্ষন না তোমরা নিজেরা ক্লান্ত হয়ে পড়। আল্লাহর কাছে সবচাইতে পছন্দনীয় আমল তা-ই, যা আমলকারী নিয়মিত করে থাকে। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩৩ ',
        name: 'ঈমানের বাড়া-কমা।',
        hadisNumberList: [
          HadisNumberModel(
            id: '',
            name:
                'আল্লাহ্‌ তা\'আলার বাণীঃ আমি তাঁদের হিদায়াত বাড়িয়ে দিয়েছিলাম (১৮ঃ ৩৩) যাতে মুমিনদের ঈমান আরো বেড়ে যায় (৭৪ঃ ৩১) তিনি আরও ইরশাদ করেন, আজ আমি তোমাদের জন্য তোমাদের দ্বীন পূর্ণাংগ করে দিলাম (৫ঃ ৩) পূর্ণ জিনিস থেকে কিছু বাদ দেয়া হলে তা অসম্পূর্ণ হয়।৪২। মুসলিম ইবনু ইবরাহীম (রহঃ) ... আনাস (রাঃ) থেকে বর্ণনা করেন, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেনঃ যে ‘লা-ইলাহা ইল্লাল্লাহ বলবে আর তার অন্তরে একটি যব পরিমানও নেকী থাকবে, তাকে জাহান্নাম থেকে বের করা হবে এবং যে এবং যে‘লা-ইলাহা ইল্লাল্লাহ বলবে আর তার অন্তরে একটি গম পরিমানও নেকী থাকবে তাকে জাহান্নাম থেকে বের করা হবে এবং যে ‘লা-ইলাহা ইল্লাল্লাহ বলবে আর তার অন্তরে একটি অণু পরিমাণও নেকী থাকবে তাকে জাহান্নাম থেকে বের করা হবে।ইমাম আবূ ‘আবদুল্লাহ মুখারী (রহঃ) বলেন, আবান (রহঃ) কাতাদা (রহঃ) আনাস (রাঃ) রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে নেকী (خَيْر) এর স্থলে ‘ঈমান’ শব্দটি রিওয়ায়েত করেছেন। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '৪৩।',
            name:
                ' হাসান ইবনুুস সাব্বাহ্ (রহঃ) ... ‘উমর ইবনুল খাত্তাব (রাঃ) থেকে বর্ণনা করেন, এক ইয়াহূদী তাঁকে বললঃ হে আমীরুল মু‘মিনীন! আপনাদের কিতাবে একটি আয়াত আছে যা আপনারা পাঠ করে থাকেন, তা যদি আমাদের ইয়াহূদী জাতির উপর নাযিল হত, তবে অবশ্যই আমরা সে দিনকে ঈদ হিসেবে পালন করতাম। তিনি বললেন, কোন আয়াত? সে বললঃ الْيَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ وَأَتْمَمْتُ عَلَيْكُمْ نِعْمَتِي وَرَضِيتُ لَكُمُ الإِسْلاَمَ دِينًا“আজ তোমাদের জন্য তোমাদের দ্বীন পূর্ণাঙ্গ করলাম ও তোমাদের প্রতি আমার নিয়ামত সম্পূর্ণ করলাম এবং ইসলামকে তোমাদের দ্বীন মনোনীত করলাম।” (৫ : ৩) ‘উমর (রাঃ) বললেন এটি যে দিন এবং যে স্থানে রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর উপর নাযিল হয়েছিল তা আমরা জানি; তিনি সেদিন ‘আরাফায় দাঁড়িয়েছিলেন এবং তা ছিল জুম‘আর দিন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩৪ ',
        name: ' যাকাত ইসলামের অঙ্গ।',
        hadisNumberList: [
          HadisNumberModel(
            id: '',
            name:
                ' আল্লাহ্‌ তা\'আলার বাণীঃ তাঁরা তো আদিষ্ট হয়েছিল আল্লাহর অনুগত্য বিশুদ্ধচিত্ত হয়ে একনিষ্ঠভাবে তাঁর ইবাদত করতে এবং সালাত কায়েম করতে, যাকাত দিতে। আর এ-ই সঠিক দ্বীন (৯৮ঃ ৫)৪৪। ইসমা’ঈল (রহঃ) ... তালহা ইবনু উবায়দুল্লাহ্ (রাঃ) থেকে বর্ণিত, তিনি বলেন, নাজ্‌দবাসী এক ব্যাক্তি রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এলো। তার মাথার চুল ছিল এলোমেলো। আমরা তার কথার মৃদু আওয়াজ শুনতে পাচ্ছিলাম, কিন্তু সে কি বলছিল, আমরা তা বুঝতে পারছিলাম না। এভাবে সে কাছে এসে ইসলাম সম্পর্কে প্রশ্ন করতে লাগল। রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ দিন-রাতে পাঁচ ওয়াক্ত সালাত (নামায/নামাজ)। সে বলল, ‘আমার উপর এ ছাড়া আরো সালাত (নামায/নামাজ) আছে?’ তিনি বললেনঃ ‘না, তবে নফল আদায় করতে পার। রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ আর রমযানের সিয়াম। সে বলল, ‘আমার উপর এ ছাড়া আরো সাওম (রোযা/রোজা/সিয়াম/ছিয়াম) আছে? তিনি বললেনঃ না, তবে নফল আদায় করতে পার। বর্ণনাকারী বলেন, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার কাছে যাকাতের কথা বললেন। সে বলল, ‘আমার ওপর এ ছাড়া আরো দেয় আছে? তিনি বললেনঃ না, তবে নফল হিসেবে দিতে পার। বর্ণনাকারী বলেন, সে ব্যাক্তি এই বলে চলে গেলেন, ‘আল্লাহর কসম! আমি এর চেয়ে বেশিও করব না এবং কমও করব না। তখন রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ সে সফলকাম হবে যদি সত্য বলে থাকে।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩৫ ',
        name: 'জানাযার অনুগমন ঈমানের অঙ্গ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৪৫।',
            name:
                ' আহমদ ইবনু ‘আবদুল্লাহ ইবনু ‘আলী আল-মানজূফী (রহঃ) ... আবূ হুরায়রা (রাঃ) থেকে বর্ণনা করেন যে, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেনঃ যে ব্যাক্তি ঈমানের সাথে ও সওয়াবের আশায় কোন মুসলিমের জানাযায় অনুগমন করে এবং তার সালাত (নামায/নামাজ)-ই জানাযা আদায় ও দাফন সম্পন্ন হওয়া পর্যন্ত সাথে থাকে, সে দুই কীরাত সওয়াব নিয়ে ফিরবে। প্রতিটি কীরাত হল উহুদ পর্বতের মতো। আর যে ব্যাক্তি শুধু জানাযা আদায় করে, তারপর দাফন সম্পন্ন হওয়ার আগেই চলে আসে, সে এক কীরাত সওয়াব নিয়ে ফিরবে।‘উসমান আল-মুয়াযযিন (রহঃ) ... আবূ হুরায়রা (রাঃ) সূত্রে রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে অনুরূপ হাদীস বর্ণনা করেছেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩৬',
        name: ' অজ্ঞাতসারে মুমিনের আমল নষ্ট হওয়ার আশংকা',
        hadisNumberList: [
          HadisNumberModel(
            id: '',
            name:
                'ইবরাহিম তায়মী (রহঃ) বলেনঃ আমার আমলের সাথে যখন আমার কথা তুলনা করি, তখন আশঙ্কা হয়, আমি না মিথ্যাবাদী হই। ইবনু আবূ মুলায়কা (রহঃ) বলেন, আমি নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর এমন ত্রিশজন সাহাবীকে পেয়েছি, যারা সবাই নিজেদের সম্পর্কে নিফাকের ভয় করতেন। তাঁরা কেউ এ কথা বলতেন না যে, তিনি জিবরীল (আঃ) ও মীকাঈল (আঃ) এর তুল্য ঈমানের অধিকারী। হাসান বসরী (রহঃ) থেকে বর্ণিত, নিফাকের ভয় মু\'মিনই করে থাকে। আর কেবল মুনাফিকই তা থেকে নিশ্চিত থাকে। তউবা না করে পরস্পর লড়াই করা ও পাপাচারে লিপ্ত হওয়া থেকে সতর্ক থাকা। কারন আল্লাহ্‌ তা\'আলা বলেনঃ (وَلَمْ يُصِرُّوا عَلَى مَا فَعَلُوا وَهُمْ يَعْلَمُونَ) এবং তাঁরা (মুত্তাকিরা) যা করে ফেলে, জেনে শুনে তাঁর (গুনাহর) পুনরাবৃতি করে না (৩ঃ ১৩৫)৪৬। মুহাম্মদ ইবনু ‘আর ‘আরা (রহঃ) ... যুবায়দ (রহঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি আবূ ওয়াইল (রহঃ)-কে মুরজিআ[১] সম্পর্কে জিজ্ঞাসা করলাম, তিনি বললেন, ‘আবদুল্লাহ ইবনু মাস’উদ) আমার কাছে বর্ণনা করেছেন যে, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেছেনঃ মুসলিমকে গালি দেওয়া ফাসিকী এবং তার সাথে লড়াই করা কুফরী।[১] একটি বাতিল ফিরকা, যাদের মত হল, ভাল হোক বা মন্দ কোন আমলের মূল্য নেই এবং ইমান আনার পর কোন গুনাহ ক্ষতিকর নয়। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '৪৭। ',
            name:
                'কুতায়বা ইবনু সা’ঈদ (রহঃ) ... ‘উবাদা ইবনু সামিত (রাঃ) বর্ণনা করেন যে, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম লায়লাতুল কদ্‌র সম্পর্কে খবর দেওয়ার জন্য বের হলেন। তখন দু’জন মুসলিম পরস্পর বিবাদ করছিল। তিনি বললেনঃ আমি তোমাদের লায়লাতুল কদ্‌র সম্পর্কে খবর দেওয়ার জন্য বেরিয়েছিলাম; কিন্তু তখন অমুক অমুক বিবাদে লিপ্ত থাকায় তা (নির্দিষ্ট তারিখ সম্পর্কিত জ্ঞান) উঠিয়ে নেওয়া হয়েছে। আর হয়তো বা এটাই তোমাদের জন্য কল্যাণকর হবে। তোমরা তা অনুসন্ধান কর ২৭, ২৯ ও ২৫ তম রাতে। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩৭ ',
        name:
            ' জিবরীল (আঃ) কর্তৃক রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে ঈমান, ইসলাম, ইহসান ও কিয়ামতের জ্ঞান সম্পর্কে প্রশ্ন',
        hadisNumberList: [
          HadisNumberModel(
            id: '',
            name:
                ' জিবরীল (আঃ) কর্তৃক রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে ঈমান, ইসলাম, ইহসান ও কিয়ামতের জ্ঞান সম্পর্কে প্রশ্ন আর তাকে দেওয়া রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর উত্তর। তারপর তিনি বললেনঃ জিবরীল (আঃ) তোমাদের দ্বীন শিক্ষা দিতে এসেছিলেন। তিনি এসব বিষয়কে দ্বীন বলে আখ্যায়িত করেছেন। ঈমান সম্পর্কে আব্দুল কায়স গোত্রের প্রতিনিধি দলকে রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যে বিবরন দিয়েছেন এবং আল্লাহ্‌ তা\'আলা ইরশাদ করেছেনঃ (وَمَنْ يَبْتَغِ غَيْرَ الإِسْلاَمِ دِينًا فَلَنْ يُقْبَلَ مِنْهُ) কেউ ইসলাম ব্যাতিত অন্য কোন দ্বীন গ্রহন করতে চাইলে তা কখনো কবুল করা হবে না (৩ঃ ৮৫)৪৮। মূসা’দ্দাদ (রহঃ) ... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, তিনি বলেন, একদিন রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জনসমুক্ষে বসা ছিলেন, এমন সময় তাঁর কাছে এক ব্যাক্তি এসে জিজ্ঞাসা করলেন ‘ঈমান কি?’ তিনি বললেনঃ ‘ঈমান হল, আপনি বিশ্বাস রাখবেন আল্লাহর প্রতি, তাঁর ফিরিশতাগণের প্রতি, (কিয়ামতের দিন) তাঁর সঙ্গে সাক্ষাতের প্রতি এবং তাঁর রাসূলগণের প্রতি। আপনি আরো বিশ্বাস রাখবেন পুনরুত্থানের প্রতি। তিনি জিজ্ঞাসা করলেন, ‘ইসলাম কি?’ তিনি বললেনঃ ‘ইসলাম হল, আপনি আল্লাহর ইবাদত করবেন এবং তাঁর সঙ্গে শরীক করবেন না, সালাত (নামায/নামাজ) কায়েম করবেন, ফরয যাকাত আদায় করবেন এবং রমযানের সাওম (রোযা/রোজা/সিয়াম/ছিয়াম) পালন করবেন। ঐ ব্যাক্তি জিজ্ঞাসা করলেন, ‘ইহসান কি?’ তিনি বললেনঃ ‘আপনি এমন ভাবে আল্লাহর ইবাদত করবেন যেন আপনি তাঁকে দেখছেন, আর যদি আপনি তাঁকে দেখতে না পান তবে (বিশ্বাস রাখবেন যে,) তিনি আপনাকে দেখছেন।ঐ ব্যাক্তি জিজ্ঞাসা করলেন, ‘কিয়ামত কবে?’ তিনি বললেনঃ ‘এ ব্যাপারে যাকে জিজ্ঞাসা করা হচ্ছে, তিনি জিজ্ঞাসাকারী অপেক্ষা বেশি জানেন না। তবে আমি আপনাকে কিয়ামতের আলামতসমূহ বলে দিচ্ছিঃ বাঁদী যখন তার প্রভুকে প্রসব করবে এবং উটের নগণ্য রাখালেরা যখন বড় বড় অট্টালিকা নির্মাণে প্রতিযোগিতা করবে। (কিয়ামতের বিষয়) সেই পাঁচটি জিনিসের অন্তর্ভূক্ত, যা আল্লাহ্ ছাড়া কেউ জাননা। এরপর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এই আয়াতটি শেষ পর্যন্ত তিলাওয়াত করলেনঃ (إِنَّ اللَّهَ عِنْدَهُ عِلْمُ السَّاعَةِ‏) “কিয়ামতের জ্ঞান কেবল আল্লাহই নিকট।” (৩১ : ৩৪) এরপর ঐ ব্যাক্তি চলে গেলে তিনি বললেনঃ ‘তোমরা তাকে ফিরিয়ে আন।’ তারা কিছুই দেখতে পেল না। তখন তিনি বললেন, ‘ইনি জিবরীল আলাইহিস সালাম। লোকদের দ্বীন শেখাতে এসেছিলেন। আবূ আব্দুল্লাহ বুখারী (রহঃ) বলেন, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এসব বিষয়কে ঈমানের অন্তর্ভুক্ত করেছেন৷',
            ref: '',
          ),
        ]),
    PorichedModel(id: ' পরিচ্ছেদঃ ৩৮', name: ' পরিচ্ছদ নেই', hadisNumberList: [
      HadisNumberModel(
        id: '',
        name:
            ' ৪৯। ইবরাহীম ইবনু হামাযা (রহঃ) ... আবদুল্লাহ ইবনু আব্বাস (রাঃ) থেকে বর্ণিত, তিনি বলেনঃআবূ সুফিয়ান ইবনু হারব আমার কাছে বর্ণনা করেন যে, হিরাকল তাঁকে বলেছিলেন, আমি তোমাকে জিজ্ঞাসা করেছিলাম তারা (ঈমানদারগণ) সংখ্যায় বাড়ছে না কমছে? তুমি উত্তর দিয়েছিলে, তারা সংখ্যায় বাড়ছে। প্রকৃতপক্ষে ঈমানের ব্যাপার এরূপই থাকে যতক্ষণ না তা পূর্ণতা লাভ করে। আর আমি তোমাকে জিজ্ঞাসা করেছিলাম, কেউ তাঁর দ্বীন গ্রহণ করার পর তা অপছন্দ করে মুরতাদ হয়ে যায় কি-না? তুমি জবাব দিয়েছ, ‘না।’ প্রকৃত ঈমান এরূপই, ঈমানের স্বাদ অন্তরের সাথে মিশে গেলে কেউ তা অপছন্দ করে না।',
        ref: '',
      ),
    ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩৯',
        name: ' দ্বীন রক্ষাকারীর ফজিলত',
        hadisNumberList: [
          HadisNumberModel(
            id: '৫০। আবূ নু’আয়ম (রহঃ) ... নু’মান ইবনু বশীর (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি যে, ‘হালালও স্পষ্ট এবং হারামও স্পষ্ট। আর এ দু’য়ের মাঝে রয়েছে বহু সন্দেহজনক বিষয়- যা অনেকেই জানেনা। যে ব্যাক্তি সেই সন্দেহজনক বিষয়সমূহ থেকে বেঁচে থাকবে, সে তার দ্বীন ও মর্যাদা রক্ষা করতে পারবে। আর যে সন্দেহজনক বিষয়সমূহে লিপ্ত হয়ে পড়ে, উদহারন সে রাখালের ন্যায়, যে তার পশু বাদশাহ্‌র সংরক্ষিত চারণভুমির আশে পাশে চরায়, অচিরেই সেগুলো সেখানে ঢুকে পড়ার আশংকা রয়েছে। জেনে রাখ যে, প্রত্যেক বাদশাহ্‌রই একটি সংরক্ষিত এলাকা রয়েছে। আরো জেনে রাখ যে, আল্লাহর যমীনে তাঁর সংরক্ষিত এলাকা হল তাঁর নিষিদ্ধ কাজসমূহ। জেনে রাখ, শরীরের মধ্যে একটি গোশতের টুকরা আছে, তা যখন ঠিক হয়ে যায়, গোটা শরীরই তখন ঠিক হয়ে যায়। আর তা যখন খারাপ হয়ে যায়, গোটা শরীরই তখন খারাপ হয়ে যায়। জেনে রাখ, সে গোশতের টুকরোটি হল কলব।',
            name: ' ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৪০ ',
        name: 'গণীমতের এক পঞ্চমাংশ প্রদান ঈমানের অন্তর্ভুক্ত',
        hadisNumberList: [
          HadisNumberModel(
            id: '৫১। ',
            name:
                ' আলী ইবনুল জা’দ (রহঃ) ... আবূ জামরা (রহঃ) থেকে বর্ণিত, তিনি বলেন, আমি ইবনু আব্বাস (রাঃ) এর সঙ্গে বসতাম্ তিনি আমাকে তাঁর আসনে বসাতেন। একবার তিনি বললেনঃ তুমি আমার কাছে থেকে যাও, আমি তোমাকে আমার সম্পদ থেকে কিছু অংশ দেব। আমি দু’ মাস তাঁর সঙ্গে অবস্থান করলাম। তারপর একদিন তিনি বললেন, আবদুল কায়েসের একটি প্রতিনিধি দল রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে আসলে তিনি জিজ্ঞাসা করলেনঃ তোমরা কোন্ কওমের? অথবা কোন্ প্রতিনিধিদলের? তারা বলল, রাবী‘আ গোত্রের।’ তিনি বললেনঃ মারহাবা সে গোত্র বা সে প্রতিনিধি দলের প্রতি, যারা অপদস্থ ও লজ্জিত না হয়েই এসেছে। তারা বলল, ইয়া রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিষিদ্ধ মাসসমূহ ছাড়া অন্য কোন সময় আমরা আপনার কাছে আসতে পারি না। (কারন) আমাদের এবং আপনার মাঝখানে মুযার গোত্রীয় কাফিরদের বাস। তাই আমাদের কিছু স্পষ্ট হুকুম দিন, যাতে আমরা যাদের পিছনে রেখে এসেছি তাদের জানিয়ে দিতে পারি এবং যাতে আমরা জান্নাতে প্রবেশ করতে পারি।তারা পানীয় সম্পর্কেও জিজ্ঞাসা করল। তখন তিনি তাদের চারটি জিনিসের নির্দেশ এবং চারটি জিনিস থেকে নিষেধ করলেন। তাদের এক আল্লাহর প্রতি ঈমান আনার আদেশ দিয়ে বললেনঃ ‘এক আল্লাহ প্রতি ঈমান আনা কিভাবে হয় তা কি তোমরা জানো?’ তাঁরা বলল, ‘আল্লাহ ও তাঁর রাসূলই ভাল জানেন।’ তিনি বললেনঃ ‘তা হল এ সাক্ষ্য দেওয়া যে, আল্লাহ্ ছাড়া ইলাহ্ নেই এবং মুহাম্মদ আল্লাহর রাসূল এবং সালাত (নামায/নামাজ) কায়েম করা, যাকাত দেওয়া, রমযানের সিয়াম পালন করা; আর তোমরা গণীমতের মাল থেকে এক-পঞ্চমাংশ প্রদান করবে। তিনি তাদেরকে চারটি জিনিস থেকে নিষেধ করলেন। তা হলঃ সবুজ কলসী, শুকনো লাউয়ের খোল, খেজুর গাছের গুঁড়ি থেকে তৈরীকৃত পাত্র এবং আলকাতরার পালিশকৃত পাত্র। রাবী বলেন, বর্ণনাকারী (مزفت এর স্থলে) কখনওالمقير উল্লেখ করেছেন (উভয় শব্দের অর্থ একই)। তিনি আরো বলেন, তোমরা এগুলো ভালো করে আয়ত্ত করে নাও এবং অন্যদেরও এগুলি জানিয়ে দিও।১. এ পাত্রগুলিতে সে সময় মদ প্রস্তুত করা হত।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৪১',
        name:
            ' আমল নিয়ত ও সওয়াব আশা অনুযায়ী প্রত্যেক মানুষের প্রাপ্য তার নিয়ত অনুযায়ী।',
        hadisNumberList: [
          HadisNumberModel(
            id: '',
            name:
                'অতএব ঈমান, উযূ, সালাত, যাকাত, হাজ্জ, সিয়াম এবং অন্যান্য আহকাম সবই সবই এর অন্তর্ভুক্ত। আল্লাহ তা‘আলা বলেনঃ (قُلْ كُلٌّ يَعْمَلُ عَلَى شَاكِلَتِهِ) ‘‘বলুন প্রত্যেকেই আপন স্বভাব অনুসারে কর্ম সম্পাদন করে থাকে।’’ (সূরা আল-ইসরাঃ ৮৪)شَاكِلَتِهِ অর্থাৎ নিয়ত অনুযায়ী। মানুষ তার পরিবারের জন্য সাওাবের নিয়তে যা খরচ করে, তা সদাক্বাহ। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, (এখন মক্কা হতে হিজরাত নেই) তবে কেবল জিহাদ ও নিয়্যাত অবশিষ্ট রয়েছে।৫২। আবদুল্লাহ ইবনু মাসলাম (রহঃ) ... ‘উমর (রাঃ) থেকে বর্ণিত, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ কাজ নিয়তের সাথে সম্পর্কিত এবং প্রত্যেক মানুষের প্রাপ্য তার নিয়ত অনুযায়ী। অতএব যার হিজরত হবে আল্লাহ্ ও তাঁর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর উদ্দেশ্যে, তার হিজরত আল্লাহ্ ও তাঁর রাসূল -এর উদ্দেশ্যে হয়েছে বলেই গণ্য হবে। আর যার হিজরত হয় দুনিয়া হাসিলের জন্য বা কোন নারীকে বিয়ে করার জন্য, তার হিজরত সে উদ্দেশ্যেই গণ্য হবে যে উদ্দেশ্যে সে হিজরত করেছে। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '৫৩। ',
            name:
                'হাজ্জাজ ইবনু মিনহাল (রহঃ) ... আবূ মাসউদ (রাঃ) থেকে বর্ণিত, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ মানুষ তার পরিবারের জন্য সওয়াবের নিয়তে যখন খরচ করে তখন তা হয় তার সদকা স্বরূপ। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '৫৪। ',
            name:
                ' হাকাম ইবনু নাফি’ (রহঃ) ... সা’দ ইবনু আবূ ওয়াক্কাস (রাঃ) থেকে বর্ণিত, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ ‘তুমি আল্লাহর সন্তুষ্টি লাভের আশায় যা-ই খরচ কর না কেন, তোমাকে তার সওয়াব অবশ্যই দেওয়া হবে। এমনকি তুমি তোমার স্ত্রীর মুখে যা তুলে দাও, তারও।’',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৪২',
        name:
            'নাবী (ﷺ) এর বানীঃ দ্বীন হল কল্যাণ কামনা করা, আল্লাহর রেজমন্দির জন্য, তাঁর রাসুলের জন্য, মুসলিম নেত্রীবৃন্দের জন্য এবং সকল মুসলিমের জন্য।',
        hadisNumberList: [
          HadisNumberModel(
            id: '',
            name:
                'আল্লাহ্ তা‘আলার বাণীঃ إِذَا نَصَحُوا لِلَّهِ وَرَسُولِهِ‘যদি আল্লাহ্ ও তাঁর রাসূলের প্রতি তাদের অবিমিশ্র অনুরাগ থাকে। (সূরা তাওবাঃ ৯১)৫৫। মূসা’দ্দাদ (রহঃ) ... জারীর ইবনু আবদুল্লাহ আল বাজলী (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর হাতে বায়’আত গ্রহণ করেছি সালাত (নামায/নামাজ) কায়েম করার, যাকাত দেওয়ার এবং সকল মুসলিমের কল্যাণ কামনা করার। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '৫৬। ',
            name:
                'আবূ নু‘মান (রহঃ) ... যিয়াদ ইবনু ‘ইলাকা (রহঃ) থেকে বর্ণিত, তিনি বলেনঃ মুগীরা ইবনু শু’বা (রাঃ)১ যেদিন ইন্তেকাল করেন সেদিন আমি জারীর ইবনু আবদুল্লাহ (রাঃ) এর কাছ থেকে শুনেছি, তিনি (মিম্বরে) দাঁড়িয়ে আল্লাহর হামদ ও সানা বর্ণনা করে বললেন, তোমরা ভয় কর এক আল্লাহকে যাঁর কোন শরীক নাই, এবং নতুন কোন আমীর না আসা পর্যন্ত শান্তি-শৃঙ্খলা বজায় রাখ, অনতিবিলম্বে তোমাদের আমীর আসবেন। এরপর জারীর (রাঃ) বললেন, তোমাদের আমীরের জন্য মাগফিরাত কামনা কর, কেননা তিনি ক্ষমা করা ভালবাসতেন। তারপর বললেন, একবার আমি রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এসে বললাম, আমি আপনার কাছে ইসলামের বায়’আয় গ্রহণ করতে চাই। তিনি (অন্যান্য বিষয়ের সাথে) আমার উপর শর্ত আরোপ করলেনঃ আর সকল মুসলিমের কল্যাণ কামনা করবে। তারপর আমি তাঁর কাছে এ শর্তের উপর বায়’আত গ্রহণ করলাম। এ মসজিদের রবের কসম! আমি তোমাদের কল্যাণকামী। এরপর তিনি আল্লাহর কাছে মাগফিরাত কামনা করলেন এবং (মিম্বর থেকে) নেমে গেলেন।১. বিখ্যাত সাহাবী। তিনি কূফার আমীর ছিলেন। ',
            ref: '',
          ),
        ]),
  ];
  List<PorichedModel> chapterThree = [
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৪৪',
        name:
            'আলোচনায় মশগুল অবস্থায় ইলম সম্পর্কে জিজ্ঞাসা করা হলে আলোচনা শেষ করার পর প্রশ্নকারীর উত্তর প্রদান ইসলামি',
        hadisNumberList: [
          HadisNumberModel(
            id: '',
            name:
                ' ৪৩. ইলমের ফযীলত আল্লাহ তা‘আলার বাণীঃ يَرْفَعْ اللهُ الَّذِينَ آمَنُوا مِنْكُمْ وَالَّذِينَ أُوتُوا الْعِلْمَ دَرَجَاتٍ وَاللهُ بِمَا تَعْمَلُونَ خَبِيرٌতোমাদের মধ্যে যারা ঈমান এনেছে এবং যাদের ইলম দান করা হয়েছে আল্লাহ্‌ তাদের মর্যাদায় উন্নত করবেন; তোমরা যা কর আল্লাহ্‌ সে সম্পর্কে সবিশেষ অবহিত। (৫৮ঃ ১১)।মহান আল্লাহ্‌র বাণীঃرَبِّ زِدْنِي عِلْمًاহে আমার রব! আমার জ্ঞানের বৃদ্ধি সাধন কর। (২০ঃ ১১৪)৫৭। মুহাম্মদ ইবনু সিনান (রহঃ) ও ইবরাহীম ইবনুল মুনযির (রহঃ) ... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ একবার রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মজলিসে লোকদের সামনে কিছু আলোচনা করছিলেন। ইতিমধ্যে তাঁর কাছে একজন বেদু্ঈন এসে প্রশ্ন করলেন, কিয়ামত কবে হবে? রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর আলোচনায় রত রইলেন। এতে কেউ কেউ বললেন, লোকটি যা বলেছে তিনি তা শুনেছেন কিন্তু তার কথা পছন্দ করেন নি। আর কেউ কেউ বললেন বরং তিনি শুনতেই পান নি। রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আলোচনা শেষ করে বললেনঃ কিয়ামত সম্পর্কে প্রশ্নকারী লোকটি কোথায়? সে বলল, এই যে আমি, ইয়া রাসূলাল্লাহ! তিনি বললেনঃ যখন আমানত নষ্ট করা হয় তখন কিয়ামতের প্রতীক্ষা করবে। সে বলল, কিভাবে আমানত নষ্ট করা হয়? তিনি বললেনঃ যখন কোন কাজের দায়িত্ব অনুপযুক্ত লোকের প্রতি ন্যাস্ত হয়, তখন তুমি কিয়ামতের প্রতীক্ষা করবে।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৪৫',
        name: ' উচ্চস্বরে ইলমের আলচনা',
        hadisNumberList: [
          HadisNumberModel(
            id: '৫৮। ',
            name:
                'আবূ’ন নু’মান (রহঃ) ... আবদুল্লাহ ইবনু ‘আমর (রাঃ) থেকে বর্ণিত, তিনি বলেন, এক সফরে রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের পেছনে রয়ে গেলেন। পরে তিনি আমাদের কাছে পৌঁছলেন, এদিকে আমরা (আসরের) সালাত (নামায/নামাজ) আদায় করতে দেরী করে ফেলেছিলাম এবং আমরা উযূ (ওজু/অজু/অযু) করছিলাম। আমরা আমাদের পা কোনমতে পানি দিয়ে ভিজিয়ে নিচ্ছিলাম। তিনি উচ্চস্বরে বললেনঃ পায়ের গোড়ালিগুলোর (শুষ্কতার) জন্য জাহান্নামের শাস্তি রয়েছে। তিনি দু’বার বা তিনবার এ কথা বললেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৪৬/',
        name: ' মুহাদ্দিসের উক্তিঃ হাদ্দাসানা, আখবারানা ও আম্বা\'আনা',
        hadisNumberList: [
          HadisNumberModel(
            id: '',
            name:
                ' হুমাইদী (রহ.) বর্ণনা করেন যে, ইবনু ‘উয়াইনাহ (রহঃ)-এর মতে حَدَّثَنَا وَأَخْبَرَنَا وَأَنْبَأَنَا وَسَمِعْتُ একই অর্থবোধক। ইবনু মাস‘ঊদ (রাঃ) বলেন, حَدَّثَنَا رَسُولُ اللهِ صلى الله عليه وسلم وَهُوَ الصَّادِقُ الْمَصْدُوقُ আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের নিকট হাদীস বর্ণনা করেছেন; আর তিনি সত্যবাদী এবং সত্যবাদীরূপে স্বীকৃত।’শাকীক (রহঃ) ‘আবদুল্লাহ্ (রাঃ) থেকে বর্ণনা করেন, سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم كَلِمَةً ‘আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে এরূপ উক্তি শুনেছি’...।হুযাইফাহ (রাঃ) বলেন, حَدَّثَنَا رَسُولُ اللهِ حَدِيثَيْنِ ‘আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের নিকট দু’টি হাদীস বর্ণনা করেছেন।’আবুল ‘আলিয়াহ (রহঃ) ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণনা করেন, يَرْوِي عَنْ رَبِّهِ عَنِ النَّبِيِّ صلى الله عليه وسلم ‘নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে, তিনি তাঁর রব থেকে বর্ণনা করেন’...।আনাস (রাঃ) বলেন, عَنِ النَّبِيِّ صلى الله عليه وسلم فِيمَا يَرْوِيهِ عَنْ رَبِّهِ عَزَّ وَجَلَّ ‘নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে, তিনি বর্ণনা করেন তাঁর রব থেকে’....।আবূ হুরাইরাহ (রাঃ) বলেন, عَنِ النَّبِيِّ صلى الله عليه وسلم يَرْوِيهِ عَنْ رَبِّكُمْ عَزَّ وَجَلَّ ‘নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে, তিনি তোমাদের মহিমাময় ও সুমহান প্রতিপালক থেকে বর্ণনা করেন’...।৫৯। কুতায়বা ইবনু সা’ঈদ (রহঃ) ... ইবনু ‘উমর (রাঃ) থেকে বর্ণিত, তিনি বলেন, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একবার বললেনঃ গাছপালার মধ্যে এমন একটি গাছ আছে যার পাতা ঝরে না। আর তা মুসলিমের উপমা। তোমরা আমাকে বল, ‘সেটি কি গাছ?’ রাবী বলেন, তখন লোকেরা জঙ্গলের বিভিন্ন গাছ-পালার নাম চিন্তা করতে লাগল। আবদুল্লাহ (রাঃ) বলেন, ‘আমার মনে হল, সেটা হবে খেজুর গাছ।’ কিন্তু আমি তা বলতে লজ্জাবোধ করছিলাম। তারপর সাহাবায়ে কিরাম (রাঃ) বললেন, ‘ইয়া রাসূলাল্লাহ! আপনি আমাদের বলে দিন সেটি কি গাছ? তিনি বললেনঃ তা হল খেজুর গাছ।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৪৭ ',
        name: ' শাগরিদগনের জ্ঞান পরীক্ষার জন্য উস্তাদের কোন বিষয় উত্থাপন করা',
        hadisNumberList: [
          HadisNumberModel(
            id: '৬০।',
            name:
                ' খালিদ ইবনু মাখলাদ (রহঃ) ... ইবনু উমর (রাঃ) থেকে বর্ণিত যে, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একবার বললেনঃ গাছ-পালার মধ্যে এমন একটি গাছ আছে যার পাতা ঝরে না। আর তা মুসলিমের উপমা। তোমরা আমাকে বল দেখি সেটি কি গাছ? রাবী বলেন, তখন লোকেরা জঙ্গলের বিভিন্ন গাছ-পালার নাম চিন্তা করতে লাগল। আবদুল্লাহ (রাঃ) বলেন, ‘আমার মনে হল, সেটা হবে খেজুর গাছ। কিন্তু তা বলতে আমি লজ্জাবোধ করছিলাম। তারপর সাহাবায়ে কিরাম (রাঃ) বললেন, ‘ইয়া রাসূলাল্লাহ! আপনিই আমাদের বলে দিন সেটি কি গাছ? তিনি বললেনঃ তা হল খেজুর গাছ। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৪৮ ',
        name: 'হাদিস পড়া ও মুহাদ্দিসের কাছে পেশ করা',
        hadisNumberList: [
          HadisNumberModel(
            id: '',
            name:
                'হাসান (বসরী), সুফইয়ান সাউরী এবং মালিক (রহঃ)-এর মতে মুহাদ্দিসের সামনে পাঠ করা জায়েয। কোন কোন মুহাদ্দিস উস্তাদের সামনে পাঠ করার স্বপক্ষে যিমাম ইবনু সা‘লাবা (রাঃ)-এর হাদীস পেশ করেন। তিনি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলেছিলেন, ‘আমাদের পাঁচ ওয়াক্ত সালাত আদায় করার ব্যাপারে আল্লাহ্ কি আপনাকে নির্দেশ দিয়েছেন?’ তিনি বললেনঃ ‘হ্যাঁ’। রাবী বলেন, এগুলো রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সামনে পাঠ করা। যিমাম (রাঃ) তাঁর গোত্রের নিকট এ নির্দেশগুলো জানান এবং তাঁরা তা গ্রহণ করেন। (ইমাম) মালিক (রহঃ) তাঁর মতের সমর্থনে লিখিত দলীলকে প্রমাণ হিসেবে পেশ করেন, যা লোকদের সামনে পাঠ করা হলে তারা বলে, অমুক আমাদের সাক্ষী বানিয়েছেন। শিক্ষকের সামনে পাঠ করে পাঠক বলে, অমুক আমাকে পড়িয়েছেন।৬১। মুহাম্মদ ইবন সালাম (রহঃ) ... হাসান (রহঃ) থেকে বর্ণিত, তিনি বলেন, উস্তাদের সামনে শাগরিদের পাঠ করতে কোন বাধা নেই। ‘উবায়দুল্লাহ্ ইবন মূসা (রহঃ) সুফিয়ান (রহঃ) থেকে বর্ণনা করেন যে, তিনি বলেন যখন মুহাদ্দিসের সামনে (কোন হাদীস) পাঠ করা হয় তখন حَدَّثَنِي (তিনি আমার কাছে হাদীস বর্ণনা করেছেন) বলায় কোন আপত্তি নেই। বর্ণনাকারী বলেন, আমি আবূ ‘আসিমকে মালিক ও সুফিয়ান (রহঃ) থেকে বর্ণনা করতে শুনেছি যে, ‘উস্তাদের সামনে পাঠ করা এবং উস্তাদের নিজে পাঠ করা একই পর্যায়ের। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '৬২।',
            name:
                '  আবদুল্লাহ ইবনু ইউসুফ (রহঃ) ... আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ একবার আমরা রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে মসজিদে বসা ছিলাম। তখন এক ব্যাক্তি সওয়ার অবস্থায় ঢুকল। মসজিদে (প্রাঙ্গণে) সে তার উটটি বসিয়ে বেঁধে রাখল। এরপর সাহাবীদের লক্ষ্য করে বলল, তোমাদের মধ্যে মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তখন তার সামনেই হেলান দিয়ে বসা ছিলেন। আমরা বললাম, এই হেলান দিয়ে বসা ফর্সা রঙের ব্যাক্তিই হলেন তিনি।তারপর লোকটি তাঁকে লক্ষ্য করে বলল, হে আবদুল মুত্তালিবের পুত্র! নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে বললেনঃ ‘আমি তোমার জওয়াব দিচ্ছি। লোকটি বলল, ‘আমি আপনাকে কিছু প্রশ্ন করব এবং সে প্রশ্ন করার ব্যাপারে কঠোর হব, এতে আপনি রাগ করবেন না। তিনি বললেন, তোমার যেমন ইচ্ছা প্রশ্ন কর। সে বলল, আমি আপনাকে আপনার রব ও আপনার পূর্ববর্তীদের রবের কসম দিয়ে জিজ্ঞাসা করছি, আল্লাহ্ই কি আপনাকে সকল মানুষের রাসূলরূপে পাঠিয়েছেন?’ তিনি বললেনঃ আল্লাহ্ সাক্ষী, হাঁ।সে বলল, আমি আপনাকে আল্লাহর কসম দিয়ে বলছি, আল্লাহ্ই কি আপনাকে দিনরাতে পাঁচ ওয়াক্ত সালাত (নামায/নামাজ) আদায় করতে নির্দেশ দিয়েছেন? তিনি বললেনঃ ‘আল্লাহ্ সাক্ষী, হাঁ। সে বলল, আমি আপনাকে আল্লাহর কসম দিয়ে বলছি, আল্লাহ্ই কি আপনাকে বছরের এ মাসে (রমযান) সাওম (রোযা/রোজা/সিয়াম/ছিয়াম) পালনের নির্দেশ দিয়েছেন? তিনি বললেনঃ আল্লাহ্ সাক্ষী, হাঁ।সে বলল, আমি আপনাকে আল্লাহর কসম দিয়ে বলছি, আল্লাহ্ই কি আপনাকে নির্দেশ দিয়েছেন, আমাদের ধনীদের থেকে সদকা (যাকাত) উসূল করে গরীবদের মধ্যে ভাগ করে দিতে? নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ আল্লাহ্ সাক্ষী, হাঁ। এরপর লোকটি বলল, ‘আমি ঈমান আনলাম আপনি যা (যে শরী‘আত) এনেছেন তার ওপর। আর আমি আমার কওমের রেখে আসা লোকজনের পক্ষে প্রতিনিধি, আমার নাম যিমাম ইবনু সা’লাবা, বনী সা’দ ইবনু বকর গোত্রের একজন।মূসা ও আলী ইবনু আবদুল হামীদ (রহঃ) ... আনাস (রাঃ) সূত্রেও এরূপ বর্ণনা করেছেন।',
            ref: '',
          ),
          HadisNumberModel(
            id: '',
            name:
                ' ৬৩। মূসা ইবন ইসমা’ঈল (রহঃ) ... আনাস (রাঃ) থেকে বর্ণিত, তিনি বলেন, নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে প্রশ্ন করার ব্যাপারে কুরআনুল করীমে আমাদের নিষেধ করা হয়েছিল। আমরা পছন্দ করতাম, গ্রাম থেকে কোন বুদ্ধিমান ব্যক্তি এসে তাঁর কাছে প্রশ্ন করুক আর আমরা তা শুনি। তারপর একদিন গ্রাম থেকে একজন লোক এসে বলল, আমাদের কাছে আপনার একজন দূত গিয়েছে। সে আমাদের খবর দিয়েছে যে, আপনি বলেন, আল্লাহ্ তা’আলা আপনাকে রাসূলরূপে পাঠিয়েছেন। তিনি বললেনঃ সে সত্য বলেছে। সে বলল, আসমান কে সৃষ্টি করেছেন? তিনি বললেনঃ মহিমাময় আল্লাহ্ তা’আলা। সে বলল, পৃথিবী ও পর্বতমালা কে সৃষ্টি করেছেন? তিনি বললেনঃ মহিমাময় আল্লাহ্ তা’আলা। সে বলল, এসবের মধ্যে উপকারী বস্তুসমূহ কে রেখেছেন? তিনি বললেনঃ মহিমাময় আল্লাহ্ তা‘আলা। সে বলল, তাহলে যিনি আসমান সৃষ্টি করেছেন, যমীন সৃষ্টি করেছেন, পর্বত স্থাপন করেছেন এবং তার মধ্যে উপকারী বস্তুসমূহ রেখেছেন, তাঁর কসম, সেই আল্লাহ্ই কি আপনাকে রাসূলরূপে পাঠিয়েছেন? তিনি বললেনঃ হ্যাঁ।সে বলল, আপনার দূত বলেছেন যে, আমাদের উপর পাঁচ ওয়াক্ত সালাত আদায় করা এবং আমাদের মালের যাকাত দেওয়া অবশ্য কর্তব্য। তিনি বললেনঃ সে সত্য বলেছে। সে বলল, যিনি আপনাকে রাসূল করে পাঠিয়েছেন, তাঁর কসম, আল্লাহ্ই কি আপনাকে এর আদেশ দিয়েছেন? তিনি বললেনঃ হ্যাঁ, সে বলল, আপনার দূত বলেছেন যে, আমাদের উপর বছরে একমাস সাওম পালন অবশ্য কর্তব্য। তিনি বললেনঃ সে সত্য বলেছে। সে বলল, যিনি আপনাকে রাসূল করে পাঠিয়েছেন তাঁর কসম, আল্লাহ্ই কি আপনাকে এর নির্দেশ দিয়েছেন? তিনি বললেনঃ হ্যাঁ। সে বলল, আপনার দূত বলেছেন যে, আমাদের মধ্যে যার যাতায়াতের সামর্থ্য আছে, তার উপর বায়তুল্লাহর হজ্জ করা অবশ্য কর্তব্য। তিনি বললেনঃ সে সত্য বলেছে। সে বলল, যিনি আপনাকে রাসূল করে পাঠিয়েছেন তাঁর কসম, আল্লাহ্ই কি আপনাকে এর নির্দেশ দিয়েছেন? তিনি বললেনঃ হ্যাঁ, লোকটি বলল, যিনি আপনাকে সত্য দ্বীন দিয়ে পাঠিয়েছেন, তাঁর কসম, আমি এতে কিছু বাড়াবোও না, কামাবোও না। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ ‘সে যদি সত্য বলে থাকে তবে অবশ্যই সে জান্নাতে দাখিল হবে।’',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৪৯',
        name:
            'শায়খ কর্তৃক ছাত্রকে হাদিসের কিতাব প্রদান এবং আলিম কর্তৃক ইলমের কথা লিখে বিভিন্ন দেশে প্রেরণ।',
        hadisNumberList: [
          HadisNumberModel(
            id: '',
            name:
                'আনাস (রাঃ) বলেন, ‘উসমান (রাঃ) কুরআন কারীমের বহু কপি তৈরি করিয়ে বিভিন্ন দেশে প্রেরণ করেন। আবদুল্লাহ্ ইবনু ‘উমার (রাঃ), ইয়াহইয়া ইবনু সা‘ঈদ ও মালিক (রহঃ) এটাকে জায়িয মনে করেন। কোন কোন হিজাযবাসী ছাত্রকে হাদীস বর্ণনার অনুমতি প্রদানের ব্যাপারে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর এ হাদীস দিয়ে দলীল পেশ করেন যে, তিনি একটি সেনাদলের প্রধানকে একখানি পত্র দেন এবং তাঁকে বলে দেন, অমুক অমুক স্থানে না পৌঁছা পর্যন্ত এটা পড়ো না। অতঃপর তিনি যখন সে স্থানে পৌঁছলেন, তখন লোকের সামনে তা পড়ে শোনান এবং রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর ফরমান তাদেরকে জানান। ৬৪। ইসমাঈল ইবনু আবদুল্লাহ (রহঃ) ... আবদুল্লাহ ইবনু আব্বাস (রাঃ) থেকে বর্ণিত, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামএক ব্যক্তিকে তাঁর চিঠি দিয়ে পাঠালেন এবং তাকে বাহরায়নের গভর্নরের কাছে তা পৌঁছে দিতে নির্দেশ দিলেন। এরপর বাহরায়নের গভর্নর তা কিসরা (পারস্য সম্রাট)-এর কাছে দিলেন। পত্রটি পড়ার পর সে ছিঁড়ে টুকরো টুকরো করে ফেলল। [বর্ণনাকারী ইবনু শিহাব (রহঃ) বলেন] আমার ধারনা ইবনু মূসায়্যাব (রহঃ) বলেছেন, (এ ঘটনার খবর পেয়ে) রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের জন্য বদদু’আ করেন যে, তাদেরকেও যেন সম্পূর্ণরূপে টুকরো টুকরো করে ফেলা হয়। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '',
            name:
                '৬৫। মুহাম্মদ ইবনু মুকাতিল (রহঃ) ... আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত, তিনি বলেন, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একখানি পত্র লিখলেন অথবা একখানি পত্র লিখতে মনস্থ করলেন। তখন তাঁকে বলা হল যে, তারা (রোমবাসী ও অনারবরা) সীলমোহরযুক্ত ছাড়া কোন পত্র পড়ে না। এরপর তিনি রূপার একটি আংটি (মোহর) তৈরী করালেন যার নকশা ছিল (مُحَمَّدٌ رَسُولُ اللَّهِ) আমি যেন তাঁর হাতে সে আংটির ঔজ্জ্বল্য (এখনও) দেখতে পাচ্ছি। [শু’বা (রহঃ) বলেন] আমি কাতাদ (রহঃ)-কে বললাম, কে বলেছে যে, তার নকশা (مُحَمَّدٌ رَسُولُ اللَّهِ) ছিল? তিনি বললেন, আনাস (রাঃ)। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৫০',
        name: ' মজলিসের শেষ প্রান্তে বসা এবং মজলিসের ভিতরে ফাক দেখে সেখানে বসা',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ৬৬। ',
            name:
                'ইসমা’ঈল (রহঃ) ... আবূ ওয়াকিদ আল-লায়সী (রাঃ) থেকে বর্ণিত যে, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একবার মসজিদে বসেছিলেন; তাঁর সঙ্গে আরও লোকজন ছিলেন। ইতিমধ্যে তিনজন লোক এলেন। তন্মধ্যে দু’জন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর দিকে এগিয়ে এলেন এবং একজন চলে গেলেন। আবূ ওয়াকিদ (রাঃ) বলেন, তাঁরা দু’জন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে কিছুক্ষণ দাঁড়িয়ে রইলেন। এরপর তাঁদের একজন মজলিসের মধ্যে কিছুটা জায়গা দেখে সেখানে বসে পড়লেন এবং অন্যজন তাদের পেছনে বসলেন। আর তৃতীয় ব্যাক্তি ফিরে গেল। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মজলিস শেষ করে (সাহাবায়ে কিরামকে লক্ষ্য করে) বললেনঃ আমি কি তোমাদেরকে এই তিন ব্যাক্তি সম্পর্কে কিছু বলব? তাদের একজন আল্লাহর দিকে এগিয়ে এসেছে তাই আল্লাহ্ তাকে স্থান দিয়েছেন। অন্যজন (ভীড় ঠেলে অগ্রসর হতে অথবা ফিরে যেতে) লজ্জাবোধ করেছে,তাই আল্লাহও তার ব্যাপারে (তাকে শাস্তি দিতে এবং রহমত থেকে বঞ্চিত করতে) লজ্জাবোধ করেছেন। আর অপরজন (মজলিসে হাজির হওয়া থেকে) মুখ ফিরিয়ে নিয়েছে, তাই আল্লাহ্ও তার থেকে মুখ ফিরিয়ে নিয়েছেন।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' ',
        name:
            'পরিচ্ছেদঃ ৫১/ নাবী করীম (ﷺ) এর বানীঃ যাদের কাছে হাদিস পৌঁছানো হয় তাদের মধ্যে অনেকে এমন আছে, যে শ্রোতা (বর্ণনাকারী\'র) চাইতে বেশী মুখস্থ রাখতে পারে।',
        hadisNumberList: [
          HadisNumberModel(
            id: '৬৭।',
            name:
                ' মূসা’দ্দাদ (রহঃ) ... আবূ বাকরা (রাঃ) থেকে বর্ণিত যে, তিনি একবার নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কথা উল্লেখ করে বলেন, (মিনায়) তিনি তাঁর উটের ওপর বসেছিলেন। একজন লোক তাঁর উটের লাগাম ধরে রেখেছিল। তিনি বললেনঃ আজ কোন্ দিন?’ আমরা চুপ থাকলাম এবং ধারণা করলাম যে, এ দিনটির আলাদা কোন নাম তিনি দিবেন। তিনি বললেনঃ “এটা কুরবানীর দিন নয় কি?” আমরা বললাম, জী হ্যাঁ। তিনি বললেনঃ এটা কোন্ মাস?’ আমরা চুপ থাকলাম এবং ধারণা করতে লাগলাম যে, তিনি হয়ত এর (প্রচলিত) নাম ছাড়া অন্য কোন নাম দিবেন। তিনি বললেনঃ এটা যিলহাজ্জ নয় কি?’ আমরা বললাম, জী হ্যাঁ। তিনি বললেনঃ জেনে রাখ! তোমাদের জান, তোমাদের মাল, তোমাদের সন্মান তোমাদের পরস্পরের জন্য হারাম, যেমন আজকের এ মাস, তোমাদের এ শহর, আজকের এ দিন সন্মানিত। এখানে উপস্থিত ব্যাক্তি (আমার এ বাণী) যেন অনুপস্থিত ব্যাক্তির কাছে পৌঁছে দেয়। কারন উপস্থিত ব্যাক্তি হয়ত এমন এক ব্যাক্তির কাছে পৌঁছাবে, যে এ বাণীকে তার থেকে বেশি মুখস্থ রাখতে পারবে। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৫৩ ',
        name:
            ' রাসূলুল্লাহ্ (ﷺ) ওয়ায-নসীহতে ও ইলম শিক্ষা দানে উপযুক্ত সময়ের প্রতি লক্ষ্য রাখতেন, যাতে লোকজন বিরক্ত না হয়ে পড়ে।',
        hadisNumberList: [
          HadisNumberModel(
            id: '',
            name:
                '  পরিচ্ছেদঃ কথা ও আমলের পূর্বে ইলম জরুরী। আল্লাহ তা\'আলার ইরশাদঃ فَاعْلَمْ أَنَّهُ لاَ إِلَهَ إِلاَّ اللَّهُ “সুতরাং জেনে রাখ, আল্লাহ ব্যতীত প্রকৃত কোন উপাস্য নেই।” (৪৭ঃ ১৯)। এখানে আল্লাহ তা’আলা ইলমের কথা আগে বলেছেন। আলিমগণই নবীগণের ওয়ারিস। তারা ইলমের ওয়ারিস হয়েছেন। তাই যে ইলম হাসিল করে সে বিরাট অংশ লাভ করে। আর যে ব্যক্তি ইলম হাসিলের উদ্দেশ্যে পথ চলে, আল্লাহ তা’আলা তার জন্য জান্নাতের পথ সহজ করে দেন।আল্লাহ তা’আলা ইরশাদ করেনঃ إِنَّمَا يَخْشَى اللَّهَ مِنْ عِبَادِهِ الْعُلَمَاءُ আল্লাহর বান্দাদের মধ্যে আলিমগণই তাকে ভয় করে (৩৫ঃ ২৮)। আল্লাহ তা’আলা আরো ইরশাদ করেনঃ وَمَا يَعْقِلُهَا إِلاَّ الْعَالِمُونَ “আলিমগণ ছাড়া তা কেউ বুঝেনা”। অন্যত্র ইরশাদ হয়েছেঃ وَقَالُوا لَوْ كُنَّا نَسْمَعُ أَوْ نَعْقِلُ مَا كُنَّا فِي أَصْحَابِ السَّعِيرِ তারা বলবে, যদি আমরা শুনতাম অথবা বিবেক-বুদ্ধি প্রয়োগ করতাম, তাহলে আমরা জাহান্নামী হতাম না। (৬৭ঃ ১০)। আরো ইরশাদ করেনঃ هَلْ يَسْتَوِي الَّذِينَ يَعْلَمُونَ وَالَّذِينَ لاَ يَعْلَمُونَ “বল, যারা জানে আর যারা জানে না, তারা কি সমান হতে পারে? (৩৯ঃ ৯)নবী কারীম সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম বলেনঃ আল্লাহ যার কল্যাণ চান তাকে দ্বীনের জ্ঞান দান করেন। আর অধ্যায়নের মাধ্যমেই জ্ঞান অর্জিত হয়। আবু যার (রাঃ) তাঁর ঘাড়ের দিকে ইশারা করে বলেন, যদি তোমরা এখানে তরবারি ধর, এরপর আমি বুঝতে পারি যে, তোমরা আমার ওপর সে তরবারী চালাবার আগে আমি একটু কথা বলতে পারব, তবে আমি যা নবী কারিম সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম থেকে শুনেছি, তবে অবশ্যই আমি তা বলে ফেলব।নবী কারীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর বাণীঃ উপস্থিত ব্যক্তিরা যেন অনুপস্থিত ব্যক্তির কাছে (আমার বাণী) পৌঁছে দেয়। ইবনু আব্বাস (রাঃ) বলেন, كُونُوا رَبَّانِيِّينَ (তোমরা রব্বানি হও)। এখানে رَبَّانِيِّينَ মানে প্রজ্ঞাবান, আলিম ও ফকীহগণ। আরো বলা হয় رباني সে ব্যক্তি কে বলা হয় যিনি মানুষকে জ্ঞানের বড় বড় বিষয়ের পূর্বে ছোট ছোট বিষয় শিক্ষা দিয়ে গড়ে তোলেন।৬৮। মুহাম্মদ ইবন ইউসুফ (রহঃ) ... ইবন মাস’উদ (রাঃ) থেকে বর্ণিত, তিনি বলেন, নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের অবস্থার প্রতি লক্ষ্য রেখে নির্দিষ্ট দিনে ওয়ায-নসীহত করতেন, আমরা যাতে বিরক্ত না হই।',
            ref: '',
          ),
          HadisNumberModel(
            id: '৬৯।',
            name:
                '  মুহাম্মদ ইবনু বাশশার (রহঃ) ... আনাস (রাঃ) থেকে বর্ণনা করেন যে, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা (দ্বীনের ব্যাপারে) সহজ পন্থা অবলম্বন করবে, কঠিন পন্থা অবলম্বন করবে না, মানুষকে সুসংবাদ শোনাবে, বিরক্তি সৃষ্টি করবে না।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৫৪ ',
        name: 'ইলম শিক্ষার্থীদের জন্য দিন নির্দিষ্ট করা',
        hadisNumberList: [
          HadisNumberModel(
            id: '৭০।',
            name:
                '  উসমান ইবনু আবূ শায়বা (রহঃ) ... আবূ ওয়াইল (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ ইবনু মাস’উদ (রাঃ) প্রতি বৃহস্পতিবার লোকদের ওয়ায-নসীহত করতেন। তাঁকে একজন বলল, হে আবূ ‘আবদুর রহমান! আমার মন চায় যেন আপনি প্রতিদিন আমাদের নসীহত করেন। তিনি বললেনঃ এ কাজ থেকে আমাকে যা বিরত রাখে তা হল, আমি তোমাদের ক্লান্ত করতে পছন্দ করি না। আর আমি নসীহত করার ব্যাপারে তোমাদের (অবস্থার) প্রতি লক্ষ্য রাখি, যেমন রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের প্রতি লক্ষ্য রাখতেন আমাদের ক্লান্তির আশংকায়।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৫৫',
        name: ' আল্লাহ্ যার কল্যাণ চান, তাকে দ্বীনের জ্ঞান দান করেন ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৭১।  ',
            name:
                'সাঈদ ইবনু উফায়র (রহঃ) ... হুমায়দ ইবনু আবদুর রহমান (রহঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি মু’আবিয়া (রাঃ)–কে বক্তৃতারত অবস্থায় বলতে শুনেছি, তিনি বলেন, আমি রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে বলতে শুনেছি, আল্লাহ্ যার কল্যাণ চান, তাকে দ্বীনের জ্ঞান দান করেন। আমি তো কেবল বিতরণকারী, আল্লাহ্ই দানকারী। সর্বদাই এ উম্মাত (সত্যিকারের মুসলিম) কিয়ামত পর্যন্ত আল্লাহ্‌ হুকুমের উপর প্রতিষ্টিত থাকবে, বিরুদ্ধবাদীরা তাদের কোন ক্ষতি করতে পারবে না। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৫৬ ',
        name: ' ইলমের ক্ষেত্রে সঠিক অনুধাবন ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৭২। ',
            name:
                '  আলী ইবনু ‘আবদুল্লাহ (রহঃ) ... মুজাহিদ (রহঃ) থেকে বর্ণিত, তিনি বলেন, আমি সফরে মদিনা পর্যন্ত ইবনু উমর (রাঃ) এর সঙ্গে ছিলাম। এ সময় তাঁকে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে একটি মাত্র হাদীস রেওয়ায়েত করতে শুনেছি। তিনি বলেন, আমরা একবার নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে ছিলাম। তখন তাঁর নিকট খেজুর গাছের মথি আনা হল। তারপর তিনি বললেনঃ গাছপালার মধ্যে এমন একটি গাছ আছে যার দৃষ্টান্ত মুসলিমের ন্যায়। তখন আমি বলতে চাইলাম যে, তা হল খেজুর গাছ, কিন্তু আমি ছিলাম উপস্থিত সবার চাইতে বয়সে ছোট। তাই চুপ করে রইলাম। তখন রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ গাছটি হল খেজুর গাছ।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৫৭',
        name: ' ইলম ও হিকমতের ক্ষেত্রে সমতুল্য হওয়ার আগ্রহ ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'উমর (রাঃ) বলেন, তোমরা নেতৃত্ব লাভের আগেই জ্ঞান হাসিল করে নাও। আবূ আবদুল্লাহ্ (বুখারী) বলেন, আর নেতা বানিয়ে দেওয়ার পরও, কেননা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সাহাবীগণ বয়োবৃদ্ধকালেও ইলম শিক্ষা করেছেন।৭৩। হুমায়দী (রহঃ) ... আবদুল্লাহ ইবনু মাস’উদ (রাঃ) থেকে বর্ণিত, তিনি বলেন, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কেবলমাত্র দু’টি ব্যাপারই ঈর্ষা করা যায়; (১) সে ব্যাক্তির উপর, যাকে আল্লাহ্ তা’আলা সম্পদ দিয়েছেন, এরপর তাকে হক পথে অকাতরে ব্যয় করার ক্ষমতা দেন; (২) সে ব্যাক্তির উপর, যাকে আল্লাহ্ তা’আলা হিকমত দান করেছেন, এরপর সে তার সাহায্যে ফায়সালা করে ও তা শিক্ষা দেয়। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৫৮ ',
        name: 'সমুদ্রে খিযর (আঃ)-এর কাছে মূসা (আঃ)-এর যাওয়া ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'আর আল্লাহ্ তা’আলার বানীঃ (هَلْ أَتَّبِعُكَ عَلَى أَنْ تُعَلِّمَنِي مِمَّا عُلِّمْتَ رُشْدًا) (আমি কি আপনার অনুসরণ করব এ শর্তে যে, সত্য পথের যে জ্ঞান আপনাকে দান করা হয়েছে তা থেকে আমাকে শিক্ষা দেবেন। (১৮ঃ ৬৬)৭৪। মুহাম্মদ ইবনু গুরায়র আয-যুহরী (রহঃ) ... ইবনু আব্বাস (রাঃ) থেকে বর্ণিত, তিনি এবং হুর ইবনু কায়স ইবনু হিসন আল ফাযারী মূসা (আঃ) এর সঙ্গী সম্পর্কে বাদানুবাদ করেছিলেন। ইবনু আব্বাস (রাঃ) বললেন, তিনি ছিলেন খিযর। ঘটনাক্রমে তখন তাদের পাশ দিয়ে উবাই ইবনু কা’ব (রাঃ) যাচ্ছিলেন। ইবনু ‘আব্বাস (রাঃ) তাঁকে ডেকে বললেনঃ আমি ও আমার এ ভাই মতবিরোধ পোষণ করছি মূসা (আঃ) এর সেই সঙ্গীর ব্যাপারে যাঁর সাথে সাক্ষাত করার জন্য মূসা (আঃ) আল্লাহর কাছে পথের সন্ধান চেয়েছিলেন—আপনি কি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে তাঁর সম্পর্কে কিছু বলতে শুনেছেন? তিনি বললেন, হ্যাঁ, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি, একবার মূসা (আঃ) বনী ইসরাঈলের কোন এক মজলিসে হাজির ছিলেন। তখন তাঁর কাছে এক ব্যাক্তি এসে বলল, ‘আপনি কাউকে আপনার চেয়ে অধিক জ্ঞানী বলে জানেন কি?’ মূসা (আঃ) বললেন, না।তখন আল্লাহ্ তা’আলা মূসা (আঃ) এর কাছে ওহী পাঠালেনঃ হ্যাঁ, আমার বান্দা খিযর। অতঃপর মূসা (আঃ) তাঁর সাথে সাক্ষাত করার রাস্তা জানতে চাইলেন। আল্লাহ্ তা’আলা মাছকে তার জন্য নিশানা বানিয়ে দিলেন এবং তাঁকে বলা হল, তুমি যখন মাছটি হারিয়ে ফেলবে তখন ফিরে আসবে। কারন, কিছুক্ষনের মধ্যেই তুমি তাঁর সাক্ষাত পাবে। তখন তিনি সমুদ্রে সে মাছেরনিশানা অনুসরন করতে লাগলেন। মূসা (আঃ)-কে তাঁর সঙ্গী যুবক বললেন, (কুরআন মজীদের ভাষায়ঃ)أَرَأَيْتَ إِذْ أَوَيْنَا إِلَى الصَّخْرَةِ فَإِنِّي نَسِيتُ الْحُوتَ وَمَا أَنْسَانِيهِ إِلَّا الشَّيْطَانُ أَنْ أَذْكُرَهُ قَالَ ذَلِكَ مَا كُنَّا نَبْغِي فَارْتَدَّا عَلَى آثَارِهِمَا قَصَصًا“আপনি কি লক্ষ্য করেছেন আমরা যখন পাথরের কাছে বিশ্রাম নিচ্ছিলাম তখন আমি মাছের কথা ভুলে গিয়েছিলাম? শয়তান তার কথা আমাকে ভুলিয়ে দিয়েছিল। ... মূসা বললেন, আমরা তো সে স্থানটিরই অনুসন্ধান করছিলাম। এরপর তারা নিজেদের পদচিহ্ন ধরে ফিরে চলল। (১৮ : ৬৩-৬৪)তাঁরা খিযরকে পেলেন। তাদের ঘটনা তা-ই, যা আল্লাহ্ তা’আলা তাঁর কিতাবে বর্ণনা করেছেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৫৯ ',
        name:
            ' নবী (ﷺ) এর উক্তিঃ হে আল্লাহ্! আপনি তাকে কিতাব (কুরআন) শিক্ষা দিন। ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৭৫। ',
            name:
                ' আবূ মা’মার (রহঃ) ... ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিত, তিনি বলেন, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একবার আমাকে জড়িয়ে ধরে বললেনঃ হে আল্লাহ্! আপনি তাকে কিতাব (কুরআন) শিক্ষা দিন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৬০ ',
        name: '  বালকদের কোন বয়সের শোনা কথা গ্রহণীয়।',
        hadisNumberList: [
          HadisNumberModel(
            id: '৭৬। ',
            name:
                '  ইসমাঈল (রহঃ) ... আবদুল্লাহ ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি বালক হবার নিকটবর্তী বয়সে একবার একটি মাদী গাধার উপর সওয়ার হয়ে এলাম। আর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তখন কোন দেওয়াল সামনে না রেখেই মিনায় সালাত (নামায/নামাজ) আদায় করছিলেন। তখন আমি কোন এক কাতারের সামনে দিয়ে গেলাম এবং মাদী গাধাটিকে চরে খাওয়ার জন্য ছেড়ে দিলাম। আমি কাতারে ভেতর ঢুকে পড়লাম কিন্তু এতে কেউ আমাকে নিষেধ করলেন না।',
            ref: '',
          ),
          HadisNumberModel(
            id: '৭৭। ',
            name:
                ' মুহাম্মদ ইবনু ইউসুফ (রহঃ) ... মাহমূদ ইবনুুর-রাবী (রাঃ) থেকে বর্ণিত, তিনি বলেন, আমার মনে আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একবার বালতি থেকে পানি নিয়ে আমার মুখমন্ডলে কুলি করে দিয়েছিলেন, তখন আমি ছিলাম পাঁচ বছরের বালক। ',
            ref: '',
          )
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৬১',
        name: ' ইলম হাসিলের জন্য বের হওয়া',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                ' وَرَحَلَ جَابِرُ بْنُ عَبْدِ اللَّهِ مَسِيرَةَ شَهْرٍ إِلَى عَبْدِ اللَّهِ بْنِ أُنَيْسٍ فِي حَدِيثٍ وَاحِدٍ জাবির ইবন ‘আবদুল্লাহ্ (রাঃ) একটি মাত্র হাদীসের জন্য ‘আবদুল্লাহ্ ইবন উনায়স (রাঃ) এর কাছে এক মাসের পথ সফর করে গিয়েছিলেন। ৭৮। হিমস নগরের কাযী আবূল কাসিম খালিদ ইবনু খালীয়ি (রহঃ) ... ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিত, একবার তিনি এবং হুর ইবনু কায়স ইবনু আল ফাযারী মূসা (আঃ) এর সঙ্গীর ব্যাপারে বাদানুবাদ করছিলেন। তখন উবাঈ ইবনু কা’ব (রাঃ) তাঁদের পাশ দিয়ে যাচ্ছিলেন। ইবনু ‘আব্বাস (রাঃ) তাঁকে ডেকে বললেনঃ আমি ও আমার এ ভাই মতবিরোধ পোষণ করছি মূসা (আঃ) এর সেই সঙ্গীর ব্যাপারে যাঁর সাথে সাক্ষাত করার জন্য মূসা (আঃ) আল্লাহর কাছে পথের সন্ধান চেয়েছিলেন—আপনি কি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে তাঁর সম্পর্কে কিছু বলতে শুনেছেন? উবাঈ (রাঃ) বললেন, হ্যাঁ, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে তাঁর প্রসঙ্গে বলতে শুনেছি যে, একবার মূসা (আঃ) বনী ইসরাঈলের কোন এক মজলিসে হাজির ছিলেন। তখন তাঁর কাছে এক ব্যাক্তি এসে বলল, ‘আপনি কাউকে আপনার চেয়ে অধিক জ্ঞানী বলে জানেন কি?’ মূসা (আঃ) বললেন, না। তখন আল্লাহ্ তা’আলা মূসা (আঃ) এর কাছে ওহী পাঠালেনঃ হ্যাঁ, আমার বান্দা খিযর। এরপর তিনি তাঁর সাথে সাক্ষাত করার রাস্তা জানতে চাইলেন। আল্লাহ্ তা’আলা মাছকে তার জন্য নিশানা বানিয়ে দিলেন এবং তাঁকে বলা হল, তুমি যখন মাছটি হারিয়ে ফেলবে তখন তুমি প্রত্যাবর্তন করবে। তাহলে কিছুক্ষনের মধ্যেই তুমি তাঁর সাক্ষাত পাবে। তিনি সমুদ্রে সে মাছেরনিশানা অনুসরন করতে লাগলেন। যা হোক, মূসা (আঃ)-কে তাঁর সঙ্গী যুবক বললেন, (পবিত্র কুরআনের ভাষায়ঃ) أَرَأَيْتَ إِذْ أَوَيْنَا إِلَى الصَّخْرَةِ فَإِنِّي نَسِيتُ الْحُوتَ وَمَا أَنْسَانِيهِ إِلَّا الشَّيْطَانُ أَنْ أَذْكُرَهُ “আপনি কি লক্ষ্য করেছেন আমরা যখন পাথরের কাছে বিশ্রাম নিচ্ছিলাম তখন আমি মাছের কথা (বলতে) ভুলে গিয়েছিলাম।আর শয়তান তার কথা আমাকে ভুলিয়ে দিয়েছিল।” (১৮ : ৬৩)। ... মূসা (আঃ) বললেনঃ ذَلِكَ مَا كُنَّا نَبْغِي فَارْتَدَّا عَلَى آثَارِهِمَا قَصَصًا “আমরা সে স্থানটির অনুসন্ধান করছিলাম (১৮ : ৬৪)। তারপর তাঁরা নিজেদের পদচিহ্ন ধরে ফিরে চললেন। শেষে তাঁরা খিযর (আঃ)-কে পেয়ে গেলেন। তাঁদের (পরবর্তী) ঘটনা আল্লাহ্ তা’আলা তাঁর কিতাবে বর্ণনা করেছেন।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৬২ ',
        name: ' ইলম শিক্ষার্থী ও শিক্ষাদাতার ফযীলত। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ৭৯। ',
            name:
                ' মুহাম্মদ ইবনুল-আলা (রহঃ) ... আবূ মূসা (রাঃ) থেকে বর্ণিত যে, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আল্লাহ্ তা’আলা আমাকে যে হিদায়ত ও ইল্‌ম দিয়ে পাঠিয়েছেন তার দৃষ্টান্ত হল যমীনের উপর পতিত প্রবল বৃষ্টির ন্যায়। কোন কোন ভূমি থাকে উর্বর যা সে পানি শুষে নিয়ে প্রচুর পরিমানে ঘাসপাতা এবং সবুজ তরুলতা উৎপাদন করে। আর কোন কোন ভূমি থাকে কঠিন যা পানি আটকে রাখে। পরে আল্লাহ্ তা’আলা তা দিয়ে মানুষের উপকার করেন; তারা নিজেরা পান করে ও (পশুপালকে) পান করায় এবং তার দ্বারা চাষাবাদ করে। আবার কোন কোন জামি আছে যা একেবারে মসৃণ ও সমতল; তা না পানি আটকে রাখে, আর না কোন ঘাসপাতা উৎপাদন করে। এই হল সে ব্যাক্তির দৃষ্টান্ত যে দ্বীনের জ্ঞান লাভ করে এবং আল্লাহ্ তা’আলা আমাকে যা দিয়ে প্রেরণ করেছেন তাতে সে উপকৃত হয়। ফলে সে নিজে শিক্ষা করে এবং অপরকে শিক্ষা দেয়। আর সে ব্যাক্তির দৃষ্টান্ত-যে সে দিকে মাথা তুলে তাকায়ই না এবং আল্লাহর যে হিদায়ত নিয়ে আমি প্রেরিত হয়েছি, তা গ্রহণও করে না। আবূ ‘আবদুল্লাহ (মুখারী) (রহঃ) বলেনঃ ইসহাক (রহঃ) থেকে বর্ণনা করেছেনঃ তিনিقَبِلَت এর স্থলে قَيَّلَت (আটকিয়ে রাখে) ব্যবহার করেছেন।قَاعٌ হল এমন ভূমি যার উপর পানি জমে থাকে। আর الصَّفْصَفُ হল সমতল ভূমি।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৬৩ ',
        name: '  ইলমের বিলুপ্তি ও মূর্খতার প্রসার',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                ' وَقَالَ رَبِيعَةُ لاَ يَنْبَغِي لأَحَدٍ عِنْدَهُ شَيْءٌ مِنَ الْعِلْمِ أَنْ يُضَيِّعَ نَفْسَهُ রাবী’আ (রহঃ) বলেন, ‘যার কছে কিছুমাত্র ইলম আছে, তার উচিৎ নয় নিজেকে অপমানিত করা। ৮০। ইমরান ইবনু মায়সারা (রহঃ) ... আনাস (রাঃ) থেকে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন যে, কিয়ামতের কিছু নিদর্শন হলঃ ইলম লোপ পাবে, অজ্ঞাতার বিস্তৃতি ঘটবে, মদপান ব্যাপক হবে এবং ব্যভিচার ছড়িয়ে পড়বে।',
            ref: '',
          ),
          HadisNumberModel(
            id: '৮১।  ',
            name:
                ' মূসা’দ্দাদ (রহঃ) ... আনাস (রাঃ) থেকে বর্ণিত, তিনি বলেন, আমি তোমাদের এমন একটি হাদীস বর্ণনা করব যা আমার পর তোমাদের কাছে আর কেউ বর্ণনা করবেন না। আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি যে, কিয়ামতের কিছু নিদর্শন হলঃ ইলম কমে যাবে, অজ্ঞতার প্রসার ঘটবে, ব্যভিচার ছড়িয়ে পড়বে, স্ত্রীলোকের সংখ্যা বেড়ে যাবে এবং পুরুষের সংখ্যা কমে যাবে, এমনকি প্রতি পঞ্চাশজন স্ত্রীলোকের জন্য মাত্র একজন পুরুষ হবে তত্ত্বাবধায়ক।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৬৪/',
        name: ' ইলমের ফযীলত ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৮২। ',
            name:
                ' সাঈদ ইবনু ‘উফায়র (রহঃ) ... ইবনু ‘উমর (রাঃ) থেকে বর্ণিত, তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি, একবার আমি ঘুমিয়ে ছিলাম। তখন (স্বপ্নে) আমার কাছে এক পেয়ালা দুধ আনা হল। আমি তা পান করলাম (তার পরিতৃপ্তি আমার সর্বাঙ্গে ছড়িয়ে পড়ল।) এমনকি আমার মনে হতে লাগল যে, সে তৃপ্তি আমার নখ দিয়ে বের হচ্ছে। এরপর যেটুকু অবশিষ্ট ছিল, তা আমি ‘উমর ইবনুল খাত্তাবকে দিলাম। সাহাবায়ে কিরাম জানতে চাইলেন, ইয়া রাসূলাল্লাহ! আপনি এ স্বপ্নের কী তা’বীর করেন? তিনি জওয়াবে বললেনঃ তা হল ইলম। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৬৫/ ',
        name: '  প্রাণী বা অন্য বাহনে আসীন অবস্থায় ফতোয়া দেওয়া।',
        hadisNumberList: [
          HadisNumberModel(
            id: '৮৩। ',
            name:
                ' ইসমাঈল (রহঃ) ... আবদুল্লাহ ইবনু আমর ইবনু আস (রাঃ) থেকে বর্ণিত যে, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বিদায় হাজ্জের (হজ্জ) দিনে মিনায় মানুষের (প্রশ্নের উত্তর দানের) জন্য (বাহনের উপর) বসা ছিলেন। লোকে তাঁর কাছে বিভিন্ন মাসআলা জিজ্ঞাসা করছিল। এক ব্যাক্তি তাঁর কাছে এসে বলল, আমি ভুলবশত কুরবানী করার আগেই মাথা মুড়িয়ে ফেলেছি। তিনি বললেনঃ যবেহ কর, কোন ক্ষতি নেই। আর এক ব্যাক্তি এসে বলল, আমি ভুলবশত কঙ্কর নিক্ষপের আগেই কুরবাণী করে ফেলেছি। তিনি বললেনঃ কঙ্কর ছুঁড়ো, কোন অসুবিধা নেই। আবদুল্লাহ ইবনু আমর (রহঃ) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে সে দিন আগে বা পরে করা যে কাজ সম্পর্কেই জিজ্ঞাসা করা হচ্ছিল, তিনি একথাই বলছিলেনঃ কর, কোন ক্ষতি নেই। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৬৬/ ',
        name: ' হাত ও মাথার ইশারায় মাসয়ালার জবাব দান ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ৮৪। ',
            name:
                ' মূসা ইবনু ইসমাঈল (রহঃ) ... ইবনু আব্বাস (রাঃ) থেকে বর্ণিত, হাজ্জের সময় নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে (নানা বিষয়ে) জিজ্ঞাসা করা হল। কোন একজন বললঃ আমি কঙ্কর নিক্ষেপের পূর্বেই যবেহ করে ফেলেছি। ইবনু আব্বাস (রাঃ) বলেন, তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হাত দিয়ে ইশারা করে বললেনঃ কোন অসুবিধা নেই। আর এক ব্যাক্তি বললঃ আমি যবেহ করার পূর্বে মাথা মুড়িয়ে ফেলেছি। তিনি হাত দিয়ে ইশারা করলেনঃ কোন অসুবিধা নেই (যেহেতু ভুলবশতঃ করা হয়েছে)।',
            ref: '',
          ),
          HadisNumberModel(
            id: '৮৫। ',
            name:
                '  মাক্বী ইবনু ইবরাহীম (রহঃ) ... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ (শেষ যামানায়) ইলম তুলে নেওয়া হবে, অজ্ঞতা ও ফিতনার প্রসার ঘটবে এবং হারাজ বেড়ে যাবে। জিজ্ঞাসা করা হল, ইয়া রাসূলাল্লাহ! হারাজ কি? তিনি হাত দিয়ে ইশারা করে বললেনঃ এ রকম। যেন তিনি এর দ্বারা হত্যা বুঝিয়েছিলেন।',
            ref: '',
          ),
          HadisNumberModel(
            id: '৮৬।  ',
            name:
                'মূসা ইবনু ইসমাঈল (রহঃ) ... আসমা (রাঃ) থেকে বর্ণিত তিনি বলেন, আমি আয়িশা (রাঃ) এর কাছে এলাম, তিনি তখন সালাত (নামায/নামাজ) আদায় করছিলেন। আমি বললাম, মানুষের কি হয়েছে? তিনি আকাশের দিকে ইঙ্গিত করলেন (দেখ, সূর্য গ্রহণ লেগেছে)। তখন সকল লোক (সালাতে কুসূফ আদায়ের জন্য) দাঁড়িয়ে রয়েছে। আয়িশা (রাঃ) বললেন, সুবহানাল্লাহ্! আমি বললাম, এটা কি কোন নিদর্শন? তিনি মাথা ইশারা করলেন, হ্যাঁ। এরপর আমি (সালাতে) দাঁড়িয়ে গেলাম। এমনকি (সালাত এত দীর্ঘ ছিল যে,) আমার বেহুঁশ হয়ে পড়ার উপক্রম হল। তাই আমি মাথায় পানি ঢালতে লাগলাম। পরে (সালাত শেষে) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আল্লাহর হামদ ও সানা বর্ণনা করলেন। এরপর বললেনঃ যা কিছু আমাকে ইতিপূর্বে দেখানো হয়নি, তা আমি আমার এ স্থানেই দেখতে পেয়েছি। এমনকি জান্নাত এবং জাহান্নামও দেখেছি। এরপর আল্লাহ্ তাআলা আমার কাছে ওহী প্রেরণ করলেন, তোমাদেরকে কবরের মধ্যে পরীক্ষা করা হবে দাজ্জালের ন্যায় (কঠিন) পরীক্ষা অথবা তার কাছাকাছি।ফাতিমা (রাঃ) বলেন, আসমা (রাঃ)مثل (অনুরূপ) শব্দ বলেছিলেন, না قريب (কাছাকাছি) শব্দ, তা ঠিক আমার মনে নেই। (কবরের মধ্যে) বলা হবে, এ ব্যাক্তি সম্পর্কে তুমি কি জানো? তখন মুমিন ব্যাক্তি বা মুকিন (বিশ্বাসী) ব্যাক্তি [ফাতিমা (রাঃ) বলেন] আসমা (রাঃ) এর কোন্ শব্দটি বলেছিলেন ঠিক আমার মনে নেই, বলবে তিনি মুহাম্মদসাল্লাল্লাহু আলাইহি ওয়াসাল্লাম, তিনি আল্লাহর রাসূল। আমাদের কাছে মুজিযা ও হিদায়ত নিয়ে এসেছিলেন। আমরা তা গ্রহণ করেছিলাম এবং তাঁর অনুসরণ করেছিলাম। তিনি মুহাম্মদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম। তিনবার এরূপ বলবে। তখন তাকে বলা হবে, আরামে ঘুমাও, আমরা জানতে পারলাম যে, তুমি (দুনিয়ায়) তাঁর ওপর বিশ্বাসী ছিলে। আর মুনাফিক অথবা মুরতাব (সন্দেহ পোষণকারী) ফাতিমা বলেন, আসমা কোনটি বলেছিলেন, আমি ঠিক মনে করতে পারছি না- বলবে, আমি কিছুই জানিনা। মানুষকে (তাঁর সম্পর্কে) কি যেন বলতে শুনেছি, তাই আমিও তাই বলেছি। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৬৭/',
        name:
            '  আবুল কায়েস গোত্রের প্রতিনিধি দলকে ঈমান এবং ইলমের হিফাজত করা এবং পরবর্তীদেরকে তা অবহিত করার বাপারে নবী (ﷺ) এর উৎসাহ দান।',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'وَقَالَ مَالِكُ بْنُ الْحُوَيْرِثِ قَالَ لَنَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: ارْجِعُوا إِلَى أَهْلِيكُمْ، فَعَلِّمُوهُمْ মালিক ইবনুল হুওয়াইরিস (রাঃ) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের বলেছিলেন, তোমরা তোমাদের গোত্রের নিকট ফিরে যাও এবং তাদেরকে শিক্ষা দাও। ৮৭। মুহাম্মদ ইবনু বাশ্‌শার (রহঃ) ... আবূ জামরা (রহঃ) থেকে বর্ণিত, তিনি বলেন, আমি ইবনু আব্বাস (রাঃ) ও লোকদের মধ্যে দোভাষীর কাজ করতাম। একদিন ইবনু আব্বাস (রাঃ) বললেন, আবদুল কায়স গোত্রের প্রতিনিধি দল নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এলে, তিনি বললেনঃ তোমরা কোন্ প্রতিনিধি দল? অথবা বললেনঃ তোমরা কোন্ গোত্রের? তারা বলল, রাবীআ গোত্রের। তিনি বললেনঃ মারহাবা। এ গোত্রের প্রতি অথবা এ প্রতিনিধি দলের প্রতি, এরা কোনরূপ অপদস্থ না হয়েই এসেছে। তারা বলল, আমরা বহু দূর থেকে আপনার কাছে এসেছি। আর আমাদের ও আপনার মাঝে রয়েছে কাফিরদের এই মুযার গোত্রের বাস। আমরা শাহ্‌র-ই হারাম- ছাড়া আপনার কাছে আসতে সক্ষম নই। সুতরাং আমাদের এমন কিছু নির্দেশ দিন, যা আমাদের পশ্চাতে যারা রয়েছে তাদের কাছে পৌঁছাতে এবং তার ওসীলায় আমরা জান্নাতে দাখিল হতে পারি। তখন তিনি তাদের চারটি কাজের নির্দেশ দিলেন এবং চারটি কাজ থেকে নিষেধ করলেন। তাদের এক আল্লাহর উপর ঈমান আনার নির্দেশ দিলেন। তিনি বললেনঃ এক আল্লাহর উপর ঈমান আনা কিরূপে হয় জানো? তারা বললঃ আল্লাহ্ ও তাঁর রাসূলই ভাল জানেন। তিনি বললেনঃ তা হল এ সাক্ষ্য দেওয়া যে, আল্লাহ্ ছাড়া ইলাহ নেই এবং মুহাম্মদসাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আল্লাহর রাসূল, সালাত (নামায/নামাজ) কায়েম করা, যাকাত দেওয়া এবং রমযান এর সিয়াম পালন করা আর তোমাদের গনীমাতের মাল থেকে এক-পঞ্চমাংশ দান করবে। আর তাদের নিষেধ করলেন শুকনো লাউয়ের খোল, সবুজ কলস এবং আলকাতরার পালিশকৃত পাত্র ব্যবহার করতে। শুবা বলেন, কখনও (আবূ জামরা) খেজুর গাছ থেকে তৈরী পাত্রের কথাও বলেছেন আবার তিনি কখনও (النقير) এর স্থলে (المقير) বলেছেন। রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তোমরা এগুলো মনোযোগ সহকারে স্মরণ রাখ এবং তোমাদের পশ্চাতে যারা রয়েছে তাদের পৌঁছে দাও।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৬৮/',
        name: '  উদ্ভূত মাসআলার জন্য সফর করা এবং নিজের পরিজনদের শিক্ষা দেওয়া ।',
        hadisNumberList: [
          HadisNumberModel(
            id: '৮৮। ',
            name:
                '  মুহাম্মদ ইবনু মুকাতিল আবূল হাসান (রহঃ) ... উকবা ইবনুল হারিস (রাঃ) বর্ণনা করেন, তিনি আবূ ইহাব ইবনু আযীয (রহঃ)-এর কন্যাকে বিবাহ করলে তাঁর কাছে একজন স্ত্রীলোক এসে বলল, আমি উকবা (রাঃ)-কে এবং সে যাকে বিয়ে করেছে তাকে (আবূ ইহাবের কন্যাকে) দুধ পান করিয়েছি। উকবা (রাঃ) তাকে বললেনঃ আমি জানিনা যে, তুমি আমাকে দুধ পান করিয়েছ। আর (ইতিপূর্বে) তুমি আমাকে একথা জানাওনি। এরপর তিনি মদিনায় রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে গেলেন এবং তাঁকে জিজ্ঞাসা করলেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ এ কথার পর তুমি কিভাবে তার সঙ্গে সংসার করবে? এরপর উকবা তাঁর স্ত্রীকে আলাদা করে দিলেন এবং সে মহিলা অন্য স্বামীর সঙ্গে বিবাহ বন্ধনে আবদ্ধ হল।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৬৯/ ',
        name: 'পালাক্রমে ইলম শিক্ষা করা । ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৮৯। ',
            name:
                '  আবূল ইয়ামান (রহঃ) ও ইবনু ওহাব (রহঃ) ... উমর (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি ও আমার এক আনসারী প্রতিবেশী বনি উমায়্যা ইবনু যায়দের মহল্লায় বাস করতাম। এ মহল্লাহটি ছিল মদিনার ঊঁচু এলাকায় অবস্থিত। আমরা দুজনে পালাক্রমে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর খিদমতে হাযির হাতম। তিনি একদিন আসতেন আর আমি একদিন আসতাম। আমি যেদিন আসতাম, সেদিনের ওহী প্রভৃতির খবর নিয়ে তাঁকে পৌঁছে দিতাম। আর তিনি যেদিন আসতেন সেদিন তিনি অনুরূপ করতেন। এরপর একদিন আমার আনসারী সঙ্গী তাঁর পালার দিন এলেন এবং (সেখান থেকে ফিরে) আমার দরজায় খুব জোরে করাঘাত করতে লাগলেন। (আমার নাম নিয়ে) বলতে লাগলেন, তিনি কি এখানে আছেন? আমি ঘাবড়ে গিয়ে তাঁর দিকে গেলাম। তিনি বললেন, এক বিরাট ঘটনা ঘটে গেছে [রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর স্ত্রীগণকে তালাক দিয়েছেন]। আমি তখনি (আমার কন্যা) হাফসা (রাঃ)-এর কাছে গেলাম। তিনি তখন কাঁদছিলেন। আমি বললাম, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কি তোমাদের তালাক দিয়ে দিয়েছেন? তিনি বললেন, আমি জানিনা। এরপর আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে গেলাম এবং দাঁড়িয়ে থেকেই বললামঃ আপনি কি আপনার স্ত্রীদের তালাক দিয়েছেন? জবাবে তিনি বললেনঃ না। আমি তখন আল্লাহু আকবার বলে উঠলাম।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৭০ ',
        name: ' অপছন্দনীয় কিছু দেখলে ওয়ায-নাসীহত বা শিক্ষাদানের সময় রাগ করা',
        hadisNumberList: [
          HadisNumberModel(
            id: '৯০। ',
            name:
                '  মুহাম্মদ ইবনু কাসীর (রহঃ) ... আবূ মাসউদ আনসারী (রাঃ) থেকে বর্ণিত, তিনি বলেন, একবার এক ব্যাক্তি বলল, ইয়া রাসূলাল্লাহ! আমি সালাতে (জামাতে) শামিল হতে পারি না। কারন অমুক ব্যাক্তি আমাদের নিয়ে খুব লম্বা করে সালাত (নামায/নামাজ) আদায় করেন। [আবূ মাসউদ (রাঃ) বলেন,] আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে কোন ওয়াযের মজলিসে সেদিনের তুলনায় বেশি রাগান্বিত হতে দেখিনি। (রাগত স্বরে) তিনি বললেনঃ হে লোক সকল! তোমরা মানুষের মধ্যে বিরক্তির সৃষ্টি কর। অতএব যে লোকদের নিয়ে সালাত (নামায/নামাজ) আদায় করবে সে যেন সংক্ষেপ করে। কারন তাদের মধ্যে রোগী, দুর্বল ও কর্মব্যস্ত লোকও থাকে।',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ৯১।  ',
            name:
                'আবদুল্লাহ ইবনু মুহাম্মদ (রহঃ) ... যায়েদ ইবনু খালিদ আল-জুহানী (রাঃ) থেকে বর্ণিত যে, এক ব্যাক্তি রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে হারানো বস্তু প্রাপ্তি সম্পর্কে জিজ্ঞাসা করল। তিনি বললেনঃ তার বাঁধনের রশি অথবা বললেন, থলে-ঝুলি ভাল করে চিনে রাখ। এরপর এক বছর পর্যন্ত তার ঘোষণা দিতে থাক। তারপর (মালিক পাওয়া না গেলে) তুমি তা ব্যবহার কর। এরপর যদি এর মালিক আসে তবে তাকে তা দিয়ে দেবে। সে বলল, হারানো উট পাওয়া গেলে? এ কথা শুনে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এমন রেগে গেলেন যে, তাঁর চেহারা মুবারক লাল হয়ে গেল। অথবা বর্ণনাকারী বলেন, তাঁর মুখমন্ডল লাল হয়ে গেল। তিনি বললেনঃ উট নিয়ে তোমার কি হয়েছে? তার তো আছে পানির মশক ও শক্ত পা। পানির কাছে যেতে পারে এবং গাছের লতা-পাতা খেতে পারে। তাই তাকে ছেড়ে দাও, যাতে মালিক তাকে পেয়ে যায়। সে বলল, হারানো বকরী পাওয়া গেলে? তিনি বললেন, সেটি তোমার, নয়ত তোমার ভাইয়ের, নয়ত বাঘের।',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ৯২।',
            name:
                ' মুহাম্মদ ইবনুল আলা (রহঃ) ... আবূ মূসা (রাঃ) থেকে বর্ণিত, তিনি বলেন, একবার নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে কয়েকটি অপছন্দনীয় বিষয় সম্পর্কে জিজ্ঞাসা করা হল। প্রশ্নের সংখ্যা যখন বেশি হয়ে গেল, তখন তিনি রেগে গিয়ে লোকদের বললেনঃ তোমরা আমার কাছে যা ইচ্ছা প্রশ্ন কর। এক ব্যাক্তি বলল, আমার পিতা কে? তিনি বললেনঃ তোমার পিতা হুযাফা। আর এক ব্যাক্তি দাঁড়িয়ে বলল, ইয়া রাসূলাল্লাহ! আমার পিতা কে? তিনি বললেনঃ তোমার পিতা হল শায়বার মাওলা (আযাদকৃত গোলাম) সালিম। তখন উমর (রাঃ) রাসূলূল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এড় চেহারার অবস্থা দেখে বললেনঃ ইয়া রাসূলাল্লাহ! আমরা মহান আল্লাহ্ তাআলার কাছে তওবা করছি। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৭১। ',
        name: '  ইমাম বা মুহাদ্দিসের সামনে হাঁটু গেড়ে বসা',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ৯৩।',
            name:
                '  আবূল ইয়ামান (রহঃ) ... আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত, একবার রাসূলূল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বের হলেন। তখন আবদুল্লাহ ইবনু হুযাফা দাঁড়িয়ে বললেন, আমার পিতা কে? তিনি বললেনঃ তোমার পিতা হুযাফা। এরপর তিনি বারবার বলতে লাগলেন, তোমরা আমার কাছে প্রশ্ন কর। উমর (রাঃ) তখন হাঁটু গেড়ে বসে বললেনঃ আমরা আল্লাহকে রব হিসাবে, ইসলামকে দ্বীন হিসাবে এবং মুহাম্মদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে নবী হিসেবে সন্তুষ্ট চিত্তে গ্রহণ করে নিয়েছি। তিনি এ কথা তিনবার বললেন। তখন রাসূলূল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নীরব হলেন।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৭২।',
        name: ' ভালবাবে বুঝবার জন্য কোন কথা তিনবার বলা ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                ' নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ ‘মিথ্যা কথা থেকে সাবধান!’ এ কথাটি তিনি বারবার বলতে লাগলেন। ইবন ‘উমর (রাঃ) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (বিদায় হজ্জে) বলেছেনঃ আমি কি পৌঁছে দিয়েছি? একথা তিনি তিনবার বলেছেন। ৯৪। আবদা (রহঃ) ... আনাস (রাঃ) থেকে বর্ণিত, তিনি বলেন, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন সালাম করতেন, তিনবার সালাম করতেন। আর যখন কোন কথা বলতেন তা তিনবার বলতেন।',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ৯৫।',
            name:
                '  আবদা ইবনু আবদুল্লাহ (রহঃ) ... আনাস (রাঃ) থেকে বর্ণিত, তিনি বলেন, নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন কোন কথা বলতেন তখন তা তিনবার বলতেন যাতে তা বুঝে নেওয়া যায়। আর যখন কোন কওমের নিকট এসে সালাম করতেন, তাদের প্রতি তিনবার সালাম করতেন।',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ৯৬। ',
            name:
                ' মূসা’দ্দাদ (রহঃ) ... আবদুল্লাহ ইবনু আমর (রাঃ) থেকে বর্ণিত, তিনি বলেন, আমাদের এক সফরে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পেছনে রয়ে গেলেন। এরপর তিনি আমাদের নিকট এমন সময় পৌঁছলেন যখন আমাদের সালাতুল আসরের প্রস্তুতিতে দেরী হয়ে গিয়েছিল। আমরা উযূ (ওজু/অজু/অযু) করতে গিয়ে আমাদের পা মোটামুটিভাবে পানি দিয়ে ভিজিয়ে নিচ্ছিলাম। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উচ্চস্বরে ঘোষণা দিলেনঃ পায়ের গোড়ালী শুকনো থাকার জন্য জাহান্নামের শাস্তি রয়েছে। তিনি একথা দুবার কিংবা তিনবার বললেন।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৭৩। ',
        name: ' আপন দাসী ও পরিবারবর্গকে শিক্ষা দান ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৯৭।  ',
            name:
                ' মুহাম্মদ ইবনু সালাম (রহঃ) ... আবূ বুরদা (রহঃ), তাঁর পিতা থেকে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তিন ধরনের লোকের জন্য দুটি সওয়াব রয়েছেঃ (১) আহলে কিতাব—যে ব্যাক্তি তার নবীর ওপর ঈমান এনেছে এবং মুহাম্মদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর উপরও ঈমান এনেছে। (২) যে ক্রীতদাস আল্লাহর হক আদায় করে এবং তার মালিকের হকও (আদায় করে)। (৩) যার একটি বাঁদী ছিল, যার সাথে সে মিলিত হত। তারপর তাকে সে সুন্দরভাবে আদব-কায়দা শিক্ষা দিয়েছে এবং ভালভাবে দ্বীনী ইলম শিক্ষা দিয়েছে, এরপর তাকে আযাদ করে বিয়ে করেছে; তার জন্য দুটি সওয়াব রয়েছে। এরপর বর্ণনাকারী আমের (রহঃ) (তাঁর ছাত্রকে) বলেন, তোমাকে কোন কিছুর বিনিময় ছাড়াই হাদীসটি শিক্ষা দিলাম, অথচ এর চাইতে ছোট হাদীসের জন্যও লোক (দূর-দূরান্ত থেকে) সওয়ার হয়ে মদিনায় আসত।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৭৪।',
        name: '  আলিম কর্তৃক মহিলাদের নসীহত করা ও দীনী ইলম শিক্ষা দেওয়া',
        hadisNumberList: [
          HadisNumberModel(
            id: '৯৮।  ',
            name:
                'সুলায়মান ইবনু হারব (রহঃ) ... ইবনু আব্বাস (রাঃ) থেকে বর্ণিত, তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে সাক্ষ্য রেখে বলছি যে, অথবা পরবর্তী বর্ণনাকারী আতা (রহঃ) বলেন, আমি ইবনু আব্বাসকে সাক্ষী রেখে বলছি যে, নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (ঈদের দিন পুরুষের কাতার থেকে) বের হলেন আর তাঁর সঙ্গে ছিলেন বিলাল (রাঃ)। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মনে করলেন যে, দূরে থাকার কারনে তাঁর ওয়ায মহিলাদের কাছে পৌঁছে নি। তাই তিনি (পুনরায়) তাঁদের নসীহত করলেন এবং দান-খয়রাত করার উপদেশ দিলেন। তখন মহিলারা কানের দুল ও হাতের আংটি দিয়ে দিতে লাগলেন। আর বিলাল (রাঃ) সেগুলি তাঁর কাপড়ের আচঁলে নিতে লাগলেন। ইসমাঈল (রহঃ) ... আতা (রহঃ) সূত্রে বলেন যে, ইবনু আব্বাস (রাঃ) বলেনঃ আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে সাক্ষী রেখে বলছি। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৭৫। ',
        name: ' হাদিসের প্রতি আগ্রহ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৯৯।  ',
            name:
                'আবদুল আযীয ইবনু আবদুল্লাহ (রহঃ) ... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ একবার রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে জিজ্ঞাসা করা হলঃ ইয়া রাসুলাল্লাহ! কিয়ামতের দিন আপনার শাফা\'আত লাভে কে সবচাইতে বেশি ভাগ্যবান হবে? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, আবূ হুরায়রা! আমি ধারণা করেছিলাম, এ বিষয়ে তোমার আগে আমাকে আর কেউ প্রশ্ন করবে না। কারন আমি দেখেছি হাদীসের প্রতি তোমার বিশেষ আগ্রহ রয়েছে। কিয়ামতের দিন আমার শাফা\'আত লাভে সবচাইতে ভাগ্যবান হবে সেই ব্যাক্তি যে খালিস দিলে লা ইলাহা ইল্লাল্লাহ্ (পূর্ণ কালেমা তাইয়্যেবা) বলে। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৭৬। ',
        name: ' কিভাবে ইলম তুলে নেয়া হবে ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                '‘উমর ইবন আবদুল ‘আযীয (রহঃ) মদীনায় আবূ বকর ইবন হাযম (রহঃ)-এর কাছে এক পত্রে লিখেনঃ খোঁজ কর, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের যে হাদীস পাও তা লিখে নাও। আমি ইলম লোপ পাওয়ার এবং আলিমদের বিদায় নেওয়ার আশংকা করছি এবং জেনে রাখ, নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের হাদীস ছাড়া আর কিছুই গ্রহণ করা হবে না এবং প্রত্যেকের উচিৎ ইলমের প্রচার-প্রসার করা, আর তারা যেন একত্রে বসে (ইলমের চর্চা করে,) যাতে যে জানে না সে শিক্ষা লাভ করতে পারে। কারন ইলম গোপনীয় বিষয় না হওয়া পর্যন্ত বিলুপ্ত হবে না। ১০০। আলা ইবনু আবদুল জব্বার (রহঃ) ... আবদুল্লাহ ইবনু দ্বীনার (রহঃ)-এর সূত্রে বির্ণিত রিওয়ায়াতে উমর ইবনু আবদুল- আযীয (রহঃ)- এর উপরোক্ত হাদীসে আলিমগণের বিদায় নেওয়া’ পর্যন্ত বর্ণিত আছে। ',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ',
            name:
                ' ইসমা‘ঈল ইবনু আবূ উওয়ায়স (রহঃ) ... আবদুল্লাহ ইবনু ‘আমর ইবনুল ‘আস (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি যে, আল্লাহ্ তা‘আলা বান্দার অন্তর থেকে ইল্‌ম বের করে উঠিয়ে নেবেন না; বরং আলিমদের উঠিয়ে নেওয়ার মাধ্যমেই ইল্‌ম উঠিয়ে নেবেন। যখন কোন আলিম বাকী থাকবে না তখন লোকেরা জাহিলদেরই নেতা হিসেবে গ্রহণ করবে। তাদের জিজ্ঞাসা করা হবে, তারা না জেনেই ফতোয়া দিবে। ফলে তারা নিজেরাও গোমরাহ হবে, আর অপরকেও গোমরাহ করবে। ফিরাবরী (রহঃ) বলেন, আব্বাস (রহঃ) ... হিশাম সূত্রেও অনুরূপ বর্ণিত আছে।',
            ref: ' ১০১।',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৭৭।',
        name:
            '  ইলম শিক্ষার জন্য মহিলাদের ব্যাপারে কি আলাদা দিন নির্ধারণ করা যায়?',
        hadisNumberList: [
          HadisNumberModel(
            id: '১০২। ',
            name:
                ' আদম (রহঃ) ... আবূ সা‘ঈদ খুদরী (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ মহিলারা একবার নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলল, পুরুষেরা আপনার কাছে আমাদের চাইতে প্রাধান্য বিস্তার করে আছে। তাই আপনি নিজে আমাদের জন্য একটি দিন ধার্য করে দিন। তিনি তাদের বিশেষ একটি দিনের ওয়াদা করলেন; সে দিন তিনি তাদের সঙ্গে সাক্ষাৎ করলেন এবং তাদের ওয়ায-নসীহত করলেন ও নির্দেশ দিলেন। তিনি তাদের যা যা বলেছিলেন, তার মধ্যে একথাও ছিল যে, তোমাদের মধ্যে যে স্ত্রীলোক তিনটি সন্তান আগেই পাঠাবে,* তারা তার জন্য জাহান্নামের পর্দাস্বরূপ হয়ে থাকবে। তখন এক স্ত্রীলোক বলল, আর দু’টি পাঠালে? তিনি বললেনঃ দু’টি পাঠালেও। * তার জীবিতাবস্থায় তিনটি সন্তান মারা গেল। ',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ১০৩।',
            name:
                ' মুহাম্মদ ইবনু বাশশার (রহঃ) .... আবূ সা‘ঈদ (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে অনুরুপ বর্ণনা করেছেন।আবদুর রহমান আল-আসবাহানী (রহঃ) ... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ এমন তিন সন্তান, যারা সাবালক হয়নি। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৭৮।',
        name: ' কোন কথা শুনে না বুঝলে জানার জন্য পুনরায় জিজ্ঞেস করা ',
        hadisNumberList: [
          HadisNumberModel(
            id: '১০৪। ',
            name:
                '  সা‘ঈদ ইবনু আবূ মারয়াম (রহঃ) .... ইবনু আবূ মুলায়কা (রহঃ) বলেন, নবী করিম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহধর্মিণী ‘আয়িশা (রাঃ) কোন কথা শুনে বুঝতে না পারলে বার বার জিজ্ঞাসা করতেন। একবার নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, “(কিয়ামতের দিন) যার হিসাব নেওয়া হবে তাকে আযাব দেওয়া হবে।” ‘আয়িশা (রাঃ) বলেনঃ আমি জিজ্ঞাসা করলাম, আল্লাহ্ তা‘আলা কি ইরশাদ করেননি, (فَسَوْفَ يُحَاسَبُ حِسَابًا يَسِيرًا‏) (তার হিসার-নিকাশ সহজেই নেওয়া হবে) (৮৪ : ৮)। তখন তিনি বললেনঃ তা কেবল হিসাব পেশ করা। কিন্তু যার হিসাব পুঙ্খানুপুঙ্খরুপে নেওয়া হবে সে ধবংস হবে।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৭৯।',
        name: ' উপস্থিত ব্যাক্তি অনুপস্থিত ব্যাক্তির কাছে ইলম পৌঁছে দেবে ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'قَالَهُ ابْنُ عَبَّاسٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ইবনু আব্বাস (রাঃ) নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে তা বর্ণনা করেন। ১০৫। আবদুল্লাহ ইবনু ইউসুফ (রহঃ) ... আবূ শুরায়হ (রাঃ) থেকে বর্ণিত যে, তিনি ‘আমর ইবনু সা‘ঈদ (মদিনার গভর্নর)-কে বললেন, যখন তিনি মক্কায় সেনাবাহিনী প্রেরণ করছিলেন— ‘হে আমীর! আমাকে অনুমতি দিন, আমি আপনাকে এমন একটি হাদীস শোনাব, যা মক্কা বিজয়ের পরের দিন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছিলেন। আমার দু’ কান তা শুনেছে, আমার অন্তর তা স্মরণ রেখেছে, আর আমার দু’ চোখ তা দেখেছে। তিনি আল্লাহর প্রশংসা ও মহিমা বর্ণনা করে বললেনঃ মক্কাকে আল্লাহ্ তা‘আলা হারাম করেছেন, কোন মানুষ তাকে হারাম করেনি। তাই যে লোক আল্লাহর উপর এবং আখিরাতের উপর ঈমান রাখে তার জন্য সেখানে রক্তপাত করা এবং সেখানকার কোন গাছপালা কাটা হালাল নয়। কেউ যদি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর (সেখানকার) লড়াইকে দলীল হিসেবে পেশ করে তবে তোমরা বলে দিও যে, আল্লাহ্ তা‘আলা তাঁর রাসূলকে এর অনুমতি দিয়েছিলেন; কিন্তু তোমাদের অনুমতি দেননি। আমাকেও সে দিনের কিছু সময়ের জন্য অনুমতি দিয়েছিলেন। তারপর আগের মতো আজ আবার এর নিষেধাজ্ঞা ফিরে এসেছে। উপস্থিত ব্যাক্তিরা যেন অনুপস্থিত ব্যাক্তিদের কাছে (এ বাণী) পৌঁছে দেয়। তারপর আবূ শুরাইয়া (রাঃ)-কে জিজ্ঞাসা করা হল, ‘আপনার এ হাদীস শুনে ‘আমর কি বলল?’ (আবূ শুরাইয়া (রাঃ) উত্তর দিলেন) সে বললঃ ‘হে আবূ শুরাইয়া! (এ বিষয়ে) আমি তোমার চাইতে ভাল জানি। মক্কা কোন বিদ্রোহীকে, কোন খুনের পলাতক আসামীকে এবং কোন সন্ত্রাসীকে আশ্রয় দেয় না। ',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ১০৬।',
            name:
                ' আবদুল্লাহ ইবনু আবদুল ওয়াহহাব (রহঃ) .... আবূ বাকরা (রাঃ) রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কথা উল্লেখ করে বলেন যে, তিনি বলেছেনঃ তোমাদের জান, তোমাদের মাল – বর্ণনাকারী মুহাম্মদ (রহঃ) বলেন, ‘আমার মনে হয়, তিনি বলেছিলেনঃ এবং তোমাদের মানসম্মান (অন্য মুসলিমের জন্য) এ শহরে এ দিনের মতই মর্যাদা সম্পন্ন। শোন, (আমার এ বাণী যেন) তোমাদের মধ্যে উপস্থিত ব্যাক্তি অনুপস্থিত ব্যাক্তির কাছে পৌঁছে দেয়। বর্ণনাকারী মুহাম্মদ (রহঃ) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সত্য বলেছেন, তা-ই হয়েছে। তারপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দু’বার করে বলেন, হে লোক সকল! ‘আমি কি পৌঁছে দিয়েছি?’ ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৮০। ',
        name: 'নবী করীম (ﷺ) এর উপর মিথ্যারোপ করার গুনাহ ',
        hadisNumberList: [
          HadisNumberModel(
            id: '১০৭। ',
            name:
                ' আলী ইবনুল জা‘দ (রহঃ) .... ‘আলী (রাঃ) থেকে বর্ণিত, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা আমার উপর মিথ্যা আরোপ করো না। কারণ আমার ',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ১০৮।  ',
            name:
                'আবুল ওয়ালিদ (রহঃ) ... আবদুল্লাহ ইবনুয যুবাইর (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি আমার পিতা যুবাইরকে বললামঃ আমি তো আপনাকে অমুক অমুকের ন্যায় রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর হাদিস বর্ণনা করতে শুনি না। তিনি বললেনঃ জেনে রাখ, আমি তাঁর থেকে দূরে থাকিনি, কিন্তু (হাদিস বর্ণনা করি না এজন্য যে) আমি তাঁকে বলতে শুনেছি, যে আমার উপর মিথ্যারোপ করবে সে যেন জাহান্নামে তার ঠিকানা বানিয়ে নেয়।',
            ref: '',
          ),
          HadisNumberModel(
            id: '১০৯।  ',
            name:
                ' আবূ মা‘মার (রহঃ) ..... আনাস (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ এ কথাটি তোমাদেরকে বহু হাদীস বর্ণনা করতে আমাকে বাধা দেয় যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ইচ্ছাকৃতভাবে আমার উপর মিথ্যা আরোপ করে সে যেন জাহান্নামে তার ঠিকানা বানিয়ে নেয়।',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ১১০। ',
            name:
                ' মাক্কী ইবনু ইবরাহীম (রহঃ) ... সালমা ইবনু আকওয়া (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম–কে বলতে শুনেছি, যে ব্যাক্তি আমার উপর এমন কথা আরোপ করে যা আমি বলিনি, সে যেন জাহান্নামে তার ঠিকানা বানিয়ে নেয়।',
            ref: '',
          ),
          HadisNumberModel(
            id: '  ১১১।',
            name:
                ' মূসা (রহঃ) .... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমার নামে তোমরা নাম রেখ; কিন্তু আমার উপনামে (কুনিয়াতে) তোমরা উপনামে রেখ না। আর যে আমাকে স্বপ্নে দেখে সে ঠিক আমাকেই দেখে। কারণ শয়তান আমার আকৃতির ন্যায় রুপ ধারণ করতে পারে না। যে ইচ্ছাকৃতভাবে আমার উপর মিথ্যা আরোপ করে সে যেন জাহান্নামে তার ঠিকানা বানিয়ে নেয়।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৮১।  ',
        name: ' ইলম লিপিবদ্ধ করা',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ১১২। ',
            name:
                'মুহাম্মদ ইবনু সালাম (রহঃ) .... আবূ জুহায়ফা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি ‘আলী (রাঃ)-কে জিজ্ঞাসা করলাম, আপনাদের কাছে কি লিখিত কিছু আছে? তিনি বললেনঃ ‘না, কেবলমাত্র আল্লাহর কিতাব রয়েছে, আর সেই বুদ্ধি ও বিবেক, যা একজন মুসলিমকে দান করা হয়। এ ছাড়া যা কিছু এ পত্রটিতে লেখা আছে। আবূ জুহায়ফা (রাঃ) বলেন, আমি বললাম, এ পত্রটিতে কি আছে? তিনি বললেন, ‘দিয়াতের (আর্থির ক্ষতিপূরণ) ও বন্দী মুক্তির বিধান, আর এ বিধানটিও যে, মুসলিমকে কাফিরের বিনিময়ে হত্যা করা যাবে না। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '১১৩। ',
            name:
                '  আবূ নু‘আয়ম ফাযল ইবনু দুকায়ন (রহঃ) .... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত যে, মক্কা বিজয়ের কালে খুযা‘আ গোত্র লায়স গোত্রের এক ব্যাক্তিকে হত্যা করল। এ হত্যা ছিল তাদের এক নিহত ব্যাক্তির প্রতিশোধ স্বরূপ, যাকে ইতিপূর্বে লায়স গোত্রের লোক হত্যা করেছিল। তারপর এ খবর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে পোঁছল। তিনি তাঁর উটের উপর আরোহণ করে খুতবা দিলেন, তিনি বললেনঃ আল্লাহ তা‘আলা মক্কা থেকে ‘হত্যা’- কে (অথবা বর্ণনাকারী বললেন) ‘হাতী’-কে রোধ করেছেন। ইমাম বুখারী (রহঃ) বলেন, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ‘হত্যা’ বলেছেন না ‘হাতী’ বলেছেন এ ব্যাপারে বর্ণনাকারী আবূ নু‘আয়ম সন্দেহ পোষণ করেন। অন্যেরা শুধু ‘হাতী’ শব্দ উল্লেখ করেছেন। অবশ্য মক্কাবাসীদের উপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এবং মু’মিনগনকে (যুদ্ধের মাধ্যমে) বিজয়ী করা হয়েছে। জেনে রাখ, আমার পূর্বে কারো জন্য মক্কা (নগরীতে লড়াই করা) হালাল করা হয়নি এবং আমার পরও কারো জন্য হালাল হবে না। জেনে রাখ, তাও আমার জন্য দিনের কিছু সময় মাত্র হালাল করা হয়েছিল। আরো জেনে রাখ, আমার এই কথা বলার মুহূর্তে আবার তা হারাম হয়ে গেছে। সেখানকার কোন কাঁটা ও কোন গাছপালা কাটা যাবে না এবং সেখানে পড়ে থাকে কোন বস্তু কুড়িয়ে নেওয়া যাবেনা। তবে ঘোষণা করার জন্য নিতে পারবে। আর যদি কেউ নিহত হয়, তবে তার আপনজনের জন্য দুটি ব্যবস্থার যে কোন একটির অধিকার রয়েছে। হয় তার ‘দিয়াত নিবে নয় ‘কিসাস’ গ্রহণ করবে। এরপর ইয়ামানবাসী এক ব্যাক্তি এসে বলল, ইয়া রাসূলাল্লাহ! (এ কথাগুলো) আমাকে লিখে দিন। তিনি (সাহাবীদের) বললেনঃ তোমরা তাকে (আবূ শাহকে) লিখে দাও। তারপর একজন কুরায়শী [আব্বাস (রাঃ)] বললেন, ‘ইয়া রাসূলাল্লাহ! গাছপালা কাটার নিষেধাজ্ঞা হতে ইযখির বাদ রাখুন। কারণ তা আমরা আমাদের ঘরে ও কবরে ব্যবহার করি। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, ‘ইযখির ছাড়া, ইযখির ছাড়া।* * ইযখির শন জাতীয় এক প্রকার ঘাস।',
            ref: '',
          ),
          HadisNumberModel(
            id: '১১৪।  ',
            name:
                ' আলী ইবনু আবদুল্লাহ (রহঃ) .... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাহাবীগণের মধ্য আবদুল্লাহ ইবনু আমর (রাঃ) ব্যতীত আর কারো কাছে আমার চাইতে বেশী হাদীস নেই। কারণ তিনি লিখে রাখতেন, আর আমি লিখতাম না। মা\'মার (রহঃ) হাম্মাম (রহঃ) সূত্রে আবূ হুরায়রা (রাঃ) থেকে অনুরূপ বর্ণনা করেছেন।',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ১১৫। ',
            name:
                'ইয়াহইয়া ইবনু সুলায়মান (রহঃ) ... ইবনু আব্বাস (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর রোগ যখন বেড়ে গেল তখন তিনি বললেনঃ আমার কাছে কাগজ কলম নিয়ে এস, আমি তোমাদের এমন কিছু লিখে দিব যাতে পরবর্তীতে তোমরা ভ্রান্ত না হও। ‘উমর (রাঃ) বললেন, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর রোগ যন্ত্রণা প্রবল হয়ে গেছে (এমতাবস্থায় কিছু বলতে বা লিখতে তাঁর কষ্ট হবে)। আর আমাদের কাছে তো আল্লাহর কিতাব রয়েছে, যা আমাদের জন্য যথেষ্ট। এতে সাহাবীগণের মধ্য মতবিরোধ দেখা দিল এবং শোরগোল বেড়ে গেল। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তোমরা আমার কাছ থেকে উঠে যাও। আমার কাছে ঝগড়া-বিবাদ করা উচিত নয়। এ পর্যন্ত বর্ণনা করে ইবনু আব্বাস (রাঃ) (যেখানে বসে হাদীস বর্ণনা করছিলেন সেখান থেকে) এ কথা বলতে বলতে বেরিয়ে গেলেন যে, ‘হায় বিপদ, সাংঘাতিক বিপদ! রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এবং তাঁর লেখনীর মধ্যে যা বাধ সেধেছে। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৮২। ',
        name: ' রাতে ইলম শিক্ষাদান এবং ওয়ায-নসিহত করা ',
        hadisNumberList: [
          HadisNumberModel(
            id: '১১৬। ',
            name:
                '  সাদাকা, ‘আমর ও ইয়াহিয়া ইবনু সা‘ঈদ (রহঃ) .... উম্মে সালামা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ এক রাতে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঘুম থেকে জেগে বলেনঃ সুবহানআল্লাহ! এ রাতে কতই না বিপদাপদ নেমে আসছে এবং কতই না ভান্ডার খুলে দেওয়া হচ্ছে! অন্য সব ঘরের মহিলাগণকেও জানিয়ে দাও, বহু মহিলা যারা দুনিয়ায় বস্ত্র পরিহিতা, তারা আখিরাতে হবে বস্ত্রহীনা।',
            ref: '',
          ),
          HadisNumberModel(
            id: '১১৭।  ',
            name:
                'সা‘ঈদ ইবনু ‘উফায়র (রহঃ) ... ‘আবদুল্লাহ ইবনু উমর (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর জীবনের শেষের দিকে আমাদের নিয়ে ‘ইশার সালাত (নামায/নামাজ) আদায় করলেন। সালাম ফিরাবার পর তিনি দাঁড়িয়ে বললেন, তোমরা কি এ রাতের সম্পর্কে জানো? বর্তমানে যারা পৃথিবীতে রয়েছে, একশ বছরের মাথায় তাদের কেউ আর বাকী থাকবে না।',
            ref: '',
          ),
          HadisNumberModel(
            id: '১১৮। ',
            name:
                ' আদম (রহঃ) ..... ইবনু আব্বাস (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি আমার খালা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহধর্মিণী মায়মূনা বিন্‌ত হারিস (রাঃ)-এর ঘরে এক রাত্রি যাপন করছিলাম। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর পালার রাতে সেখানে ছিলেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ‘ইশার সালাত (নামায/নামাজ) আদায় করে তাঁর ঘরে চলে আসলেন এবং চার রাক‘আত সালাত আদায় করে শুয়ে পড়লেন। কিছুক্ষণ পর উঠে বললেনঃ বালকটি কি ঘুমিয়ে গেছে? বা এ ধরনের কোন কথা বললেন। তারপর (সালাতে) দাঁড়িয়ে গেলেন, আমিও তাঁর বাঁ দিকে গিয়ে দাঁড়ালাম। তিনি আমাকে তাঁর ডান দিকে এনে দাঁড় করালেন। তারপর তিনি পাঁচ রাক‘আত সালাত আদায় করলেন। পরে আরো দু’ রাক‘আত আদায় করলেন। এরপর শুয়ে পড়লেন। এমনকি আমি তাঁর নাক ডাকার শব্দ শুনতে পেলাম। এরপর উঠে তিনি (ফজরের) সালাতের জন্য বের হলেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৮৪। ',
        name: ' ইলম মুখস্ত করা ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ১১৯। ',
            name:
                '‘আবদুল ‘আযীয ইবনু ‘আবদুল্লাহ (রহঃ) ... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ লোকে বলে, আবূ হুরায়রা (রাঃ) বড় বেশী হাদীস বর্ণনা করে। (জেনে রাখ,) কিতাবে দুটি আয়াত যদি না থাকত, তবে আমি একটি হাদিসও বর্ণনা করতাম না। এরপর তিনি তিলাওয়াত করলেনঃ إِنَّ الَّذِينَ يَكْتُمُونَ مَا أَنزَلْنَا مِنَ الْبَيِّنَاتِ وَالْهُدَىٰ مِن بَعْدِ مَا بَيَّنَّاهُ لِلنَّاسِ فِي الْكِتَابِ أُولَٰئِكَ يَلْعَنُهُمُ اللَّهُ وَيَلْعَنُهُمُ اللَّاعِنُونَ إِلَّا الَّذِينَ تَابُوا وَأَصْلَحُوا وَبَيَّنُوا فَأُولَٰئِكَ أَتُوبُ عَلَيْهِمْ وَأَنَا التَّوَّابُ الرَّحِيمُ “আমি সেসব স্পষ্ট নিদর্শন ও পথ-নির্দেশ অবতীর্ণ করেছি মানুষের জন্য কিতাবে তা স্পষ্টভাবে ব্যক্ত করার পরও যারা তা গোপন রাখে আল্লাহ তাদেরকে লা‘নত দেন এবং অভিশাপকারিগণও তাদেরকে অভিশাপ দেয় কিন্তু যারা তওবা করে এবং নিজদিগকে সংশোধন আর সত্যকে সুস্পষ্টভাবে ব্যক্ত করে, ওরাই তারা, যাদের প্রতি আমি ক্ষমাশীল, পরম দয়ালু।” (সূরা বাকারাঃ ১৫৯-১৬০) (প্রকৃত ঘটনা এই যে,) আমার মুহাজির ভাইয়েরা বাজারে কেনাবেচায় এবং আমার আনসার ভাইয়েরা জমা-জমির কাজে মশগুল থাকত। আর আবূ হুরায়রা (রাঃ) (খেয়ে না খেয়ে) তুষ্ট থেকে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে লেগে থাকত। তাই তারা যখন উপস্থিত থাকত না, তখন সে উপস্থিত থাকত এবং তারা যা মুখস্থ করত না সে তা মুখস্থ রাখত। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '১২০। ',
            name:
                '  আবূ মুস‘আব আহমদ ইবনু আবূ বাকর (রহঃ) ... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি বললাম, ইয়া রাসূলাল্লাহ! আমি আমি আপনার কাছ থেকে বহু হাদীস শুনি কিন্তু ভুলে যাই। তিনি বলবেন তোমার চাঁদর খুলে ধর। আমি খুলে ধরলাম। তিনি দু’হাত অঞ্জলী করে তাতে কিছু ঢেলে দেওয়ার মত করে বললেনঃ এটা তোমার বুকের সাথে লাগিয়ে ধর। আমি তা বুকের সাথে লাগালাম। এরপর আমি আর কিছুই ভুলিনি।',
            ref: '',
          ),
          HadisNumberModel(
            id: '১২১। ',
            name:
                ' ইবরাহীম ইবনুল মুনযির (রহঃ) ..... ইবনু আবূ ফুদায়ক (রহঃ) সূত্রে অনুরূপ হাদীস বর্ণনা করেন এবং তাতে বলেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর হাত দিয়ে সে চাঁদরের মধ্য (কিছু) দিলেন। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '১২২।  ',
            name:
                'ইসমা‘ঈল (রহঃ) .... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে ইল্‌মের দুটি পাত্র মুখস্থ করে রেখেছিলাম। তার একটি পাত্র বিতরণ করে দিয়েছি। আর অপরটি প্রকাশ করলে আমার কন্ঠনালী কেটে দেওয়া হবে। আবূ আবদুল্লাহ (রহঃ) বলেন, হাদীসে উল্লিখিতبلعوم শব্দের অর্থ খাদ্যনালী। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৮৫।  ',
        name: ' আলিমদের কথা শোনার জন্য লোকদের চুপ করানো',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ১২৩।',
            name:
                ' হাজ্জাজ (রহঃ) .... জারীর (রাঃ) থেকে বর্ণিত যে, বিদায় হাজ্জের সময় নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে বললেনঃ তুমি লোকদেরকে চুপ করিয়ে দাও, তারপর তিনি বললেনঃ আমার পরে তোমরা কাফির (এর মত) হয়ে যেও না যে, একে অপরের গর্দান কাটবে। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৮৬।',
        name:
            '  আলিমদের জন্য মুস্তাহাব এই যে, তাঁকে যখন প্রশ্ন করা হয়ঃ সবচাইতে জ্ঞানী কে? তখন তিনি ইহা আল্লাহর উপর ন্যাস্ত করবেন।',
        hadisNumberList: [
          HadisNumberModel(
            id: '১২৪। ',
            name:
                '  আবদুল্লাহ ইবনু মুহাম্মদ আল-মুসনাদী (রহঃ) ... সা‘ঈদ ইবনু জুবায়র (রহঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি ইবনু ‘আব্বাস (রাঃ)-কে বললাম, নাওফ আল-বাকালী দাবী করে যে, মূসা (আঃ) [যিনি খাযির (আঃ) এর সাক্ষাৎ লাভ করেছিলেন] বনী ইসরাঈলের মূসা নন বরং তিনি অন্য এক মূসা। (একথা শুনে তিনি) তিনি বললেনঃ আল্লাহর দুশমন মিথ্যা বলেছে। উবাঈ ইবনু কা‘ব (রাঃ) রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে আমাদের কাছে বর্ণনা করেছেন যে, তিনি ইরশাদ করেনঃ মূসা (আঃ) একবার বনী ইসরাঈলদের মধ্য বক্তৃতা দিতে দাঁড়ালেন। তখন তাঁকে প্রশ্ন করা হয়, সবচাইতে জ্ঞানী কে? তিনি বললেন, আমি সবচাইতে জ্ঞানী। মহান আল্লাহ তাঁকে সতর্ক করে দিলেন। কেননা তিনি ইল্‌মকে আল্লাহর উপর ন্যাস্ত করেন নি। তারপর আল্লাহ তাঁর নিকট এ ওহী পাঠালেনঃ দুই সমুদ্রের সংগমস্থলে আমার বান্দাদের মধ্য এক বান্দা রয়েছে, যে তোমার চাইতে বেশী জ্ঞানী।তিনি বলেন, ইয়া রব! কিভাবে তাঁর সাক্ষাৎ পাওয়া যাবে? তখন তাঁকে বলা হল, থলের মধ্য একটি মাছ নিয়ে নাও। এরপর যেখানে সেটি হারিয়ে ফেলবে সেখানেই তাঁকে পাবে। তারপর তিনি রওয়ানা হলেন এবং ইউশা ইবনু নূন নামক তাঁর একজন খাদিমও তাঁর সাথে চলল। তাঁরা থলের মধ্য একটি মাছ নিলেন। চলার পথে তাঁরা একটি বড় পাথরের কাছে এসে, সেখানে মাথা রেখে শুয়ে পড়লেন। তারপর মাছটি (জীবিত হয়ে) থলে থেকে বেরিয়ে গেল এবং সুড়ঙ্গের মত পথ করে সমুদ্রে চলে গেল। এ ব্যাপারটি মূসা (আঃ) ও তাঁর খাদিম-এর জন্য ছিল আশ্চর্যের বিষয়। এরপর তাঁরা তাঁদের বাকী রাতটুকু এবং পরের দিনভর চলতে থাকলেন। পরে ভোরবেলা মূসা (আঃ) তাঁর খাদিমকে বললেন, ‘আমাদের নাশতা নিয়ে এস, আমরা আমাদের এ সফরে ক্লান্ত হয়ে পড়েছি, আর মূসা (আঃ)-কে যে স্থানের নির্দেশ দেওয়া হয়েছিল, সে স্থান অতিক্রম করার পূর্বে তিনি ক্লান্ত অনুভব করেন নি। তারপর তাঁর খাদিম তাঁকে বলল, ‘আপনি কি লক্ষ্য করেছন, আমরা যখন পাথরের পাশে বিশ্রাম করছিলাম, তখন আমি মাছের কথা ভুলে গিয়েছি? মূসা (আঃ) বললেন, ‘আমরা তো সেই স্থানটই খুঁজছিলাম। তারপর তাঁরা তাঁদের পদচিহ্ন ধরে ফিরে চলল। তাঁরা সেই পাথরের কাছে পোঁছে, কাপড়ে আবৃত (বর্ণনাকারী বলেন) কাপড় মুড়ি দেওয়া এক ব্যাক্তিকে দেখতে পেলেন। মূসা (আঃ) তাঁকে সালাম দিলেন। তখন খাযির বললেন, এ দেশে সালাম কোথা থেকে এল! তিনি বললেন, আমি মূসা। খাযির জিজ্ঞাসা করলেন, ‘বনী ইসরাইলের মূসা? তিনি বললেন, হ্যাঁ। তিনি আরো বললেন, আমি কি আপনাকে অনুসরণ করতে পারি এ শর্তে যে, সত্য পথের যে জ্ঞান আপনাকে দান করা হয়েছে, তা থেকে আমাকে শিক্ষা দিবেন? খাযির বললেন, তুমি কিছুতেই আমার সঙ্গে ধৈর্য ধারণ করতে পারবে না। ‘মূসা (আঃ) বললেন, আল্লাহ চাইলে আপনি আমাকে ধৈর্যশীল পাবেন এবং আমি আপনার আদেশ অমান্য করব না। তারপর তাঁরা দুজন সমুদ্র তীর দিয়ে চলতে লাগলেন, তাঁদের কোন নৌকা ছিল না। ইতিমধ্যে তাঁদের কাছ দিয়ে একটি নৌকা যচ্ছিল। তাঁরা নৌকাওয়ালাদের সঙ্গে তাঁদের আরোহণ করিয়ে নেওয়ার কথা বললেন। তারা খাযিরকে চিনতে পারল এবং ভাড়া ব্যতিরেকে তাঁদের নৌকায় তুলে নিল। তখন একটি চড়ুই পাখি এসে নৌকার এক প্রান্তে বসে দুই-একবার সমুদ্রে তার ঠোঁট মারল। খাযির বললেন, ‘হে মূসা! আমার ইল্‌ম এবং তোমার ইল্‌ম (সব মিলেও) আল্লাহর ইল্‌ম থেকে সমুদ্র থেকে চড়ুই পাখির ঠোঁটে যতটুকু পানি এসেছে ততটুকু পরিমাণও কমাতে পারবে না। এরপর খাযির নৌকার তক্তাগুলির মধ্য থেকে একটি খুলে ফেললেন। মূসা (আঃ) বললেন, এরা আমাদের ভাড়া ছাড়া আরোহণ করিয়েছে, আর আপনি আরোহীদের ডুবিয়ে দেওয়ার জন্য নৌকায় ফাটল সৃষ্টি করলেন? খাযির বললেন, আমি কি বলিনি যে, তুমি কিছুতেই আমার সঙ্গে ধৈর্য ধারণ করতে পারবে না। মূসা (আঃ) বললেন, আমার ভুলের জন্য আমাকে অপরাধী করবেন না এবং আমার ব্যাপারে অধির কঠোরতা অবলম্বন করবেন না। বর্ণনাকারী বলেন, ইহা মূসা (আঃ) এর প্রথম ভুল। তারপর তাঁরা উভয়ে (নৌকা থেকে নেমে) চলতে লাগলেন। (পথে) একটি বালক অন্যান্য বালকের সাথে খেলছিল। খাযির তার মাথার উপর দিক দিয়ে ধরলেন এবং হাত দিয়ে তার মাথা ছিদ্র করে ফেললেন। মূসা (আঃ) বললেন, ‘আপনি কি একটি নিষ্পাপ জীবন নাশ করলেন কোন হত্যার অপরাধ ছাড়াই?’ খাযির বললেন, আমি তোমাকে বলিনি যে, তুমি কিছুতেই আমার সঙ্গে ধৈর্য ধারণ করতে পারবে না? ইবনু ‘উয়ায়না (রহঃ) বলেন, এটা ছিল পূর্বের চেয়ে বেশী জোরালো। তারপর আবারো চলতে লাগলেন; চলতে চলতে তাঁরা এক গ্রামের অধিবাসীদের কাছে পৌঁছে তাদের কাছে খাবার চাইলেন, কিন্তু তারা তাঁদের মেহমানদারী করতে অস্বীকার করল। তারপর সেখানে তাঁরা এক পতনোন্মুখ প্রাচীর দেখতে পেলেন। খাযির তাঁর হাত দিয়ে সেটি খাড়া করে দিলেন। মূসা (আঃ) বললেন, ‘আপনি ইচ্ছে করলে এর জন্য পারিশ্রমিক গ্রহণ করতে পারতেন। তিনি বললেন, এখানেই তোমার আর আমার সম্পর্কের অবসান। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আল্লাহ তা‘আলা মূসার (আঃ) এর ওপর রহম করুন। আমাদের কতই না মনোবাঞ্ছা পূর্ণ হতো যদি তিনি সবর করতেন, তাহলে আমাদের কাছে তাঁদের আরো ঘটনাবলী বর্ণনা করা হতো। মুহাম্মদ ইবনু ইউসুফ আলী ইবনু খাসরাম সুফিয়ান ইবনু উয়ায়না (রহঃ) এ হাদিসটি বিশদভাবে বর্ণনা করেন।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৮৭।',
        name: ' আলিমের বসা থাকা অবস্থায় দাঁড়িয়ে প্রশ্ন করা ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ১২৫।',
            name:
                '  উসমান (রহঃ) ... আবূ মূসা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ এক ব্যাক্তি নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এসে বলল, ‘ইয়া রাসুলাল্লাহ! আল্লাহর রাস্তায় যুদ্ধ কোনটি, কেননা আমাদের কেউ লড়াই করে রাগের বশীভূত হয়ে, আবার কেউ লড়াই করে প্রতিশোধ গ্রহণের জন্য। তিনি তার দিকে মাথা তুলে তাকালেন। বর্ণনাকারী বলেন, তাঁর মাথা তোলার কারণ ছিল যে, সে ছিল দাঁড়ানো। এরপর তিনি বললেনঃ আল্লাহর দ্বীনকে বুলন্দ করার জন্য যে যুদ্ধ করে সেই আল্লাহর রাস্তায়।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৮৮। ',
        name: 'কংকর মারার সময় কোন মাসআলা জিজ্জেস করা ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ১২৬। ',
            name:
                'আবূ নু‘আয়ম (রহঃ) ... ‘আবদুল্লাহ ইবনু আমর (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে দেখলাম, জামরার নিকট তাঁকে মাস‘আলা জিজ্ঞাসা করা হছে। এক ব্যাক্তি জিজ্ঞাসা করলঃ ইয়া রাসুলাল্লাহ! আমি কংকর মারার আগেই কুরবানী করে ফেলেছি। তিনি বললেনঃ কংকর মার, তাতে কোন ক্ষতি নেই। অন্য এক ব্যাক্তি জিজ্ঞাসা করলঃ ইয়া রাসুলাল্লাহ! আমি কুরবানী করার পূর্বেই মাথা মুড়ে ফেলেছি। তিনি বললেনঃ কুরবানী করে নাও, কোন ক্ষতি নেই। বস্তুত আগে পিছু করার যে কোন প্রশ্নই তাঁকে করা হচ্ছিল, তিনি বলছিলেনঃ কর, কোন ক্ষতি নেই। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৮৯।',
        name:
            ' আল্লাহ্‌ তায়ালার বাণীঃ (وَمَا أُوتِيتُمْ مِنْ الْعِلْمِ إِلَّا قَلِيلًا) তোমাদেরকে ইলম দেওয়া হয়েছে অতি অল্পই। ',
        hadisNumberList: [
          HadisNumberModel(
            id: '১২৭।  ',
            name:
                ' কায়স ইবনু হাফস (রহঃ) ... ‘আবদুল্লাহ ইবনু মাস‘ঊদ (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ একবার আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে মদিনার বসতিহীন এলাকা দিয়ে চলছিলাম। তিনি একখানি খেজুরের ডালে ভর দিয়ে একদল ইয়াহুদীর কাছ দিয়ে যাচ্ছিলেন। তখন তারা একজন অন্যজনকে বলতে লাগল, তাঁকে রূহ সম্পর্কে জিজ্ঞাসা কর। আর একজন বলল, তাঁকে কোন প্রশ্ন করো না, হয়ত এমন কোন জওয়াব দিবেন যা তোমার পছন্দ করো না। আবার তাদের কেউ কেউ বলল, তাঁকে আমরা প্রশ্ন করবই। তারপর তাদের মধ্য থেকে এক ব্যাক্তি দাঁড়িয়ে বলল, হে আবূল কাসিম! রূহ কী? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম চুপ করে রইলেন, আমি মনে মনে বললাম, তাঁর প্রতি ওহী নাযিল হচ্ছে। তাই আমি দাঁড়িয়ে রইলাম। তারপর যখন সে অবস্থা কেটে গেল তখন তিনি বললেনঃ وَيَسْأَلُونَكَ عَنْ الرُّوحِ قُلْ الرُّوحُ مِنْ أَمْرِ رَبِّي وَمَا أُوتُوا مِنْ الْعِلْمِ إِلَّا قَلِيلًا তারা তোমাকে রূহ সম্পর্কে প্রশ্ন করে। বল, রূহ আমার প্রতিপালকের আদেশঘটিত। এবং তাদেরকে সামান্যই জ্ঞান দেওয়া হয়েছে। (সূরা ইসরাঃ ৮৫)। আ‘মাশ (রহ.) বলেন, এভাবেই আয়াতটিকে আমাদের কিরাআতে أُوْتِيْتُمْ -এর স্থলে أُوْتُوْ পড়া হয়েছে।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৯০। ',
        name:
            '  কোন কোন মুস্তাহাব কাজ এই আশঙ্কায় ছেড়ে দেওয়া যে,কিছু লোক ভুল বুঝতে পারে এবং তারা এর চাইতে অধিকতর বিভ্রান্তিতে পড়তে পারে',
        hadisNumberList: [
          HadisNumberModel(
            id: '১২৮।  ',
            name:
                ' উবায়দুল্লাহ ইবনু মূসা (রহঃ) .... আসওয়াদ (রহঃ) থেকে বর্ণিত, তিনি বলেনঃ ইবনু যুবায়র (রাঃ) আমাকে বললেন, ‘আয়িশা (রাঃ) তোমাকে অনেক গোপন কথা বলতেন। বল তো কাবা সম্পর্কে তোমাকে কী বলেছেন? আমি বললাম, তিনি আমাকে বলেছেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ‘আয়িশা! তোমাদের কওম যদি (ইসলাম গ্রহণে) নতুন না হত, ইবনু যুবায়র বলেনঃ কুফর থেকে; তবে আমি কাবা ভেঙ্গে ফেলে তার দুটি দরজা বানাতাম। এক দরজা দিয়ে লোক প্রবেশ করত আর এক দরজা দিয়ে বের হত। (পরবর্তীকালে মক্কার আধিপত্য পেলে) তিনি এরূপ করেছিলেন।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৯১।',
        name:
            '  বুঝতে না পারার আশংকায় ইল্‌ম শিক্ষায় কোন এক গোত্র ছেড়ে আর এক গোত্র বেছে নেওয়া।',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                ' وَقَالَ عَلِيٌّ حَدِّثُوا النَّاسَ، بِمَا يَعْرِفُونَ، أَتُحِبُّونَ أَنْ يُكَذَّبَ، اللَّهُ وَرَسُولُهُ আলী (রাঃ) বলেন, ‘মানুষের নিকট সেই ধরনের কথা বল, যা তারা বুঝতে পারে। তোমরা কি পছন্দ কর যে, আল্লাহ্ ও তাঁর রসূলের প্রতি মিথ্যা আরোপ করা হোক? ১২৯। এ হাদীস উবায়দুল্লাহ ইবনু মূসা (রহঃ) .... ‘আলী (রাঃ) থেকে বর্ণনা করেন।',
            ref: '',
          ),
          HadisNumberModel(
            id: '১৩০। ',
            name:
                ' ইসহাক ইবনু ইবরাহীম (রহঃ) ... আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত যে, একবার মু‘আয (রাঃ), নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর পিছনে সাওয়ারীতে উপবিষ্ট ছিলেন, তখন তিনি তাঁকে ডাকলেন, হে মু‘আয ইবনু জাবাল! মু‘আয (রাঃ) উত্তর দিলেন, ‘আমি হাযির ইয়া রাসূলাল্লাহ! এবং (আপনার আদেশ পালনের জন্য) প্রস্তুত। তিনি ডাকলেন, মু‘আয! মু‘আয (রাঃ) উত্তর দিলেন, ‘আমি হাযির ইয়া রাসূলাল্লাহ এবং প্রস্তুত। তিনি আবার ডাকলেন, মু‘আয। তিনি উত্তর দিলেন, ‘আমি হাযির ইয়া রাসূলাল্লাহ এবং প্রস্তুত। এরূপ তিনবার করলেন। এরপর বললেনঃ যে কোন বান্দা আন্তরিকতার সাথে এ সাক্ষ্য দেবে যে, ‘আল্লাহ ছাড়া কোন ইলাহ নেই এবং মুহাম্মদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আল্লাহর রাসূল’ তার জন্য আল্লাহ তা‘আলা জাহান্নাম হারাম করে দেবেন। মু‘আয (রাঃ) বললেন, ইয়া রাসুলাল্লাহ! আমি কি মানুষকে এ খবর দেব না, যাতে তারা সুসংবাদ পেতে পারে?’ তিনি বললেন, ‘তাহলে তারা এর উপর ভরসা করে বসে থাকবে।’ মু‘আয (রাঃ) (জীবনভর এ হাদিসটি বর্ণনা করেন নি) মৃত্যুর সময় এ হাদিসটি বর্ণনা করে গেছেন যাতে (ইল্‌ম গোপন রাখার) গুনাহ না হয়। ',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ১৩১।',
            name:
                ' মূসা’দ্দাদ (রহঃ) ... আনাস (রাঃ) থেকে বর্ণিত, তিনি বলেন, আমার কাছে বর্ণনা করা হয়েছে যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মু‘আয (রাঃ)-কে বলেছেনঃ যে ব্যাক্তি আল্লাহর সঙ্গে কোনরূপ শিরক না করে তাঁর সঙ্গে সাক্ষাত করবে সে জান্নাতে দাখিল হবে। (এ কথা শুনে) মু‘আয (রাঃ) বললেন, ‘আমি কি লোকদের সুসংবাদ দেব না?’ তিনি বললেন, ‘না, আমার আশংকা হচ্ছে যে, তারা এর উপরই ভরসা করে বসে থাকবে।’ ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৯২। ',
        name: ' ‘ইলম শিক্ষা করতে লজ্জাবোধ করা। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                ' وَقَالَ مُجَاهِدٌ لاَ يَتَعَلَّمُ الْعِلْمَ مُسْتَحْيٍ وَلاَ مُسْتَكْبِرٌ. وَقَالَتْ عَائِشَةُ نِعْمَ النِّسَاءُ نِسَاءُ الأَنْصَارِ لَمْ يَمْنَعْهُنَّ الْحَيَاءُ أَنْ يَتَفَقَّهْنَ فِي الدِّينِ মুজাহিদ (রহঃ) বলেন, ‘লাজুক এবং অহঙ্কারী ব্যক্তি জ্ঞান অর্জন করতে পারে না। ‘আয়িশা (রাঃ) বলেন, ‘আনসারী মহিলারাই উত্তম। লজ্জা তাদেরকে ইসলামী জ্ঞান অন্বেষণ থেকে ফিরিয়ে রাখতে পারে নি। ১৩২। মুহাম্মদ ইবনু সালাম (রহঃ) ... উম্মে সালমা (রাঃ) থেকে বর্ণত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর খিদমতে উম্মে সুলায়ম (রাঃ) এসে বললেনঃ ইয়া রাসুল্লাহ! আল্লাহ হক কথা প্রকাশ করতে লজ্জাবোধ করেন না। স্ত্রীলোকের স্বপ্নদোষ হলে কি গোসল করতে হবে? নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ ‘হ্যাঁ, যখন সে বীর্য দেখতে পাবে।’ তখন উম্মে সালমা (লজ্জায়) তাঁর মুখ ঢেকে নিয়ে বললেন, ইয়া রাসূলাল্লাহ! স্ত্রীলোকের স্বপ্নদোষ হয় কি?’ তিনি বললেন, ‘হ্যাঁ, তোমার ডান হাতে মাটি পড়ুক!* (তা না হলে) তাঁর সন্তান তাঁর আকৃতি পায় কিরূপে? * এটি কোন বদ দুয়া বরং বিস্ময় প্রকেশের জন্য আরবীতে ব্যবহৃত হয়।',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ১৩৩।  ',
            name:
                'ইসমা‘ঈল (রহঃ) ... ইবনু উমর (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ গাছের মধ্যে এমন এক গাছ আছে যার পাতা ঝরে পড়ে না এবং তা হল মুসলিমের দৃষ্টান্ত। তোমরা আমাকে বল তো সেটা কোন গাছ? তখন লোকজনের খেয়াল জঙ্গলের গাছপালার প্রতি গেল। আর আমরা মনে হতে লাগল যে, তা হল খেজুর গাছ। আবদুল্লাহ (রাঃ) বলেন, কিন্তু আমি লজ্জাবোধ করলাম। সাহাবায়ে কিরাম (রাঃ) বললেন, ইয়া রাসুল্লাল্লাহ! আপনই আমাদের তা বলে দিন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তা হল খেজুর গাছ। আবদুল্লাহ (রাঃ) বলেন, তারপর আমি আমার পিতাকে আমার মনে যা এসেছিল তা বললাম। তিনি বললেন তুমি তখন তা বলে দিলে অমুক অমুক জিনিস লাভ করার চাইতে আমি বেশী খুশী হতাম।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৯৩। ',
        name: ' নিজে লজ্জাবোধ করলে অন্যকে প্রশ্ন করতে বলা',
        hadisNumberList: [
          HadisNumberModel(
            id: '১৩৪।  ',
            name:
                'মূসা’দ্দাদ (রহঃ) ..... আলী ইবনু আবী তালিব (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমার অধিক পরিমাণে ‘মযী’ বের হত। তাই এ ব্যাপারে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম–কে জিজ্ঞাসা করার জন্য মিকদাদকে বললাম। তিনি তাঁকে জিজ্ঞাসা করলেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ এতে কেবল উযূ (ওজু/অজু/অযু) করতে হয়। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৯৪।',
        name: '  মসজিদে ইলম ও মাসআলা-মাসায়েল আলোচনা করা',
        hadisNumberList: [
          HadisNumberModel(
            id: '১৩৫। ',
            name:
                '  কুতায়বা ইবনু সা‘ঈদ (রহঃ) ... আবদুল্লাহ ইবনু উমর (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ এক ব্যাক্তি মসজিদে দাঁড়িয়ে বলল, ‘ইয়া রাসুলাল্লাহ! আপনি আমাদের কোথা থেকে ইহরাম বাঁধার নির্দেশ দেন?’ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ মদিনাবাসী ইহরাম বাঁধবে ‘যু’ল-হুলায়কা’ থেকে, সিরিয়াবাসী, ইহরাম বাঁধবে ‘জুহফা’ থেকে এবং নাজদবাসী ইহরাম বাঁধবে ‘করন’ থেকে। ইবনু উমর (রাঃ) বলেন, অন্যরা বলেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এও বলেছেনঃ এবং ইয়ামানবাসী ইহরাম বাঁধবে ‘ইয়ালামলাম’ থেকে। ইবনু ‘উমার (রাঃ) বলেছেন, ‘এ কথাটি আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বুঝে নিতে পারিনি।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৯৫। ',
        name: ' প্রশ্নকারীর প্রশ্নের চাইতে বেশী উত্তর দেওয়া ',
        hadisNumberList: [
          HadisNumberModel(
            id: '১৩৬।  ',
            name:
                'আদম (রহঃ) .... ইবনু ‘উমর (রাঃ) থেকে বর্ণনা করেন যে, এক ব্যাক্তি তাঁকে জিজ্ঞাসা করল, ‘মুহরিম কী কাপড় পরবে?’ তিনি বলেনঃ ‘জামা পরবে না, পাগড়ী পরবে না, পাজামা পরবে না, টুপি পরবে না এবং কুসুম বা যা‘ফরান রঙে রঞ্জিত কোন কাপড় পরবে না। জুতা না থাকলে চামড়ার মোজা পরতে পারে, তবে এমনভাবে কেটে ফেলতে হবে যাতে মোজা দু’টি পায়ের গিরার নিচে থাকে। ',
            ref: '',
          ),
        ]),
  ];
  List<PorichedModel> chapterFour = [
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৯৭।',
        name: ' পবিত্রতা ছাড়া সালাত কবুল হয় না ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                ' উযুর বর্ণনা আল্লাহ তা‘আলার বাণীঃ (হে মুমিনগণ!) তোমরা যখন সালাতের জন্য প্রস্তুত হবে তখন তোমরা তোমাদের মুখমণ্ডল ও হাত কনুই পর্যন্ত ধুবে ও তোমাদের মাথা মাসেহ করবে এবং পা গিরা পর্যন্ত ধুয়ে নিবে। (৫ঃ ৬)। আবূ ‘আবদুল্লাহ্ বুখারী (রহ.) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ উযূর ফরয হ’ল এক-একবার ধোয়া। তিনি দু’-দু’বার করে এবং তিন-তিনবার করেও উযূ করেছেন, কিন্তু তিনবারের অধিক ধৌত করেন নি। পানির অপচয় করা এবং নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর ‘আমলের সীমা অতিক্রম করাকে ‘উলামায়ে কিরাম মাকরূহ বলেছেন। ১৩৭। ইসহাক ইবনু ইবরাহীম আল-হানযালী (রহঃ) ... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যাক্তির হাদস হয় তাঁর সালাত (নামায/নামাজ) কবুল হবে না, যতক্ষন না সে উযূ (ওজু/অজু/অযু) করে। হাযরা-মাওতের এক ব্যাক্তি বলেন, হে আবূ হুরায়রা! হাদস কী? তিনি বলেন, নিঃশব্দে বা সশব্দে বায়ু বের হওয়া। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৯৮। ',
        name:
            ' উযূর ফযীলত এবং উযূর প্রভাবে যাদের উযুর অঙ্গ–প্রত্যঙ্গ উজ্জ্বল হবে ',
        hadisNumberList: [
          HadisNumberModel(
            id: '১৩৮। ',
            name:
                '  ইয়াহিয়া ইবনু বুকায়র (রহঃ) .... নু‘আয়ম মুজমির (রহঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি আবূ হুরায়রা (রাঃ) এর সঙ্গে মসজিদের ছাদে উঠলাম। তারপর তিনি উযূ (ওজু/অজু/অযু) করে বললেনঃ ‘আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি, কিয়ামতের দিন আমার উম্মাতকে এমন অবস্থায় ডাকা হবে যে, উযূর প্রভাবে তাদের হাত-পা ও মুখমণ্ডল থাকবে উজ্জ্বল। তাই তোমাদের মধ্যে যে এ উজ্জ্বলতা বাড়িয়ে নিতে পারে, সে যেন তা করে',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৯৯।  ',
        name:
            'সন্দেহের কারনে উযূ করতে হয় না যতক্ষণ না (উযূ ভঙ্গের) নিশ্চিত বিশ্বাস জন্মে ',
        hadisNumberList: [
          HadisNumberModel(
            id: '১৩৯।  ',
            name:
                ' ‘আলী (রহঃ) .... ‘আব্বাদ ইবনু তামীম (রহঃ) তাঁর চাচা থেকে বর্ণনা করেন, একবার রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এক ব্যাক্তি সম্পর্কে বলা হল যে, তার মনে হয়েছিল যেন সালাত (নামায/নামাজ)-এর মধ্যে কিছু হয়ে গিয়েছিল। তিনি বললেনঃ সে যেন ফিরে না যায়, যতক্ষণ না শব্দ শোনে বা গন্ধ পায়।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১০০।',
        name: '  হালকাভাবে উযূ করা',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                '১৪০। আলী ইবনু আবদুল্লাহ (রহঃ) ... ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিত, একবার নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঘুমিয়েছিলেন, এমনকি তাঁর নিঃশ্বাসের শব্দ হতে লাগল। এরপর তিনি সালাত (নামায/নামাজ) আদায় করলেন। সুফিয়ান (রহঃ) আবার কখনো বলেছেন, তিনি শুয়ে পড়লেন, এমনকি তাঁর নিঃশ্বাসের শব্দ হতে লাগল। এরপর তিনি সালাত আদায় করলেন। অন্য সূত্রে সুফিয়ান (রহঃ) ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণনা করেন, তিনি বলেনঃ আমি এক রাতে আমার খালা মায়মূনা (রাঃ) এর কাছে রাত কাটালাম। রাতে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঘুম থেকে উঠলেন এবং রাতের কিছু অংশ চলে যাবার পর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একটি ঝুলন্ত মশক থেকে হাল্কা উযূ (ওজু/অজু/অযু) করলেন। রাবী ‘আমর (রহঃ) বলেন, তখন তিনি যেভাবে উযূ করেছেন আমিও সেভাবে উযূ করলাম এবং এসে তাঁর বাঁয়ে দাঁড়িয়ে গেলাম। সুফিয়ান (রহঃ) কখনোيسار (বাম) শব্দের স্থলে شمال বলতেন। তারপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে ঘুরিয়ে তাঁর ডান দিকে দাঁড় করালেন। এরপর আল্লাহর যতক্ষণ ইচ্ছা ততক্ষণ তিনি সালাত (নামায/নামাজ) আদায় করলেন। এরপর কাত হয়ে ঘুমিয়ে পড়লেন, এমনকি তাঁর নাক ডাকতে থাকল। এরপর মুয়াযযিন এসে তাঁকে সালাতের কথা জানিয়ে দিলেন। তিনি তাঁর সঙ্গে সালাত এর জন্য রওয়ানা হলেন এবং সালাত আদায় করলেন, কিন্তু উযূ করলেন না। আমরা ‘আমর–কে বললামঃ লোকে বলে যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর চোখ ঘুমায় কিন্তু তাঁর অন্তর ঘুমায় না। তখন ‘আমর (রহঃ) বলেন, ‘আমি উবায়দ ইবনু ‘উমায়র (রহঃ)–কে বলতে শুনেছি, নবীগনের স্বপ্ন ওহী। এরপর তিনি তিলাওয়াত করলেনঃ (‏إِنِّي أَرَى فِي الْمَنَامِ أَنِّي أَذْبَحُكَ) ‘ আমি স্বপ্নে দেখেছি যে, তোমাকে যবেহ করছি। (৩৭ : ১০২) ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১০১।  ',
        name: 'পূর্ণরূপে উযূ করা। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                ' وَقَالَ ابْنُ عُمَرَ إِسْبَاغُ الْوُضُوءِ الإِنْقَاءُ ইবনে উমর (রাঃ) বলেন, ভালভাবে পরিস্কার করাই হল পূর্ণরূপে উযূ করা। ১৪১। আবদুল্লাহ ইবনু মাসলামা (রহঃ) .... উসামা ইবনু যায়দ (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ‘আরাফার ময়দান থেকে রওয়ানা হলেন। গিরিপথে গিয়ে তিনি সওয়ারি থেকে নেমে পেশাব করলেন। এরপর উযূ (ওজু/অজু/অযু) করলেন কিন্তু উত্তমরূপে করলেন না। আমি বললাম, ‘ইয়া রাসুল্লাল্লাহ! সালাত (নামায/নামাজ) আদায় করবেন কি?’ তিনি বললেনঃ সালাতের স্থান তোমার সামনে। তারপর তিনি আবার সওয়ার হলেন। এরপর মুযদালিফায় এসে সওয়ারি থেকে নেমে উযূ করলেন। এবার পূর্ণরূপে উযূ করলেন। তখন সালাতের জন্য ইকামাত দেওয়া হল। তিনি মাগরিবের সালাত আদায় করলেন। তারপর সকলে তাঁদের অবতরণ স্থলে নিজ নিজ উট বসিয়ে দিল। পুনরায় ঈশার ইকামাত দেওয়া হল। তিনি ঈশার সালাত আদায় করলেন এবং উভয় সালাতের মধ্য অন্য কোন সালাত আদায় করলেন না।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১০২। ',
        name: '  এক আঁজলা পানি দিয়ে দু\'হাতে মুখমণ্ডল ধোয়া',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                '১৪২। মুহাম্মদ ইবনু ‘আবদুর রহীম (রহঃ) .... ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিত, তিনি উযূ (ওজু/অজু/অযু) করলেন এবং তাঁর মুখমণ্ডল ধুলেন। এক আঁজলা পানি দিয়ে কুলি করলেন এবং নাকে পানি দিলেন। এরপর আর এক আঁজলা পানি দিয়ে এরূপ করলেন অর্থাৎ আরেক হাতের সাথে মিলিয়ে মুখমণ্ডল ধুলেন। এরপর আর এক আঁজলা পানি দিয়ে ডান হাত ধুলেন। এরপর আর এক আঁজলা পানি দিয়ে বাম হাত ধুলেন। এরপর মাথা মাসেহ করলেন। এরপর আর এক আঁজলা পানি দিয়ে ডান পায়ের উপর ঢেলে দিয়ে তা ধুয়ে ফেললেন। এরপর আর এক আঁজলা পানি দিয়ে বাম পা ধুলেন। তারপর বললেন, ‘আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে এভাবে উযূ করতে দেখেছি’। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১০৩। ',
        name: 'সর্বাবস্থায়, এমনকি সহবাসের সময়েও বিসমিল্লাহ বলা ',
        hadisNumberList: [
          HadisNumberModel(
            id: '১৪৩। ',
            name:
                '  আলী ইবনু ‘আবদুল্লাহ (রহঃ) ..... ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিত, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তোমাদের কেউ তাঁর স্ত্রীর সাথে মিলনের পূর্বে যদি বলে, بِسْمِ اللَّهِ اللَّهُمَّ جَنِّبْنَا الشَّيْطَانَ وَجَنِّبِ الشَّيْطَانَ مَا رَزَقْتَنَا (আল্লাহর নামে আরম্ভ করছি। আল্লাহ! তুমি আমাদেরকে শয়তান থেকে দূরে রাখ এবং যা আমাদেরকে দান করবে তাকেও শয়তান থেকে দূরে রাখ)- তারপর (এ মিলনের দ্বারা) তাদের কিসমতে কোন সন্তান থাকলে শয়তান তার কোন ক্ষতি করতে পারবে না।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১০৪।',
        name: '  শৌচাগারে কি বলতে হয়?',
        hadisNumberList: [
          HadisNumberModel(
            id: '১৪৪। ',
            name:
                '  আদম (রহঃ) ..... আনাস (রাঃ) থেকে বর্ণিত, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন প্রকৃতির ডাকে শৌচাগারে যেতেন তখন বলতেন, “আল্লাহুম্মা ইন্নী আঊযুবিকা মিনাল খুবুছি ওয়াল খাবায়িছ” (হে আল্লাহ! আমি মন্দ কাজ ও শয়তান থেকে আপনার স্মরণ নিচ্ছি।) ইবনু ‘আর’আরা (রহঃ) শু‘বা (রহঃ) সূত্রেও অনুরূপ বর্ণনা করেন। গুনদার (রহঃ) শু‘বা (রহঃ) থেকে বর্ণনা করেন,إِذَا أَتَى الْخَلاَءَ‏ (যখন শৌচাগারে যেতেন)। মূসা (রহঃ) হাম্মাদ (রহঃ) থেকে বর্ণনা করেন,إِذَا دَخَلَ (যখন প্রবেশ করতেন)। সাঈদ ইবন যায়দ (রহঃ) আবদুল আযীয (রহঃ) থেকে বর্ণনা করেন, যখন প্রবেশ করার ইচ্ছা করতেন। হাদীসের শিক্ষা ১. বাথরুমে পায়খানা ব্যবহার করার জন্য গেলে উপরোক্ত দো\'আ পাঠ করা সুন্নাত। ২. আলেমগণ বলেছেন, এর মাধ্যমে শয়তানের ওয়াসওয়াসা, কুমন্ত্রণা ও বিভিন্ন প্রকার ধোকা থেকে হিফাযত থাকা যায়। শয়তান ওযূতে সমস্যা করে, সালাত বিনষ্ট করতে চেষ্টা চালায় এসব থেকে বাঁচার জন্য এ দোআ করা উচিত। ৩. শয়তানের অন্যতম অস্ত্র হচ্ছে মানুষকে ময়লা, পায়খানা ইত্যাদির মাধ্যমে অশুচি করে ফেলবে। তাই শয়তানদের থেকে আল্লাহর কাছে আশ্রয় চাওয়া জরুরী। ৪. ময়লা ও অপবিত্রতা থেকে বেঁচে থাকা ফরয: অনুরূপভাবে যা মানুষকে এসব থেকে বাঁচাতে পারবে তা অবলম্বন করাও জরুরী; কারণ হাদীসে পেশাব থেকে না বাঁচার কারণে কবরে শাস্তি হওয়ার বিষয়টি সাব্যস্ত হয়েছে। ৫. \'ইস্তেআযাহ\' হচ্ছে অদৃশ্য শত্রুর ক্ষতি থেকে বাঁচার জন্য আশ্রয় চাওয়া। এটি আল্লাহ ব্যতীত অন্য কারো কাছে চাওয়ার অর্থ হচ্ছে শির্ক করা। সুতরাং ইস্তেআযাহ কেবল আল্লাহর কাছেই চাইতে হবে।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১০৫।',
        name: '  শৌচাগারের কাছে পানি রাখা',
        hadisNumberList: [
          HadisNumberModel(
            id: '১৪৫। ',
            name:
                ' আবদুল্লাহ ইবনু মুহাম্মদ (রহঃ) .... ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিত, একবার নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম শৌচাগারে গেলেন, তখন আমি তাঁর জন্য উযূর পানি রাখলাম। তিনি জিজ্ঞাসা করলেনঃ এটা কে রেখেছে? তাঁকে জানানো হলে তিনি বলেন, ইয়া আল্লাহ! আপনি তাকে দ্বীনের জ্ঞান দান করুন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১০৬। ',
        name:
            ' মল-মূত্র ত্যাগের সময় কিবলামুখি হবে না, তবে ঘরের মধ্যে দেয়াল অথবা তেমন কোন আড়াল থাকলে ভিন্ন কথা। ',
        hadisNumberList: [
          HadisNumberModel(
            id: '১৪৬। ',
            name:
                '  আদম (রহঃ) .... আবূ আইয়ূব আনসারী (রাঃ) থেকে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তোমাদের কেউ যখন শৌচাগারে যায়, তখন সে যেন কিবলার দিকে মুখ না করে এবং তার পিঠও না করে, বরং তোমরা পূর্ব দিক এবং পশ্চিম দিকে ফিরে বসবে (এই নির্দেশ মদিনার বাসিন্দাদের জন্য)।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১০৭।',
        name: ' দুই ইটের ওপর বসে মলমূত্র ত্যাগ করা ',
        hadisNumberList: [
          HadisNumberModel(
            id: '  ১৪৭।',
            name:
                ' আবদুল্লাহ ইবনু ইউসুফ (রহঃ) .... ‘আবদুল্লাহ ইবনু ‘উমর (রাঃ) থেকে বর্ণিত, তিনি বলেন, লোকে বলে মল-মূত্র ত্যাগের সময় কিবলার দিকে এবং বায়তুল মুকাদ্দাসের দিকে মুখ করে বসবে না। ‘আবদুল্লাহ ইবনু ‘উমর (রাঃ) বলেন, ‘আমি একদিন আমাদের ঘরের ছাদের উপর উঠলাম। তারপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে দেখলাম বায়তুল মুকাদ্দাসের দিকে মুখ করে দুটি ইটের উপর তাঁর প্রয়োজনে বসেছেন। তিনি [ওয়াসি (রহঃ)-কে] বললেন, তুমি বোধ হয় তাদের মধ্যে শামিল, যারা নিতম্বের ওপর ভর করে সালাত (নামায/নামাজ) আদায় করে। আমি বললাম, আল্লাহর কসম! আমি জানিনা। মালিক (রহঃ) বলেন, (নিতম্বের উপর ভর করার অর্থ হল) যারা সালাত আদায় করে এবং মাটি থেকে নিতম্ব না তুলে সিজদা করে।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১০৮। ',
        name: ' মহিলাদের বাইরে যাওয়া ',
        hadisNumberList: [
          HadisNumberModel(
            id: '১৪৮।  ',
            name:
                ' ইয়াহইয়া ইবনু বুকায়র (রহঃ) ... ‘আয়িশা (রাঃ) থেকে বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর পত্নীগণ রাতের বেলায় প্রাকৃতিক প্রয়োজনে খোলা ময়দানে যেতেন। আর ‘উমর (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম–কে বলতেন, আপনার সহধর্মিণীগণকে পর্দায় রাখুন। কিন্তু রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তা করেননি। এক রাতে ঈশার সময় নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর পত্নী সাওদা বিনত যাম‘আ (রাঃ) প্রাকৃতিক প্রয়োজনে বের হলেন। তিনি ছিলেন দীর্ঘকায়া। ‘উমর (রাঃ) তাঁকে ডেকে বললেন, হে সাওদা! আমি কিন্তু আপনাকে চিনে ফেলেছি। পর্দার হুকুম নাযিল হওয়ার আগে তিনি এ কথা বলেছিলেন। তারপর আল্লাহ তা‘আলা পর্দার হুকুম নাযিল করেন।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১০৮।',
        name: '  মহিলাদের বাইরে যাওয়া',
        hadisNumberList: [
          HadisNumberModel(
            id: '  ১৪৯।',
            name:
                ' যাকারিয়্যা (রহঃ) ... ‘আয়িশা (রাঃ) থেকে বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, তোমাদের প্রয়োজনের জন্য বের হবার অনুমতি দেয়া হয়েছে। হিশাম (রহঃ) বলেন, অর্থ প্রাকৃতিক প্রয়োজনে।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১০৯। ',
        name: '  ঘরে মলমূত্র ত্যাগ করা',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                '১৫০। ইবরাহীম ইবনু মুনযির (রহঃ) .... ‘আবদুল্লাহ ইবনু ‘উমর (রাঃ) থেকে বর্ণিত, তিনি বলেন, আমি আমার বিশেষ এক প্রয়োজনে হাফসা (রাঃ) এর ঘরের ছাদে উঠলাম। তখন দেখলাম, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কিবলার দিকে পিঠ দিয়ে শাম-এর দিকে মুখ করে তাঁর প্রয়োজনে বসেছেন। প্রাসঙ্গিক আলোচনা হাদীসের বক্তব্য থেকে বুঝা যায় যে, বাধা দিবে না এমন হলে, কারো ঘরের ছাদে উঠা জায়েজ। প্রয়োজন বলতে হাদীসে পায়খানা সারার কথা বুঝানো হয়েছে। এর দ্বারা বুঝা যায় যে, যা বলা অসুন্দর তা ভিন্নভাবে তুলে ধরাই শ্রেয়। বাহ্যিক দৃষ্টিতে উক্ত হাদীস দু\'টিকে পরস্পর বিরোধী মনে হলেও আসলে তা পরস্পর বিরোধী নয়। এ ব্যাপারে আলেমগণের কয়েকটি মত পাওয়া যায়-(১) আলেমগণের কেউ কেউ উভয় হাদীসের মধ্যে সামঞ্জস্য সাধনে বলেন, রাসূলুল্লাহ সাল্লাল্লাহু \'আলাইহি ওয়াসাল্লাম ঘরের মধ্যে প্রাকৃতিক কাজ করছিলেন, আর পূর্বোক্ত হাদীসের নির্দেশনা হচ্ছে ঘরের বাইরের স্থানের জন্য(২) অপর দল বলেছেন, রাসূলুল্লাহ সাল্লাল্লাহু \'আলাইহি ওয়াসাল্লামের জন্য এটা বিশেষ ব্যতিক্রম ছিল।(৩) কেউ বলেছেন, ইবন উমার রাদিয়াল্লাহু আনহুমার উপরোক্ত ঘটনাটি সম্ভবত নিষেধ করার পূর্বে ছিল। ',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ১৫১। ',
            name:
                'ইয়াকূব ইবনু ইবরাহীম (রহঃ) .... আবদুল্লাহ ইবনু উমর (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ একদিন আমি আমাদের ঘরের উপর উঠলাম। আমি দেখলাম, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দু\'টি ইটের উপর বায়তুল মুকাদ্দাসের দিকে মুখ করে প্রাকৃতিক প্রয়োজনে বসেছেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১১০। ',
        name: '  পানি দ্বারা ইসতিনজা করা',
        hadisNumberList: [
          HadisNumberModel(
            id: '১৫২। ',
            name:
                ' আবূল ওলীদ হিশাম ইবনু ‘আবদুল মালিক (রহঃ) .... আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন প্রাকৃতিক প্রয়োজনে বের হতেন তখন আমি ও আরেকটি ছেলে পানির পাত্র নিয়ে আসতাম। অর্থাৎ তিনি তা দিয়ে ইসতিনজা করতেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১১১। ',
        name: ' পবিত্রতা হাসিলের জন্য কারো সাথে পানি নিয়ে যাওয়া। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'وَقَالَ أَبُو الدَّرْدَاءِ: أَلَيْسَ فِيكُمْ صَاحِبُ النَّعْلَيْنِ وَالطَّهُورِ وَالْوِسَادِ আবুদ-দারদা (রাঃ) বলেন, তোমাদের মধ্যে কি জুতা, পানি ও বালিশ বহনকারী ব্যক্তি [আবদুল্লাহ ইবন মাস‘ঊদ (রা)] নেই? ১৫৩। সুলায়মান ইবনু হারব (রহঃ) ... আনাস (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন প্রাকৃতিক প্রয়োজনে বের হতেন তখন আমি ও আরেকটি ছেলে তাঁর পিছনে পানির পাত্র নিয়ে যেতাম। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১১২।',
        name: ' ইসতিনজার জন্য পানির সাথে (লৌহ ফলকযুক্ত) লাঠি নিয়ে যাওয়া ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ১৫৪।',
            name:
                ' মুহাম্মদ ইবনু বাশশার (রহঃ) ... আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন শৌচাগারে যেতেন তখন আমি ও আরেকটি ছেলে পানির পাত্র এবং \'আনাযা\' নিয়ে যেতাম। তিনি পানি দ্বারা ইসতিনজা করতেন। নাযর (রহঃ) ও শাযান (রহঃ) শু‘বা (রহঃ) থেকে অনুরূপ বর্ণনা করেন। হাদীসে বর্ণিত (عَنَزَة) ‘আনাযা’ শব্দের অর্থ এমন লাঠি যার মাথায় লোহা লাগানো থাকে। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১১৩। ',
        name: ' ডান হাতে ইসতিনজা করার নিষেধাজ্ঞা ',
        hadisNumberList: [
          HadisNumberModel(
            id: '১৫৫। ',
            name:
                ' মু‘আয ইবনু ফাযালা (রহঃ) ... আবূ কাতাদা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, তোমাদের কেউ যখন পান করে, তখন সে যেন পাত্রের মধ্যে নিঃশ্বাস না ছাড়ে। আর যখন শৌচাগারে যায় তখন তার পুরূষাঙ্গ যেন ডান হাত দিয়ে স্পর্শ না করে এবং ডান হাতে ইস্তিঞ্জা না করে। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১১৪। ',
        name: ' প্রস্রাব করার সময় ডান হাত দিয়ে পুরূষাঙ্গ ধরবে না ',
        hadisNumberList: [
          HadisNumberModel(
            id: '১৫৬। ',
            name:
                '  মুহাম্মদ ইবনু ইউসুফ (রহঃ) .... আবূ কাতাদা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ তোমাদের কেউ যখন পেশাব করে তখন সে যেন কখনো ডান হাত দিয়ে তার পুরূষাঙ্গ না ধরে এবং ডান হাত দিয়ে ইসতিনজা না করে এবং পান করার সময় যেন পাত্রের মধ্যে নিঃশ্বাস না ফেলে।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১১৫।',
        name: '  পাথর দিয়ে ইসতিনজা করা',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ১৫৭।',
            name:
                '  আহমদ ইবনু মুহাম্মদ আল-মক্কী (রহঃ) ... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম প্রাকৃতিক প্রয়োজনে বের হলে আমি তাঁর অনুসরণ করলাম। আর তিনি এদিক ওদিক তাকাতেন না। যখন আমি তাঁর নিকটবর্তী হলাম তখন তিনি আমাকে বললেন, আমাকে কিছু পাথর কুড়িয়ে দাও, আমি তা দিয়ে ইসতিনজা করব। (বর্ণনাকারী বলেন), বা এ ধরনের কোন কথা বললেন, আর আমার জন্য হাড় বা গোবর আনবে না। তখন আমি আমার কাপড়ের কোচায় করে কয়েকটি পাথর এনে তাঁর পাশে রাখলাম এবং আমি তাঁর থেকে সরে গেলাম। তিনি প্রয়োজন শেষে সেগুলো ব্যবহার করলেন।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১১৬। ',
        name: 'গোবর দিয়ে ইসতিনজা না করা ',
        hadisNumberList: [
          HadisNumberModel(
            id: '১৫৮। ',
            name:
                '  আবূ নু‘আয়ম (রহঃ) ... ‘আবদুল্লাহ (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) একবার শৌচ কাজে যাবার সময় তিনটি পাথর কুড়িয়ে দিতে আমাকে আদেশ দিলেন। তখন আমি দু’টি পাথর পেলাম এবং তৃতীয়টির জন্য খোঁজাখুঁজি করলাম কিন্তু পেলাম না। তাই একখণ্ড শুকনো গোবর নিয়ে তাঁর কাছে গেলাম। তিনি পাথর দু’টি নিলেন এবং গোবর খণ্ড ফেলে দিয়ে বললেন, এটা নোংরা। ইবরাহীম ইবন ইউসুফ (রহঃ), তার পিতা, আবূ ইসহাক (রহঃ), আবদূর রহমান (রহঃ) এর সূত্রে হাদীসখানা বর্ণনা করে',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১১৭। ',
        name: 'উযূতে একবার করে ধোয়া ',
        hadisNumberList: [
          HadisNumberModel(
            id: '১৫৯। ',
            name:
                ' মুহাম্মদ ইবনু ইউসুফ (রহঃ) ... ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক উযূ (ওজু/অজু/অযু)-তে একবার করে ধুয়েছেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১১৮।',
        name: '  উযূতে দু’বার করে ধোয়া',
        hadisNumberList: [
          HadisNumberModel(
            id: '১৬০।  ',
            name:
                'হুসায়ন ইবনু ‘ঈসা (রহঃ) ... ‘আবদুল্লাহ ইবনু যায়দ (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) উযূ (ওজু/অজু/অযু)-তে দু’বার করে ধুয়েছেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১১৯। ',
        name: '  উযূতে তিনবার করে ধোয়া',
        hadisNumberList: [
          HadisNumberModel(
            id: '১৬১। ',
            name:
                '  আবদুল ‘আযীয ইবনু ‘আবদুল্লাহ আল-উওয়ায়সী (রহঃ) ... হুমরান (রহঃ) থেকে বর্ণিত, তিনি ‘উসমান ইবনু আফফান (রাঃ)-কে দেখেছেন যে, তিনি পানির পাত্র আনিয়ে উভয় হাতের তালুতে তিনবার ঢেলে তা ধুয়ে নিলেন। এরপর ডান হাত পাত্রের মধ্যে ঢুকালেন। তারপর কুলি করলেন ও নাকে পানি দিয়ে নাক পরিষ্কার করলেন। তারপর তাঁর মুখমণ্ডল তিনবার ধুয়ে এবং দু’হাত কনুই পর্যন্ত তিনবার ধুয়ে নিলেন। এরপর মাথা মাসেহ করলেন। তারপর উভয় পা গিরা পর্যন্ত তিনবার ধুয়ে নিলেন। পরে বললেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যাক্তি আমার মত এ রকম উযূ (ওজু/অজু/অযু) করবে, তারপর দু রাক‘আত সালাত (নামায/নামাজ) আদায় করবে, যাতে দুনিয়ার কোন খেয়াল করবে না, তার পেছনের গুনাহ মাফ করে দেওয়া হবে। ইবরাহীম (রহঃ) ... ইবনু শিহাব (রহঃ) থেকে বর্ণিত, তিনি বলেন, ‘উরওয়া হুমরান থেকে বর্ণনা করেন, ‘উসমান (রাঃ) উযূ (ওজু/অজু/অযু) করে বললেন, আমি তোমাদেরকে একটি হাদীস বর্ণনা করব। যদি একটি আয়াতে কারীমা না হত, তবে আমি তোমাদেরকে এ হাদীস বর্ণনা করতাম না। আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম–কে বলতে শুনেছি, যে কোন ব্যাক্তি সুন্দর করে উযূ করবে এবং সালাত (নামায/নামাজ) আদায় করবে, পরের সালাত আদায় করা পর্যন্ত তার মধ্যবর্তী যত গুনাহ আছে সব মাফ করে দেওয়া হবে। ‘উরওয়া (রহঃ) বলেন, সে আয়াতটি হলঃ إِنَّ الَّذِينَ يَكْتُمُونَ مَا أَنْزَلْنَا مِنَ الْبَيِّنَاتِ আমি যে সব স্পষ্ট নিদর্শন অবতীর্ণ করেছি তা যারা গোপন করে (২ : ১৫৯)',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১২০। ',
        name:
            'উযূর মধ্যে নাকে পানি দেয়ে নাক পরিষ্কার করা ‘উসমান (রা), আবদুল্লাহ ইবন যায়দ (রা) ও ইবন ‘আব্বাস (রা) নবী থেকে এ কথা বর্ণনা করেছেনঃ ',
        hadisNumberList: [
          HadisNumberModel(
            id: '১৬২। ',
            name:
                ' আবদান (রহঃ) ...... আবূ ইদরিস (রহঃ) থেকে বর্ণিত, তিনি বলেন, তিনি আবূ হুরায়রা (রাঃ)–কে বলতে শুনেছেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেনঃ যে ব্যাক্তি উযূ (ওজু/অজু/অযু) করে সে যেন নাকে পানি দিয়ে নাক পরিষ্কার করে। আর যে ইসতিনজা করে সে যেন বেজোড় সংখ্যক ঢিলা-কুলুখ ব্যবহার করে। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১২১।',
        name: '  (ইসতিনজার জন্য) বেজোড় সংখ্যক ঢিলা-কুলুখ ব্যবহার করা',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ১৬৩। ',
            name:
                '‘আবদুল্লাহ ইবনু ইউসুফ (রহঃ) .... আবূ হুরায়রা (রহঃ) থেকে বর্ণিত যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের মধ্যে কেউ যখন উযূ (ওজু/অজু/অযু) করে তখন সে যেন নাকে পানি দেয়, এরপর যেন ঝেড়ে নেয়। আর যে ইস্তিঞ্জা করে সে যেন বেজোড় সংখ্যক ঢিলা-কুলুখ ব্যবহার করে। আর তোমাদের কেউ যখন ঘুম থেকে জাগে তখন সে যেন উযূর পানিতে হাত ঢুকানোর আগে তা ধুয়ে নেয়; কারণ তোমাদের কেউ জাননা যে, ঘুমন্ত অবস্থায় তার হাত কোথায় থাকে। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১২২। ',
        name: 'দু’পা ধোয়া এবং মাসেহ না করা ',
        hadisNumberList: [
          HadisNumberModel(
            id: '১৬৪। ',
            name:
                ' মূসা (রহঃ) .... ‘আবদুল্লাহ ইবনু ‘আমর (রাঃ) থেকে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক সফরে আমাদের পিছনে রয়ে গিয়েছিলেন, এরপর তিনি আমাদের কাছে পৌঁছে গেলেন। তখন আমরা আসরের সালাত (নামায/নামাজ) শুরু করতে দেরী করে ফেলেছিলাম। তাই আমরা উযূ (ওজু/অজু/অযু) করছিলাম এবং (তাড়াতাড়ির কারনে) আমাদের পা মাসেহ করার মত হালকা ভাবে ধুয়ে নিচ্ছিলাম। তখন তিনি উচ্চস্বরে বললেনঃ \'পায়ের গোড়ালির জন্য জাহান্নামের আযাব রয়েছে\'। দুবার অথবা তিনবার তিনি একথা বললেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১২৩।',
        name: ' উযূতে কুলি করা। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'قَالَهُ ابْنُ عَبَّاسٍ وَعَبْدُ اللَّهِ بْنُ زَيْدٍ رَضِيَ اللَّهُ عَنْهُمْ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ইবন ‘আব্বাস (রাঃ) ও ‘আবদুল্লাহ ইবন যায়দ (রাঃ) নবী থেকে তা বর্ণনা করেছেন। ১৬৫। আবূল ইয়ামান (রহঃ) ..... ‘উসমান ইবনু ‘আফ্‌ফান (রাঃ) এর আযাদকৃত গোলাম হুমরান (রহঃ) থেকে বর্ণিতঃ তিনি ‘উসমান (রাঃ)-কে উযূর পানি আনাতে দেখলেন। তারপর তিনি সে পাত্র থেকে উভয় হাতের উপর পানি ঢেলে তা তিনবার ধুয়ে ফেললেন। এরপর তাঁর ডান হাত পানিতে ঢুকালেন। এরপর কুলি করলেন এবং নাকে পানি দিয়ে নাক ঝেড়ে ফেললেন। এরপর তাঁর মুখমণ্ডল তিনবার এবং উভয় হাত কুনই পর্যন্ত তিনবার ধুলেন, এরপর মাথা মাসেহ করলেন। এরপর প্রত্যেক পা তিনবার ধোয়ার পর বললেনঃ আমি রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে আমার এ উযূর ন্যায় উযূ (ওজু/অজু/অযু) করতে দেখেছি এবং রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যাক্তি আমার এ উযূর ন্যায় উযূ করে দু’ রাক‘আত সালাত (নামায/নামাজ) আদায় করবে এবং তার মধ্য কোন বাজে খেয়াল মনে আনবে না, আল্লাহ তা‘আলা তাঁর অতীতের সব গুনাহ মাফ করে দিবেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১২৪। ',
        name: ' পায়ের গোড়ালী ধোয়া। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                ' وَكَانَ ابْنُ سِيرِينَ يَغْسِلُ مَوْضِعَ الْخَاتَمِ إِذَا تَوَضَّأَ ইবনে সীরীন (রহঃ) উযূ করার সময় তাঁর আংটির জায়গা ধুতেন। ১৬৬। আদম ইবনু আবূ ইয়াস (রহঃ) .... মুহাম্মদ ইবনু যিয়াদ (রহঃ) থেকে বর্ণিতঃ তিনি বলেন, আবূ হুরায়রা (রাঃ) আমাদের কাছ দিয়ে যাচ্ছিলেন। লোকেরা সে সময় পাত্র থেকে উযূ (ওজু/অজু/অযু) করছিল। তখন তাঁকে বলতে শুনেছি, তোমরা উত্তমরূপে উযূ কর। কারন আবূল কাসিম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ পায়ের গোড়ালীগুলোর জন্য জাহান্নামের শাস্তি রয়েছে।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১২৫।',
        name: '  চপ্পল পরা অবস্থায় উভয় পা ধোয়া কিন্তু চপ্পলের উপর মাসেহ না করা',
        hadisNumberList: [
          HadisNumberModel(
            id: '১৬৭। ',
            name:
                ' আবদুল ইবনু ইউসুফ (রহঃ) .... ‘উবায়দ ইবনু জুরায়জ (রহঃ) থেকে বর্ণিতঃ তিনি ‘আবদুল্লাহ ইবনু ‘উমর (রাঃ)-কে বললেন, হে আবূ ‘আবদুর রহমান! আমি আপনাকে এমন চারটি কাজ করতে দেখি, যা আপনার অন্য কোন সঙ্গীকে করতে দেখিনা। তিনি বললেন, ‘ইবনু জুরায়জ, সেগুলো কি?’ তিনি বললেন, আমি দেখি, (১) আপনি তাওয়াফ করার সময় রুকনে ইয়ামানী দু\'টি ব্যতীত অন্য রুকন স্পর্শ করেন না। (২) আপনি ‘সিবতী’ (পশমবিহীন) চপ্পল পরিধান করেন; (৩) আপনি (কাপড়ে) হলুদ রং ব্যবহার করেন এবং (৪) আপনি যখন মক্কায় থাকেন লোকে চাঁদ দেখে ইহরাম বাঁধে; কিন্তু আপনি তারবিয়ার দিন (৮ ই যিলহাজ্জ) না এলে ইহরাম বাঁধেন না। ‘আবদুল্লাহ (রাঃ) বললেনঃ রুকনের কথা যা বলেছ, তা এজন্য করি যে আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে ইয়ামানী রুকনদ্বয় ছাড়া আর কোনটি স্পর্শ করতে দেখিনি। আর ‘সিবতী’ চপ্পল, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে পশমবিহীন চপ্পল পরতে এবং তা পরিহিত অবস্থায় উযূ (ওজু/অজু/অযু) করতে দেখেছি, তাই আমি তা করতে ভালবাসি। আর হলুদ রং, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে তা দিয়ে কাপড় রঙিন করতে দেখেছি, তাই আমিও তা দিয়ে রঙিন করতে ভালবাসি। আর ইহরাম, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে নিয়ে তাঁর সওয়ারি রওনা না হওয়া পর্যন্ত আমি তাঁকে ইহরাম বাঁধতে দেখিনি। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১২৬। ',
        name: ' উযূ এবং গোসলে ডান দিক থেকে শুরু করা ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ১৬৮।',
            name:
                '  মূসা’দ্দাদ (রহঃ) .... উম্মু আতিয়্যা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর কন্যা [যয়নাব (রাঃ)]-কে গোসল করানোর সময় তাঁদের বলেছিলেনঃ তোমরা তার ডানদিক এবং উযূ (ওজু/অজু/অযু) এর স্থান থেকে শুরু কর।',
            ref: '',
          ),
          HadisNumberModel(
            id: '১৬৯।  ',
            name:
                'হাফস ইবনু ‘উমর (রহঃ) .... ‘আয়িশা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জুতা পরা, চুল আঁচড়ানো এবং পবিত্রতা অর্জন করা তথা প্রত্যেক কাজই ডান দিক থেকে শুরু করতে ভালবাসতেন। প্রাসঙ্গিক আলোচনা ডান দিক যে কোনো ভালো কাজের জন্য ব্যবহার করা সুন্নাতসম্মত। ইমাম সানাআনী বলেন, আল্লাহ ও তাঁর রাসুল কর্তৃক কোনো কিছু পছন্দ করার বিষয়টি বর্ণিত হলে সেটি নিদেনপক্ষে বৈধ হওয়া সাব্যস্ত করে; কারণ তা হয় ওয়াজিব হবে না হয় মুস্তাহাব হবে। ইমাম ইবন তাইমিয়্যাহ রাহিমাহুল্লাহ বলেন, ডান দিক ব্যবহারের এ নিয়ম থেকে বাথরুমে প্রবেশ করা, মসজিদ থেকে বের হওয়া ইত্যাদি কর্মকাণ্ডগুলো ব্যতিক্রম ধরা হবে। * এই হাদীস হতে শিক্ষণীয় বিষয়: ১। প্রকৃত ইসলাম ধর্মের একটি স্থায়ী বিধান হলো এই যে, সম্মানিত ও সমাদৃত কাজে অথবা যে বিষয়টির দ্বারা সম্মান ও মর্যাদাদান করা হয়: যেমন জামাকাপড়, পাজামা, মোজা পরিধান করা। এবং মাসজিদে প্রবেশ, মেসওয়াক বা দাঁতন ব্যবহার করা, চোখে কাজল বা সুরমা লাগানো, নখ কাটা, মোচ ছাঁটা, চিরনির দ্বারা মাথার চুল আঁচড়াবার সময়, বগলের চুল উপড়ানো বা তুলে ফেলার সময়, মাথার চুল মুণ্ডন এবং নামাজ শেষে সালাম ফেরানো, পবিত্রতার্জন করার সময়, দেহের অঙ্গগুলি ধৌত করার সময় ডান দিক থেকে শুরু করা উত্তম। অনুরূপভাবে শৌচাগার বা টয়লেট থেকে বের হওয়ার সময়, পানাহার ও মুসাফাহা করার সময় এবং  হাজরে আসওয়াদ ‍স্পর্শ করার সময় এবং আরো ইত্যাদি সেই সমস্ত কাজে ডান হাত কিংবা  দিক থেকে আরম্ভ করা উত্তম বা মুস্তাহাব যে সমস্ত কাজে সম্মান ও মর্যাদাদান করা হয় । ২। তবে যে সমস্ত কাজে সম্মান ও মর্যাদা দান করা হয় না যেমন, শৌচাগার বা টয়লেটে প্রবেশ করা, মাসজিদ থেকে বের হওয়া,  নাক পরিষ্কার করা, মলত্যাগের পর মলদ্বার ইত্যাদি পরিষ্কার করা, জামাকাপড়, পাজামা, মোজা ইত্যাদি খোলার কাজগুলি বাম দিক থেকে সম্পাদন করা উত্তম বা মুস্তাহাব। আর এই বিধানটির উদ্দেশ্য হলো ডান দিকের সম্মান ও মর্যাদা দান করা। ৩। প্রত্যেক মুসলিম ব্যক্তির একটি অপরিহার্য বিষয় হলো এই যে, তারা যেন প্রকৃত ইসলাম ধর্মের কার্য সম্পাদনের ক্ষেত্রে আল্লাহর রাসূল [সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম] এর সঠিক পন্থায় অনুসরণ করে। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১২৭। ',
        name: ' সালাতের সময় নিকটবর্তি বলে উযূর পানি তালাশ করা। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'وَقَالَتْ عَائِشَةُ حَضَرَتِ الصُّبْحُ فَالْتُمِسَ الْمَاءُ، فَلَمْ يُوجَدْ، فَنَزَلَ التَّيَمُّمُ ‘আয়িশা (রা) বলেনঃ একবার ফজরের সময় হল, তখন পানি তালাশ করা হল; কিন্তু কোথাও পাওয়া গেল না। তখন তায়াম্মুম (এর আয়াত) নাযিল হল। ১৭০। আবদুল্লাহ ইবনু ইউসুফ (রহঃ) ..... আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে দেখলাম, তখন আসরের সালাত (নামায/নামাজ)-এর সময় হয়ে গিয়েছিল। আর লোকজন উযূর পানি তালাশ করতে লাগল কিন্তু পেল না। তারপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে কিছু পানি আনা হল। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সে পাত্রে তাঁর হাত রাখলেন এবং লোকজনকে সে পাত্র থেকে উযূ (ওজু/অজু/অযু) করতে বললেন। আনাস (রাঃ) বলেন, সে সময় আমি দেখলাম, তাঁর আঙ্গুলের নীচ থেকে পানি উথলে উঠছে। এমনকি তাঁদের শেষ ব্যাক্তি পর্যন্ত তা দিয়ে উযূ করল। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১২৮। ',
        name: 'যে পানি দেয়ে মানুষের চুল ধোয়া হয়। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'وَكَانَ عَطَاءٌ لاَ يَرَى بِهِ بَأْسًا أَنْ يُتَّخَذَ مِنْهَا الْخُيُوطُ وَالْحِبَالُ، وَسُؤْرِ الْكِلاَبِ وَمَمَرِّهَا فِي الْمَسْجِدِ. وَقَالَ الزُّهْرِيُّ إِذَا وَلَغَ فِي إِنَاءٍ لَيْسَ لَهُ وَضُوءٌ غَيْرُهُ يَتَوَضَّأُ بِهِ. وَقَالَ سُفْيَانُ هَذَا الْفِقْهُ بِعَيْنِهِ، يَقُولُ اللَّهُ تَعَالَى: (فَلَمْ تَجِدُوا مَاءً فَتَيَمَّمُوا) وَهَذَا مَاءٌ، وَفِي النَّفْسِ مِنْهُ شَيْءٌ، يَتَوَضَّأُ بِهِ وَيَتَيَمَّمُ ‘আতা (রহঃ) চুল দিয়ে সুতা এবং রশি প্রস্তুত করায় কোন দোষ মনে করতেন না- কুকুরের ঝুটা এবং মসজিদের ভিতর দিয়ে কুকুরের যাতায়াত। যুহরী (রহঃ) বলেন, কুকুর যখন কোন পানির পাত্রে মুখ দেয় এবং সে পানি ছাড়া উযূ করার মত অন্য কোন পানি না থাকে, তবে তা দিয়েই উযূ করবে। সুফিয়ান (রহঃ) বলেন, হুবহু এ মাসআলাটি বিবৃত হয়েছে আল্লাহ তা‘আলার এ বাণীতেঃ (فَلَمْ تَجِدُوا مَاءً فَتَيَمَّمُوا) “তারপর তোমরা যদি পানি না পাও তবে পাবিত্র মাটি দিয়ে তায়াম্মুম কর।” আর এ তো পানিই। কিন্তু অন্তরে যেহেতু কিছু সন্দেহ রয়েছে তাই তা দিয়ে উযূ করবে, পরে তায়াম্মুমও করবে। ১৭১। মালিক ইবনু ইসমা‘ঈল (রহঃ) .... ইবনু সীরীন (রহঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি আবীদা (রহঃ)-কে বললাম, আমাদের কাছে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কেশ রয়েছে যা আমরা আনাস (রাঃ) এর কাছ থেকে কিংবা আনাস (রাঃ) এর পরিবারের কাছ থেকে পেয়েছি। তিনি বললেন, তাঁর একটি কেশ আমার কাছে থাকাটা দুনিয়া এবং দুনিয়ার মধ্যে যা কিছু আছে তা পাওয়ার চাইতে বেশী পছন্দনীয়। باب الْمَاءِ الَّذِي يُغْسَلُ بِهِ شَعَرُ الإِنْسَانِ حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا إِسْرَائِيلُ، عَنْ عَاصِمٍ، عَنِ ابْنِ سِيرِينَ، قَالَ قُلْتُ لِعَبِيدَةَ عِنْدَنَا مِنْ شَعَرِ النَّبِيِّ صلى الله عليه وسلم صلى الله عليه وسلم أَصَبْنَاهُ مِنْ قِبَلِ أَنَسٍ، أَوْ مِنْ قِبَلِ أَهْلِ أَنَسٍ فَقَالَ لأَنْ تَكُونَ عِنْدِي شَعَرَةٌ مِنْهُ أَحَبُّ إِلَىَّ مِنَ الدُّنْيَا وَمَا فِيهَا‏.‏ ',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ১৭২।',
            name:
                '  মুহাম্মদ ইবনু ‘আবদুর রহীম (রহঃ) .... আনাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর মাথা মুড়িয়ে ফেললে আবূ তালহা (রাঃ)-ই প্রথম তাঁর কেশ সংগ্রহ করেন।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১২৯। ',
        name: ' কুকুর যদি পাত্র থেকে পানি পান করে ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ১৭৩। ',
            name:
                ' আবদুল্লাহ ইবনু ইউসুফ (রহঃ) .... আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তোমাদের কারো পাত্রে যদি কুকুর পান করে তবে তা সাতবার ধুইবে।',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ১৭৪।',
            name:
                ' ইসহাক (রহঃ) ..... আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, (পূর্ব যুগে) এক ব্যাক্তি একটি কুকুরকে পিপাসার তাড়নায় ভিজা মাটি চাটতে দেখতে পেল। তখন সে ব্যাক্তি তাঁর মোজা নিল এবং কুকুরটির জন্য কুয়া থেকে পানি এনে দিতে লাগল। এভাবে সে ওর তৃষ্ণা মিটাল। আল্লাহ এর বিনিময় দিলেন এবং তাকে জান্নাতে দাখিল করলেন। আহমদ ইবনু শাবীব (রহঃ) .... ‘আবদুল্লাহ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর যামানায় কুকুর মসজিদের ভিতর দিয়ে আসা-যাওয়া করত অথচ এজন্য তাঁরা কোথাও পানি ছিটিয়ে দিতেন না। ',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ১৭৫।',
            name:
                '  হাফস ইবনু উমর (রহঃ) .... আদী ইবনু হাতিম (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি (প্রশিক্ষণপ্রাপ্ত কুকুর সম্পর্কে) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে জিজ্ঞাসা করলাম, তিনি বললেন, তুমি যখন তোমার প্রশিক্ষণপ্রাপ্ত কুকুর শিকার করতে ছেড়ে দাও, তখন সে হত্যা করলে তা তুমি খেতে পার। আর সে তার কিছু অংশ খেয়ে ফেললে তুমি তা খাবে না। কারণ সে তা নিজের জন্যই ধরেছে। আমি জিজ্ঞাসা করলাম, কখনো কখনো আমি আমার কুকুর (শিকারে) পাঠিয়ে দেই, এরপর তার সাথে অন্য এক কুকুরও দেখতে পাই (এমতাবস্থায় শিকারকৃত প্রানীর কি হুকুম)? তিনি বললেন, তাহলে খেও না। কারন তুমি বিসমিল্লাহ বলেছ কেবল তোমার কুকুরের বেলায়, অন্য কুকুরের বেলায় বিসমিল্লাহ বলনি।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১৩০।',
        name:
            '  সম্মুখ এবং পেছনের রাস্তা দিয়ে কিছু নির্গত হওয়া ছাড়া অন্য কারণে যিনি উযূর প্রয়োজন মনে করেন না',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'وَقَوْلِ اللَّهِ تَعَالَى: (أَوْ جَاءَ أَحَدٌ مِنْكُمْ مِنَ الْغَائِطِ) وَقَالَ عَطَاءٌ فِيمَنْ يَخْرُجُ مِنْ دُبُرِهِ الدُّودُ أَوْ مِنْ ذَكَرِهِ نَحْوُ الْقَمْلَةِ يُعِيدُ الْوُضُوءَ. وَقَالَ جَابِرُ بْنُ عَبْدِ اللَّهِ إِذَا ضَحِكَ فِي الصَّلاَةِ أَعَادَ الصَّلاَةَ، وَلَمْ يُعِدِ الْوُضُوءَ. وَقَالَ الْحَسَنُ إِنْ أَخَذَ مِنْ شَعَرِهِ وَأَظْفَارِهِ أَوْ خَلَعَ خُفَّيْهِ فَلاَ وُضُوءَ عَلَيْهِ. وَقَالَ أَبُو هُرَيْرَةَ لاَ وُضُوءَ إِلاَّ مِنْ حَدَثٍ. وَيُذْكَرُ عَنْ جَابِرٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ فِي غَزْوَةِ ذَاتِ الرِّقَاعِ فَرُمِيَ رَجُلٌ بِسَهْمٍ، فَنَزَفَهُ الدَّمُ فَرَكَعَ وَسَجَدَ، وَمَضَى فِي صَلاَتِهِ. وَقَالَ الْحَسَنُ مَا زَالَ الْمُسْلِمُونَ يُصَلُّونَ فِي جِرَاحَاتِهِمْ. وَقَالَ طَاوُسٌ وَمُحَمَّدُ بْنُ عَلِيٍّ وَعَطَاءٌ وَأَهْلُ الْحِجَازِ لَيْسَ فِي الدَّمِ وُضُوءٌ. وَعَصَرَ ابْنُ عُمَرَ بَثْرَةً فَخَرَجَ مِنْهَا الدَّمُ، وَلَمْ يَتَوَضَّأْ. وَبَزَقَ ابْنُ أَبِي أَوْفَى دَمًا فَمَضَى فِي صَلاَتِهِ. وَقَالَ ابْنُ عُمَرَ وَالْحَسَنُ فِيمَنْ يَحْتَجِمُ لَيْسَ عَلَيْهِ إِلاَّ غَسْلُ مَحَاجِمِهِ আল্লাহ তা‘আলার এ বাণীর কারণেঃ (أَوْ جَاءَ أَحَدٌ مِنْكُمْ مِنَ الْغَائِطِ) “অথবা তোমাদের কেউ শৌচ স্থান থেকে আসে (৮ঃ ৪৩)। ‘আতা (রহঃ) বলেন, যার পেছনের রাস্থা দিয়ে পোকা বের হয় অথবা যার পুরুষাঙ্গ দিয়ে উকুনের ন্যায় কিছু বের হয়, তার পুনরায় উযূ করতে হবে। জাবির ইবন ‘আবদুল্লাহ (রাঃ) বলেন, কেউ সালাতের মধ্যে হেসে ফেললে কেবল সালাতই দোহরাবে, পুনরায় উযূ করবে না। হাসান (রহঃ) বলেন, কেউ যদি চুল অথবা নখ কাটে অথবা তার মোজা খুলে ফেলে তবে তার পুনরায় উযূ করতে হবে না। আবূ হুরায়রা (রাঃ) বলেন, ‘হাদাস’ ছাড়া আর কিছুতে উযূর প্রয়োজন নেই। জাবির (রাঃ) থেকে বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ‘যাতুর রিকা’ এর যুদ্ধে ছিলেন। সেখানে এক ব্যক্তি তীরবিদ্ধ হলেন এবং ফিনকি দিয়ে রক্ত ছুটল, কিন্তু তিনি (সে অবস্থায়ই) রুকু করলেন, সিজদা করলেন এবং সালাত আদায় করতে থাকলেন। হাসান (রহঃ) বলেন, মুসলিমগণ সব সময়েই তাঁদের যখম অবস্থায় সালাত আদায় করতেন এবং তাঊস (রহঃ), মুহাম্মদ ইবন ‘আলী (রহঃ), ‘আতা (রহঃ) ও হিজাযবাসীগণ বলেন, রক্তক্ষরণে উযূ করতে হয় না। ইবন ‘উমর (রাঃ) একবার একটি ছোট ফোঁড়া টিপ দিলেন, তা থেকে রক্ত বের হল, কিন্তু তিনি উযূ করলেন না। ইবন আবূ আওফা (রাঃ) রক্ত মিশ্রিত থুথু ফেললেন কিন্তু তিনি সালাত আদায় করতে থাকলেন। ইবন ‘উমর (রাঃ) ও হাসান (রহঃ) বলেন, কেউ শিঙ্গা লাগালে কেবল তার শিঙ্গা লাগানোর স্থানই ধোয়া প্রয়োজন। ১৭৬। আদম ইবনু আবূ ইয়াস (রহঃ) .... আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, বান্দা যে সময়টা মসজিদে থেকে সালাত (নামায/নামাজ)-এর অপেক্ষায় থাকে, তার সে পুরো সময়টাই সালাত (নামায/নামাজ)-এর মধ্যে গণ্য হয় যতক্ষণ না সে হাদাস করে। এক অনারব ব্যাক্তি বলল, ‘হাদাস কি, আবূ হুরায়রা’? তিনি বললেন, শব্দ করে বায়ূ বের হওয়া। باب مَنْ لَمْ يَرَ الْوُضُوءَ إِلاَّ مِنَ الْمَخْرَجَيْنِ، مِنَ الْقُبُلِ وَالدُّبُرِ حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، قَالَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ "‏ لاَ يَزَالُ الْعَبْدُ فِي صَلاَةٍ مَا كَانَ فِي الْمَسْجِدِ يَنْتَظِرُ الصَّلاَةَ، مَا لَمْ يُحْدِثْ ‏"‏‏.‏ فَقَالَ رَجُلٌ أَعْجَمِيٌّ مَا الْحَدَثُ يَا أَبَا هُرَيْرَةَ قَالَ الصَّوْتُ‏.‏ يَعْنِي الضَّرْطَةَ‏.‏ ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১৩০।',
        name:
            ' সম্মুখ এবং পেছনের রাস্তা দিয়ে কিছু নির্গত হওয়া ছাড়া অন্য কারণে যিনি উযূর প্রয়োজন মনে করেন না ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ১৭৭।',
            name:
                ' আবূল ওয়ালীদ (রহঃ) ..... ‘আব্বাস ইবনু তামীম (রহঃ), তাঁর চাচার সূত্রে বর্ণনা করেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ (কোন মুসল্লি) সালাত (নামায/নামাজ) থেকে ফিরবে না যতক্ষণ না সে শব্দ শুনে বা গন্ধ পায়। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '১৭৮।  ',
            name:
                ' কুতায়বা (রহঃ) .... মুহাম্মদ ইবনুল হানফিয়্যা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, ‘আলী (রাঃ) বলেছেন, আমার বেশী বেশী মযী বের হতো। কিন্তু আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এ সম্পর্কে জিজ্ঞাসা করতে লজ্জাবোধ করছিলাম। তাই আমি মিকদাদ ইবনু আসওয়াদ (রাঃ)-কে অনুরোধ করলাম, তিনি যেন রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে জিজ্ঞাসা করেন। তিনি তাঁকে জিজ্ঞাসা করলেন। তিনি বললেনঃ এতে শুধু উযূ (ওজু/অজু/অযু) করতে হয়। হাদিসটি শু‘বা (রহঃ) আ‘মাশ (রহঃ) থেকে বর্ণনা করেছেন।',
            ref: '',
          ),
          HadisNumberModel(
            id: '১৭৯।  ',
            name:
                ' সা‘দ ইবনু হাফস (রহঃ) .... যায়দ ইবনু খালিদ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, তিনি ‘উসমান ইবনু ‘আফফান (রাঃ)-কে জিজ্ঞাসা করলেন ,কেউ যদি স্ত্রী সহবাস করে, কিন্তু মনী (বীর্য) বের না হয় (তবে তার হুকুম কি?) উসমান (রাঃ) বললেনঃ সে উযূ (ওজু/অজু/অযু) করে নেবে যেমন উযূ করে থাকে সালাত (নামায/নামাজ)-এর জন্য এবং তার লজ্জাস্থান ধুয়ে ফেলবে। উসমান (রাঃ) বলেন, আমি একথা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে শুনেছি। (যায়দ বলেন) তারপর আমি এ সম্পর্কে ‘আলী (রাঃ), যুবায়র (রাঃ), তালহা (রাঃ) ও উবাই ইবনু কা‘ব (রাঃ)-কে জিজ্ঞাসা করেছি। তাঁরা আমাকে এ নির্দেশই দিয়েছেন।',
            ref: '',
          ),
          HadisNumberModel(
            id: '১৮০।  ',
            name:
                'ইসহাক ইবনু মনসূর (রহঃ) .... আবূ সা‘য়ীদ খুদরী (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক আনসারীর কাছে লোক পাঠালেন। তিনি চলে এলেন। তখন তাঁর মাথা থেকে পানির ফোঁটা পড়ছিল। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ সম্ভবত আমরা তোমাকে তাড়াতাড়ি করতে বাধ্য করেছি। তিনি বললেন, জী। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, যখন ত্বরার কারণে মনী বের না হয় (অথবা বললেন), মনীর অভাবজনিত কারণে তা বের না হয় তবে তোমার উপর কেবল উযূ (ওজু/অজু/অযু) করা জরুরী। ওয়াহব (রহঃ) শু‘বা (রহঃ) সূত্রে এ রকমই বর্ণনা করেন। তিনি [শুবা (রহঃ)] বলেন, আবূ আবদুল্লাহ (রহঃ) বলেছেন, গুনদর (রহঃ) ও ইয়াহইয়া (রহঃ) শু‘বা (রহঃ) এর সূত্রে বর্ণনায় উযূর কথা উল্লেখ করেন নি। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১৩১।',
        name: ' শ্রদ্ধেয় জনকে কোন ব্যক্তির উযূ করিয়ে দেওয়া ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ১৮১। ',
            name:
                ' ইবনু সালাম (রহঃ) .... উসামা ইবনু যায়দ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন আরাফাত থেকে ফিরছিলেন, তখন তিনি একটি গিরিপথের দিকে গিয়ে তাঁর প্রাকৃতিক প্রয়োজন সেরে এলেন। উসামা (রাঃ) বলেন, পরে আমি তাঁকে পানি ঢেলে দিচ্ছিলাম আর তিনি উযূ (ওজু/অজু/অযু) করছিলেন। এরপর আমি বললাম, ইয়া রাসুলাল্লাহ! আপনি কি সালাত (নামায/নামাজ) আদায় করবেন? তিনি বললেন, সালাত (নামায/নামাজ)-এর স্থান তোমার সামনে।',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ১৮২।',
            name:
                '  আমর ইবনু ‘আলী (রহঃ) .... মুগীরা ইবনু শু‘বা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, তিনি এক সফরে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে ছিলেন। এক সময় তিনি প্রাকৃতিক প্রয়োজন সারতে গেলেন। (প্রয়োজন সেরে আসার পর) মুগীরা তাঁকে পানি ঢেলে দিচ্ছিলেন এবং তিনি উযূ (ওজু/অজু/অযু) করছিলেন। তিনি তাঁর মুখমণ্ডল এবং দু হাত ধুলেন এবং তাঁর মাথা মাসেহ করলেন ও উভয় মোজার উপর মাসেহ করলেন।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১৩২।',
        name: ' বিনা উযূতে কুরআন প্রভৃতি পাঠ করা। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'وَقَالَ مَنْصُورٌ عَنْ إِبْرَاهِيمَ لاَ بَأْسَ بِالْقِرَاءَةِ فِي الْحَمَّامِ، وَبِكَتْبِ الرِّسَالَةِ عَلَى غَيْرِ وُضُوءٍ. وَقَالَ حَمَّادٌ عَنْ إِبْرَاهِيمَ إِنْ كَانَ عَلَيْهِمْ إِزَارٌ فَسَلِّمْ، وَإِلاَّ فَلاَ تُسَلِّمْমনসূর (রহঃ) ... ইবরাহীম (রহঃ) থেকে বর্ণিতঃ তিনি বলেন, হাম্মামখানায় (কুরআন) পাঠ করা এবং বিনা উযূতে পত্র লেখায় কোন দোষ নেই। হাম্মাদ (রহঃ) ইবরাহীম (রহঃ) থেকে বর্ণনা করেন, হাম্মামখানার লোকদের পরনে ইযার (লুঙ্গি বা পায়জামা) থাকলে সালাম দিও নতুবা সালাম দিও না। ১৮৩। ইসমাইল (রহঃ) .... ‘আবদুল্লাহ ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিতঃ তিনি একবার নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর স্ত্রী মায়মূনা (রাঃ) এর ঘরে রাত কাটান। তিনি ছিলেন ইবনু ‘আব্বাস (রাঃ) এর খালা। ইবনু ‘আব্বাস (রাঃ) বলেনঃ এরপর আমি বিছানার চওড়া দিকে শয়ন করলাম এবং রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও তাঁর স্ত্রী বিছানার লম্বা দিকে শয়ন করলেন; এরপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঘুমিয়ে পড়লেন। এমনিভাবে রাত যখন অর্ধেক হয়ে গেল তার কিছু পূর্বে কিংবা কিছু পরে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জেগে উঠলেন। তিনি বসে হাত দিয়ে তাঁর মুখমণ্ডল থেকে ঘুমের আবেশ মুছতে লাগলেন। তারপর সূরা আলে-‘ইমরানের শেষ দশ আয়াত পাঠ করলেন। এরপর দাঁড়িয়ে একটি ঝুলন্ত মশক থেকে উযূ (ওজু/অজু/অযু) করলেন। তিনি সুন্দরভাবে উযূ করলেন। তারপর সালাতে দাঁড়িয়ে গেলেন। ইবনু ‘আব্বাস (রাঃ) বলেন, আমিও উঠে তিনি যেরূপ করেছিলেন তদ্রুপ করলাম। তারপর গিয়ে তাঁর বাঁ পাশে দাঁড়ালাম। তিনি তাঁর ডান হাত আমার মাথার উপর রাখলেন এবং আমার ডান কান ধরে একটু নাড়া দিলেন (এবং তাঁর), ডান পাশে এনে দাঁড় করালেন। তারপর তিনি দু রাক‘আত সালাত (নামায/নামাজ) আদায় করলেন। তারপর দু রাক‘আত, তারপর দু রাক‘আত, দু রাক‘আত, তারপর দু রাক‘আত, তারপর দু রাক‘আত, তারপর বিতর আদায় করলেন। তারপর শুয়ে পড়লেন। কিছুক্ষণ পর তাঁর কাছে মুয়াযযিন এলেন। এরপর তিনি দাঁড়িয়ে হাল্কাভাবে দু রাক‘আত সালাত আদায় করলেন। তারপর বেরিয়ে গিয়ে ফজরের সালাত আদায় করলেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১৩৩। ',
        name: '  পূর্ণ বেহুশী ছাড়া উযূ না করা',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ১৮৪।',
            name:
                '  ইসমাইল (রহঃ) ..... আসমা বিনত আবূ বকর (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি একবার নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর স্ত্রী ‘আয়িশা (রাঃ) এর কাছে এলাম। তখন সুর্য গ্রহণ লেগেছিল। দেখলাম সব মানুষ দাঁড়িয়ে সালাত (নামায/নামাজ) আদায় করছে এবং ‘আয়িশা (রাঃ)-ও দাঁড়িয়ে সালাত (নামায/নামাজ) আদায় করছেন। আমি জিজ্ঞাসা করলাম লোকদের কী হয়েছে? তিনি তাঁর হাত দিয়ে আকাশের দিকে ইঙ্গিত করে বললেন, ‘সুবহানাল্লাহ্’! আমি বললাম এটা কি কোন আলামত? তিনি ইশারা করে বললেন, ‘হ্যাঁ’। এরপর আমিও সালাতে দাঁড়িয়ে গেলাম। এমনকি আমাকে সংজ্ঞাহীনতায় আচ্ছন্ন করে ফেলল এবং আমি আমার মাথায় পানি দিতে লাগলাম। তারপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (মুসল্লিদের দিকে) ফিরে আল্লাহর প্রশংসা ও মহিমা বর্ণনা করে বললেন, “যেসব জিনিস আমি ইতিপূর্বে দেখিনি সেসব আমি আমার এই স্থানে আমি দেখতে পেয়েছি, এমনকি জান্নাত এবং জাহান্নামও। আর আমার কাছে ওহী পাঠানো হয়েছে যে, কবরে তোমাদের পরীক্ষা করা হবে দাজ্জালের ফিতনার ন্যায় অথবা তার কাছাকাছি। বর্ণনাকারী বলেন, আসমা (রাঃ) কোনটি বলেছিলেন, আমি জানিনা। তোমাদের প্রত্যেকের কাছে (ফিরিশতা) উপস্থিত হবে এবং তাকে জিজ্ঞাসা করা হবে, “এ ব্যাক্তি সম্পর্কে তোমার কি জ্ঞান আছে?” –তারপর ‘মু’মিন, বা ‘মু’কিন’ ব্যাক্তি বলবে- আসমা ‘মুমিন’ বলেছিলেন না ‘মুকিন’ তা আমি জানিনা- ইনি মুহাম্মদুর রাসূলুল্লাহ। তিনি আমাদের কাছে মু‘জিযা ও হিদায়ত নিয়ে এসেছিলেন। আমরা তাঁর ডাকে সাড়া দিয়েছি, তাঁর প্রতি ঈমান এনেছি এবং তাঁর অনুসরণ করেছি। তারপর তাকে বলা হবে নিশ্চিন্তে ঘুমাও। আমরা জানলাম যে, তুমি মু’মিন ছিলে। আর ‘মুনাফিক’ বা ‘মুরতাব’ বলবে, আমি জানিনা। আসমা এর কোনটি বলেছিলেন তা আমি জানিনা- লোকজনকে এঁর সম্পর্কে কিছু একটা বলতে শুনেছি আর আমিও তা-ই বলেছি।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১৩৪।  ',
        name: ' পূর্ণ মাথা মসেহ করা।',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'لِقَوْلِ اللَّهِ تَعَالَى: (وَامْسَحُوا بِرُءُوسِكُمْ). وَقَالَ ابْنُ الْمُسَيَّبِ الْمَرْأَةُ بِمَنْزِلَةِ الرَّجُلِ تَمْسَحُ عَلَى رَأْسِهَا. وَسُئِلَ مَالِكٌ أَيُجْزِئُ أَنْ يَمْسَحَ بَعْضَ الرَّأْسِ فَاحْتَجَّ بِحَدِيثِ عَبْدِ اللَّهِ بْنِ زَيْدٍ আল্লাহ্‌ তা‘আলার এ বাণীর পরিপ্রেক্ষিতে (وَامْسَحُوا بِرُءُوسِكُمْ) (আর তোমাদের মাথা মসেহ কর) (৫ঃ ৬)। ইবনুল মুসায়্যিব বলেনঃ স্ত্রীলোকও (এ ক্ষেত্রে) পুরুষের সমপর্যায়ে। সে তার মাথা মসেহ করবে। ইমাম মালিক (রহঃ)-কে জিজ্ঞাসা করা হল, মাথার কিছু অংশ মসেহ করা কি যথেষ্ট হবে? তিনি ‘আবদুল্লাহ ইবন যায়দ (রাঃ) এর হাদিস দলীল হেসেবে পেশ করলেন। ১৮৫। আবদুল্লাহ ইবনু ইউসুফ (রহঃ) .... ইয়াহইয়া আল-মাযিনী (রহঃ) থেকে বর্ণিত, এক ব্যাক্তি ‘আবদুল্লাহ ইবনু যায়দ (রাঃ)-কে (তিনি আমর ইবনু ইয়াহিয়ার দাদা) জিজ্ঞাসা করলঃ আপনি কি আমাদেরকে দেখাতে পারেন, কিভাবে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উযূ (ওজু/অজু/অযু) করতেন? ‘আবদুল্লাহ ইবনু যায়দ (রাঃ) বলেনঃ হ্যাঁ। তারপর তিনি পানি আনালেন। হাতের উপর সে পানি ঢেলে দু’বার তাঁর হাত ধুইলেন। তারপর কুলি করলেন এবং তিনবার নাকে পানি দিয়ে ঝেড়ে পরিস্কার করলেন। এরপর চেহারা তিনবার ধুইলেন। তারপর দু’ হাত কনুই পর্যন্ত দু’বার করে ধুইলেন। তারপর দু\' হাত দিয়ে মাথা মাসেহ করলেন। অর্থাৎ হাত দু’টি সামনে ও পিছনে নিলেন। মাথার সম্মুখ ভাগ থেকে শুরু করে উভয় হাত গর্দান পর্যন্ত নিলেন। তারপর আবার যেখান থেকে নিয়েছিলেন, সেখানেই ফিরিয়ে আনলেন। তারপর দু’পা ধুইলেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১৩৫। ',
        name: '  উভয় পা গিরা পর্যন্ত ধোয়া',
        hadisNumberList: [
          HadisNumberModel(
            id: '১৮৬। ',
            name:
                ' মূসা (রহঃ) .... ‘আমর ইবনু আবূ হাসান (রহঃ) থেকে বর্ণিতঃ তিনি ‘আবদুল্লাহ ইবনু যায়দ (রাঃ)-কে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর উযূ (ওজু/অজু/অযু) সম্পর্কে প্রশ্ন করলেন। তখন তিনি এক পাত্র পানি আনালেন এবং তাঁদের (দেখাবার) জন্য নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর মত উযূ (ওজু/অজু/অযু) করলেন। তিনি পাত্র থেকে দু’হাতে পানি ঢাললেন। তা দিয়ে হাত দুটি তিনবার ধুইলেন। তারপর পাত্রের মধ্যে হাত ঢুকিয়ে তিন আঁজলা পানি দিয়ে কুলি করলেন এবং নাকে পানি দিয়ে নাক ঝাড়লেন। তারপর আবার হাত ঢুকালেন। তিনবার তাঁর চেহারা মুবারক ধুইলেন। তারপর আবার হাত ঢুকিয়ে (পানি নিয়ে) দুই হাত কনুই পর্যন্ত দু’বার ধুইলেন। তারপর আবার হাত ঢুকিয়ে উভয় হাত দিয়ে সামনে এবং পেছনে একবার মাথা মাসেহ করলেন। তারপর দু’ পা গিরা পর্যন্ত ধুইলেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১৩৬।',
        name: ' মানুষের উযূর অবশিষ্ট পানি ব্যবহার করা। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'وَأَمَرَ جَرِيرُ بْنُ عَبْدِ اللَّهِ أَهْلَهُ أَنْ يَتَوَضَّئُوا بِفَضْلِ سِوَاكِهِ  জাবির ইবন আবদুল্লাহ (রাঃ) তাঁর পরিবারকে মিসওয়াক ধোয়া অবশিষ্ট পানি দিয়ে উযূ করতে নির্দেশ দেন।  ১৮৭। আদম (রহঃ) ... আবূ জুহায়ফা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, একবার দুপুরে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের সামনে বেরিয়ে এলেন। তাঁকে উযূর পানি এনে দেওয়া হল। তখন তিনি উযূ (ওজু/অজু/অযু) করলেন। লোকে তাঁর উযূর ব্যবহৃত পানি নিয়ে গায়ে মাখতে লাগল। এরপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যোহরের দু’রাকআত সালাত (নামায/নামাজ) আদায় করলেন। আর তাঁর সামনে ছিল একটি লাঠি। আবূ মূসা (রাঃ) বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একটি পাত্র আনালেন যাতে পানি ছিল। তারপর তিনি তার মধ্যে উভয় হাত ও চেহারা মুবারক ধুইলেন এবং তার মধ্যে কুলি করলেন। তারপর তাঁদের দু’জন [আবূ মূসা (রাঃ) ও বিলাল (রাঃ)]-কে বললেন, তোমরা এ থেকে পান কর এবং তোমাদের মুখমণ্ডল ও বুকে ঢাল।',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ১৮৮।',
            name:
                '  আলী ইবনু ‘আবদুল্লাহ (রহঃ) .... মাহমুদ ইবনুুর-রবী (রাঃ) থেকে বর্ণিত, বর্ণনাকারী বলেনঃ তিনি সে ব্যাক্তি, যার মুখমণ্ডলে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁদের কুয়া থেকে পানি নিয়ে কুলির পানি দিয়েছিলান। তিনি তখন বালক ছিলেন। ‘উরওয়া (রহঃ) মিসওয়া (রহঃ) প্রমুখের কাছ থেকে হাদীস বর্ণনা করেন। এ উভয় বর্ণনা একটি অন্যটির সত্যায়ন করে। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন উযূ (ওজু/অজু/অযু) করতেন তখন তাঁর ব্যবহৃত পানির উপর তাঁরা (সাহাবায়ে কিরাম) যেন হুমড়ি খেয়ে পড়তেন।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১৩৭। ',
        name: '  পরিচ্ছেদ নাই',
        hadisNumberList: [
          HadisNumberModel(
            id: '১৮৯। ',
            name:
                '  আবদুর রহমান ইবনু ইউনুস (রহঃ) .... সায়িব ইবনু ইয়াযীদ (রাঃ) বলেনঃ আমার খালা আমাকে নিয়ে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর খিদমতে হাযির হলেন এবং বললেনঃ ‘ইয়া রাসুলাল্লাহ! আমার ভাগ্নে অসুস্থ’। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার মাথায় হাত বুলালেন এবং বরকতের দু‘আ করলেন। তারপর উযূ (ওজু/অজু/অযু) করলেন। আমি তাঁর উযূর (অবশিষ্ট) পানি পান করলাম। তারপর তাঁর পেছনে দাঁড়ালাম। তখন আমি তাঁর উভয় কাঁধের মধ্যস্থলে মোহরে নুবূওয়াত দেখতে পেলাম। তা ছিল নওশার আসনের ঘুন্টির মত।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১৩৮।  ',
        name: ' এক আঁজলা পানি দিয়ে কুলি করা ও নাকে পানি দেওয়া',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ১৯০। ',
            name:
                ' মূসা’দ্দাদ (রহঃ) .... ‘আবদুল্লাহ ইবনু যায়দ (রাঃ) থেকে বর্ণত, একবার তিনি পাত্র থেকে উভয় হাতে পানি ঢেলে দু’হাত ধৌত করলেন। তারপর এক আঁজলা পানি দিয়ে (মুখ) ধুইলেন বা কুলি করলেন এবং নাকে পানি দিলান। তিনবার এরূপ করলেন। তারপর দু’ হাত কনুই পর্যন্ত দু’-দু’বার ধুইলেন এবং মাথার সামনের অংশ এবং পেছনের অংশ মাসেহ করলেন। আর গিরা পর্যন্ত দু’ পা ধুইলেন। এরপর বললেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর উযূ (ওজু/অজু/অযু) এরূপ ছিল।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১৩৯। ',
        name: '  একবার মাথা মসেহ করা',
        hadisNumberList: [
          HadisNumberModel(
            id: '১৯১।  ',
            name:
                'সুলায়মান ইবনু হারব (রহঃ) ... ইয়াহইয়া (রহঃ) থেকে বর্ণিত, তিনি বলেন, ‘আমি একবার ‘আমার ইবনু আবূ হাসান (রাঃ) এর কাছে উপস্থিত ছিলাম। তিনি ‘আবদুল্লাহ ইবনু যায়দ (রাঃ)-কে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর উযূ (ওজু/অজু/অযু) সম্পর্কে জিজ্ঞাসা করলেন। তারপর তিনি পানির একটি পাত্র আনালেন এবং উযূ (ওজু/অজু/অযু) করে তাঁদের দেখালেন। তিনি পাত্রটি কাত করে উভয় হাতের উপর পানি ঢেলে তিনবার তা ধুয়ে ফেলেন। তারপর পাত্রের মধ্যে হাত ঢুকালেন এবং তিন আঁজলা পানি দিয়ে তিনবার করে কুলি করলেন এবং নাকে পানি দিয়ে তা ঝেড়ে ফেললেন। তারপর আবার পাত্রের মধ্যে হাত ঢুকালেন (এবং পানি দিয়ে) তিনবার মুখমণ্ডল ধুইলেন। তারপর আবার পাত্রের মধ্যে হাত ঢুকালেন এবং উভয় হাত কনুই পর্যন্ত দু\'-দু\'বার ধুইলেন। তারপর আবার পাত্রের মধ্যে হাত ঢুকালেন। তাঁর মাথা হাত দিয়ে সামনে এবং পেছনে মাসেহ করলেন। তারপর আবার পাত্রের মধ্যে তাঁর হাত ঢুকালেন এবং উভয় পা ধুইলেন। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '১৯২। ',
            name:
                ' উহয়র (রহঃ) সুত্রে মূসা (রহঃ) বর্ণনা করেন যে, মাথা একবার মসেহ করেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১৪০।  ',
        name:
            'নিজ স্ত্রীর সাথে উযূ করা এবং স্ত্রীর উযূর অবশিষ্ট পানি (ব্যবহার করা)। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'وَتَوَضَّأَ عُمَرُ بِالْحَمِيمِ مِنْ بَيْتِ نَصْرَانِيَّةٍ ‘উমর (রাঃ) গরম পানি দিয়ে এবং খৃস্টান মহিলাদের ঘরের পানি দিয়ে উযূ করেন। ১৯৩। আবদুল্লাহ ইবনু ইউসুফ (রহঃ) ..... ইবনু ‘উমর (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর যামানায় পুরুষ এবং মহিলা একত্রে উযূ (ওজু/অজু/অযু) করতেন।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১৪১।',
        name: ' বেহুশ লোকদের ওপর নবী (ﷺ) এর উযূর পানি ছিটিয়ে দেওয়া ',
        hadisNumberList: [
          HadisNumberModel(
            id: '১৯৪।  ',
            name:
                'আবূল ওলীদ (রহঃ) .... জাবির (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমার পীড়িত অবস্থায় একবার রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার খোঁজ-খবর নিতে এলেন। আমি তখন এতই অসুস্থ ছিলাম যে আমার জ্ঞান ছিল না। তারপর তিনি উযূ (ওজু/অজু/অযু) করলেন এবং তাঁর উযূর পানি আমার ওপর ছিটিয়ে দিলেন। তখন আমার জ্ঞান ফিরে এল। আমি বললাম, ইয়া রাসূলাল্লাহ! (আমার) ‘মীরাস’ কে পাবে? আমার একমাত্র ওয়ারিস হল কালালা (অর্থ পিতামাতা ও সন্তান-সন্ততি ছাড়া অন্যেরা)। তখন ফারায়েযের আয়াত নাযিল হল। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১৪২।',
        name: ' গামলা, কাঠ ও পাথরের পাত্রে উযূ-গোসল করা ',
        hadisNumberList: [
          HadisNumberModel(
            id: '১৯৫। ',
            name:
                ' আবদুল্লাহ ইবনু মুনীর (রহঃ) ... আনাস (রাঃ) থেকে বর্ণিত, তিনি বলেন, একবার সালাত (নামায/নামাজ)-এর সময় উপস্থিত হলে যাঁদের বাড়ী নিকটে ছিল তাঁরা (উযূ করার জন্য) বাড়ী চলে গেলেন। আর কিছু লোক রয়ে গেলেন (তাঁদের কোন উযূর ব্যবস্থা ছিল না)। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর জন্য একটি পাথরের পাত্রে পানি আনা হল। পাত্রটি এত ছোট ছিল যে, তার মধ্যে তাঁর উভয় হাত মেলে দেওয়া সম্ভব ছিল না। তা থেকেই কওমের সকল লোক উযূ (ওজু/অজু/অযু) করলেন। আমরা জিজ্ঞাসা করলাম, আপনারা কতজন ছিলেন? তিনি বললেন, আশিজন বা আরো বেশী। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '১৯৬। ',
            name:
                ' মুহাম্মদ ইবনুল ‘আলা (রহঃ) .... আবূ মূসা (রাঃ) থেকে বর্ণনা করেন যে, একবার রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একটি পানি ভর্তি পাত্র আনালেন। তাতে তাঁর উভয় হাত ও মুখমণ্ডল ধুইলেন এবং কুলি করলেন। ',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ১৯৭।',
            name:
                ' আহমদ ইবনু ইউনুস (রহঃ) .... আবদুল্লাহ ইবনু যায়দ (রাঃ) বলেন, একবার রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের বাড়ীতে এলেন। আমরা তাঁকে পিতলের একটি পাত্রে পানি দিলাম। তিনি তা দিয়ে উযূ (ওজু/অজু/অযু) করলেন। তাঁর মুখমণ্ডল তিনবার ও উভয় হাত দু’ দু’বার করে ধুইলেন এবং তাঁর হাত সামনে ও পেছনে এনে মাথা মাসেহ করলেন আর উভয় পা ধুইলেন। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '১৯৮। ',
            name:
                ' আবূল ইয়ামান (রহঃ) .... ‘আয়িশা (রাঃ) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর রোগ যন্ত্রণা বেড়ে গেলে তিনি আমার ঘরে শুশ্রূষার জন্য তাঁর পত্নীগনের অনুমতি চাইলেন। তাঁরা অনুমতি দিলে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (আমার ঘরে আসার জন্য) দু’ব্যাক্তির ওপর ভর করে বের হলেন। আর তাঁর পা দু’খানি তখন মাটিতে চিহ্ন রেখে যাচ্ছিল। তিনি ‘আব্বাস (রাঃ) ও অন্য এক ব্যাক্তির মাঝখানে ছিলেন। ‘উবায়দুল্লাহ (রহঃ) বলেন, আমি ‘আবদুল্লাহ ইবনু ‘আব্বাস (রাঃ)-কে এ কথা অবহিত করলাম। তিনি বললেন, সে অন্য ব্যাক্তিটি কে তা কি তুমি জানো? আমি বললাম, না। তিনি বললেন, তিনি হলেন ‘আলী ইবনু আবূ তালিব (রাঃ)। ‘আয়িশা (রাঃ) বর্ণনা করেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর ঘরে আসার পর রোগ আরো বেড়ে গেলে তিনি বললেন, তোমরা আমার উপর মুখের বাঁধন খোলা হয়নি এমন সাতটি মশকের পানি ঢেলে দাও, তাহলে হয়ত আমি মানুষকে কিছু ওয়াসিয়্যাত করব। তাঁকে তাঁর সহধর্মিণী হাফসা (রাঃ) এর একটি বড় পাত্রের মধ্যে বসিয়ে দেওয়া হল। তারপর আমরা তাঁর ওপর সেই সাত মশক পানি ঢালতে শুরু করলাম। এভাবে ঢালার পর এক সময় তিনি আমাদের প্রতি ইশারা করলেন, (এখন থাম) তোমরা তোমাদের কাজ করেছ। এরপর তিনি বের হয়ে জনসমক্ষে গেলেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১৪৩।',
        name: ' গামলা থেকে উযূ করা ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ১৯৯।',
            name:
                ' খালিদ ইবনু মাখলাদ (রহঃ) .... ইয়াহইয়া (রহঃ) বলেন, আমার চাচা উযূর পানি বেশী খরচ করতেন। একদিন তিনি ‘আবদুল্লাহ ইবনু যায়দ (রাঃ)-কে বললেন, ‘আপনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে কিভাবে উযূ (ওজু/অজু/অযু) করতে দেখেছেন? তিনি এক গামলা পানি আনালেন। সেটি উভয় হাতের ওপর কাত করে (তা থেকে পানি ঢেলে) হাত দু’খানি তিনবার ধুইলেন, তারপর তাঁর হাত গামলায় ঢুকালেন। তারপর এক আঁজলা পানি দিয়ে তিনবার কুলি করলেন এবং নাক পরিষ্কার করলেন। তারপর পানিতে তাঁর হাত ঢুকালেন। উভয় হাতে এক আঁজলা পানি নিয়ে মুখমণ্ডল তিনবার ধুইলেন। তারপর উভয় হাত কনুই পর্যন্ত দু’বার করে ধুইলেন। তারপর উভয় হাতে পানি নিয়ে মাথার সামনে এবং পেছনে মাসেহ করলেন এবং দু’পা ধুইলেন। তারপর বললেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে এভাবেই উযূ (ওজু/অজু/অযু) করতে দেখেছি। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '২০০। ',
            name:
                ' মূসা’দ্দাদ (রহঃ) .... আনাস (রাঃ) থেকে বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একপাত্র পানি চাইলেন। একটি বড় পাত্র তাঁর কাছে আনা হল, তাতে সামান্য পানি ছিল। তারপর তিনি তার মধ্যে তাঁর আঙ্গুল রাখলেন। আনাস (রাঃ) বলেন, আমি পানির দিকে তাকাতে লাগলাম। তাঁর আঙ্গুলের ভেতর দিয়ে পানি উথলে উঠতে লাগল। আনাস (রাঃ) বলেন, যারা উযূ (ওজু/অজু/অযু) করেছিল, আমি অনুমান করলাম তাদের সংখ্যা ছিল ৭০ থেকে ৮০ জন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১৪৪। ',
        name: ' এক মুদ (পানি) দিয়ে উযূ করা ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ২০১।',
            name:
                ' আবূ নু’আয়ম (রহঃ) ... আনাস (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক সা’ (৪ মুদ*) থেকে পাঁচ মুদ পর্যন্ত পানি দিয়ে গোসল করতেন এবং উযূ (ওজু/অজু/অযু) করতেন এক মুদ দিয়ে। চার মুদ = ১ সা, প্রায় ৮৩০ গ্রাম। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১৪৫।',
        name: '  উভয় মোজার ওপর মসেহ করা',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ২০২।',
            name:
                ' আসবাগ ইবনুল ফারাজ (রহঃ) ... সা’দ ইবনু আবূ ওয়াক্কাস (রাঃ) থেকে বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর উভয় মোজার ওপর মাসেহ করেছেন। ‘আবদুল্লাহ ইবনু উমর (তার পিতা) উমর (রাঃ)-কে এ ব্যাপারে জিজ্ঞাসা করলে তিনি বললেনঃ হ্যাঁ! সা’দ (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে কিছু বর্ণনা করলে সে ব্যাপারে আর অন্যকে জিজ্ঞাসা করো না। মুসা ইবন উকবা (রহঃ) ... সা\'দ (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ অতঃপর উমর (রাঃ) আবদুল্লাহ (রাঃ) কে অনুরূপ বললেন। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '২০৩।  ',
            name:
                ' আমর ইবনু খালিদ আল-হাররানী (রহঃ) .... মুগীরা ইবনু শু’বা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ একবার রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম প্রাকৃতিক প্রয়োজনে বাইরে গেলে মুগীরা (রাঃ) পানি সহ একটি পাত্র নিয়ে তাঁর অনুসরণ করলেন। তারপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম প্রাকৃতিক প্রয়োজন শেষ করে এলে মুগীরা (রাঃ) তাঁকে পানি ঢেলে দিলেন। আর তিনি উযূ (ওজু/অজু/অযু) করলেন এবং উভয় মোজার উপর মাসেহ করলেন।',
            ref: '',
          ),
          HadisNumberModel(
            id: '২০৪। ',
            name:
                ' আবূ নু’আয়ম (রহঃ) ... উমায়্যা যামরী (রাঃ) থেকে বর্ণনা করেন, তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে উভয় মোজার ওপর মাসেহ করতে দেখেছেন। হারব ও আবান (রহঃ) ইয়াহ্ইয়া (রহঃ) থেকে অনুরূপ বর্ণনা করেছেন। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '২০৫। ',
            name:
                '  আবদান (রহঃ) .... উমায়্যা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে তাঁর পাগড়ীর ওপর এবং উভয় মোজার ওপর মাসেহ করতে দেখেছি। মা’মার (রহঃ) আমর (রহঃ) থেকে অনুরূপ বর্ণনা করেনঃ আমি রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে তা করতে দেখেছি।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১৪৬।',
        name: '  পবিত্র অবস্থায় উভয় পা (মোজায়) প্রবেশ করানো',
        hadisNumberList: [
          HadisNumberModel(
            id: '২০৬। ',
            name:
                '  আবূ নু’আয়ম (রহঃ) ... মুগীরা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে এক সফরে ছিলাম। (উযূ (ওজু/অজু/অযু) করার সময়) আমি তাঁর মোজাদ্বয় খুলতে চাইলে তিনি বললেনঃ ওদুটো থাকুক, আমি পবিত্র অবস্থায় ও দু’টি পরেছিলাম। (এই বলে) তিনি তার ওপর মাসেহ করলেন।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১৪৭।',
        name: '  বকরীর গোশত এবং ছাতু খেয়ে উযূ না করা।',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                ' وَأَكَلَ أَبُو بَكْرٍ وَعُمَرُ وَعُثْمَانُ رَضِيَ اللَّهُ عَنْهُمْ لَحْمًا فَلَمْ يَتَوَضَّئُوا আবু বকর, উমর ও উসমান (রাঃ) গোশত খেয়ে উযূ করেন নি। ২০৭। আবদুল্লাহ ইবনু ইউসুফ (রহঃ) .... আবদুল্লাহ ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ একবার রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বকরীর কাঁধের গোশত খেলেন। তারপর সালাত (নামায/নামাজ) আদায় করলেন; কিন্তু উযূ (ওজু/অজু/অযু) করলেন না।',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ২০৮।',
            name:
                ' ইয়াহ্ইয়া ইবনু বুকায়র (রহঃ) .... উমায়্যা (রাঃ) থেকে বর্ণিত, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে একটি ববরীর কাঁধের গোশত কেটে খেতে দেখলেন। এ সময় সালাত (নামায/নামাজ)-এর জন্য ডাকা হল। তখন তিনি ছুরি ফেলে দিয়ে সালাত (নামায/নামাজ) আদায় করলেন; কিন্তু উযূ (ওজু/অজু/অযু) করলেন না। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১৪৮।',
        name: '  ছাতু খেয়ে উযূ না করে কেবল কুলি করা',
        hadisNumberList: [
          HadisNumberModel(
            id: '২০৯।  ',
            name:
                'আবদুল্লাহ ইবনু ইউসুফ (রহঃ) .... সুওযায়দ ইবনুু\'ন-নু\'মান (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ খায়বর যুদ্ধের বছর তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে রওয়ানা হলেন। চলতে চলতে তাঁরা যখন সাহবা-য় পৌঁছলেন, এটি খায়বরের নিবটবর্তী অঞ্চল, তখন তিনি আসরের সালাত (নামায/নামাজ) আদায় করলেন। তারপর খাবার আনতে বললেনঃ কিন্তু ছাতু ছাড়া আর কিছুই আনা হল না। তারপর তিনি নির্দেশ দেওয়ায় তা (পানিতে) মেশানো হল। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তা খেলেন এবং আমরাও খেলাম। তারপর তিনি মাগরিবের জন্য দাঁড়িয়ে কুলি করলেন এবং আমরাও কুলি করলাম। পরে তিনি সালাত আদায় করলেন; উযূ (ওজু/অজু/অযু) করলেন না। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '২১০।  ',
            name:
                ' আসবাগ (রহঃ) .... মায়মূনা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ একবার রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর কাছে (একটি বকরীর) কাঁধের গোশত খেলেন, তারপর সালাত (নামায/নামাজ) আদায় করলেন, আর উযূ (ওজু/অজু/অযু) করলেন না।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১৪৯',
        name: '  দুধ পান করলে কি কুলি করতে হবে?',
        hadisNumberList: [
          HadisNumberModel(
            id: '২১১। ',
            name:
                '  ইয়াহ্ইয়া ইবনু বুকায়র ও কুতায়বা (রহঃ) .... ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিত, একবার রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দুধ পান করলেন। তারপর কুলি করলেন এবং বললেনঃ এতে তৈলাক্ত পদার্থ রয়েছে (এজন্য কুলি করা ভাল)। ইউসুন ও সালিহ ইবনু কায়সান (রহঃ) যুহরী (রহঃ) থেকে অনুরূপ বর্ণনা করেছেন।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১৫০। ',
        name:
            'ঘুমের পরে উযূ করা এবং দু’একবার ঝিমালে বা মাথা ঝুঁকে পড়লে উযূ না করা ',
        hadisNumberList: [
          HadisNumberModel(
            id: '২১২। ',
            name:
                '  আবদুল্লাহ ইবনু ইউসুফ (রহঃ) .... ‘আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ সালাত (নামায/নামাজ) আদায়ের অবস্থায় তোমাদের কারো যদি তন্দ্রা আসে তবে সে যেন ঘুমের রেশ কেটে না যাওয়া পর্যন্ত ঘুমিয়ে নেয়। কারন, তন্দ্রাবস্থায় সালাত (নামায/নামাজ) আদায় করলে সে জানতে পারবে না, সে কি ক্ষমা চাইছে, না নিজেকে গালি দিচ্ছে।',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ২১৩।',
            name:
                ' আবূ মা’মার (রহঃ) .... আনাস (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কেউ যদি সালাতে ঝিমায়, সে যেন ততক্ষণ ঘুমিয়ে নেয়, যতক্ষন না সে কি পড়ছে, তা বুঝতে পারে। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১৫১।',
        name: ' হাদস ছাড়া উযূ করা ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ২১৪। ',
            name:
                'মুহাম্মদ ইবনু ইউসুফ (রহঃ) ও মূসা’দ্দাদ (রহঃ) ... আনাস (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম প্রত্যেক সালাতের সময় উযূ (ওজু/অজু/অযু) করতেন। আমি বললামঃ আপনারা কিরূপ করতেন? তিনি বললেনঃ হাদস (উযূ ভঙ্গের কারন) না হওয়া পর্যন্ত আমাদের (পূর্বের) উযূই যথেষ্ট হত। ',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ২১৫।',
            name:
                ' খালিদ ইবনু মাখলাদ (রহঃ) ... সুওয়ায়দ ইবনুু’ন-নু‘মান (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ খায়বার যুদ্ধের বছর আমরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে বের হলাম। সাহবা নামক স্থানে পৌঁছে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের নিয়ে আসরের সালাত (নামায/নামাজ) আদায় করলেন। সালাত শেষে তিনি খাবার আনতে বললেন। ছাতু ছাড়া আর কিছু আনা হল না। আমরা তা খেলাম এবং পান করলাম। তারপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মাগরিবের জন্য দাঁড়িয়ে কুলি করলেন; তিনি (নতুন) উযূ (ওজু/অজু/অযু) করলেন না। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১৫২। ',
        name: '  পেশাবের অপবিত্রতা থেকে সতর্ক না থাকা কবীরা গুনাহ',
        hadisNumberList: [
          HadisNumberModel(
            id: '২১৬।  ',
            name:
                ' উসমান (রহঃ) ... ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একবার মদিনা বা মক্কার কোন এক বাগানের কাছ দিয়ে যাচ্ছিলেন। তিনি এমন দু’ব্যাক্তির আওয়াজ পেলেন, যাদের কবরে আযাব হচ্ছিল। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ এদের দু’জনকে আযাব দেওয়া হচ্ছে, অথচ কোন বড় গুনাহের জন্য এদের আযাব দেওয়া হচ্ছে না। তারপর তিনি বললেনঃ হ্যাঁ, এদের একজন তার পেশাবের নাপাকি থেকে সতর্কতা অবলম্বন করত না। আর একজন চোগলখুরী করত। তারপর তিনি একটি খেজুরের ডাল আনালেন এবং তা ভেঙ্গে দু’খন্ড করে প্রত্যেকের কবরের উপর একখন্ড রাখলেন। তাঁকে জিজ্ঞাসা করা হল, ‘ইয়া রাসুলাল্লাহ! এরূপ কেন করলেন?’ তিনি বললেনঃ হয়ত তাদের আযাব কিছুটা লাঘব করা হবে, যতদিন পর্যন্ত এ দু’টি না শুকায়। প্রাসঙ্গিক আলোচনা হাদীসে উল্লিখিত ব্যক্তিদেরকে কবরে আযাব দেওয়ার যে কারণ, তা ত্যাগ করা তাদের ওপর কঠিন ছিল না। বস্তুত কেউ যদি অন্যায় থেকে বাঁচার চেষ্টা করে আল্লাহ তাকে সাহায্য করেন। কিন্তু অধিকাংশ মানুষ চেষ্টা করে না। জীবিত মানুষের যেসব আমল মৃতদের কাজে লাগে সর্বসম্মত মতে, জীবিত মানুষের পক্ষ থেকে দো\'আ ঈমানদার মৃত মানুষের কাজে লাগে। এখানে রাসূলুল্লাহ সাল্লাল্লাহু \'আলাইহি ওয়াসাল্লাম যা করেছেন তা দো\'আর সমতুল্য। সুতরাং সেটা কাজে লাগবে। কিন্তু অন্য কারো জন্য এ ধরনের গাছ ভেঙ্গে দেয়ার ব্যাপারটি কোথাও বর্ণিত হয়নি। সুতরাং, বর্তমানে কারো জন্য গাছ ভেঙ্গে রোপন করলে সেটা কার্যকরী হবে বলা যায় না। রাসূলুল্লাহ সাল্লাল্লাহু \'আলাইহি ওয়াসাল্লামের উক্ত কাজটি তার সাথে বিশেষভাবে সংশ্লিষ্ট, অন্য কারো সাথে তা কার্যকারী হওয়ার প্রমাণ নেই। কারণ, এ হাদীসেরই অপর বর্ণনায় যা সহীহ মুসলিমে এসেছে, “আমার সুপারিশের কারণে আল্লাহ তাদের শাস্তি গাছের ডালটি শুষ্ক হওয়া পর্যন্ত লাঘব করবেন।” [সহীহ মুসলিম ৩০০৬] ইমাম খাত্তাবী রাহিমাহুল্লাহ বলেন, এটা এর উপর ধরা হবে যে, রাসূলুল্লাহ সাল্লাল্লাহু \'আলাইহি ওয়াসাল্লাম এ দুই কবরবাসীর ‘আযাব লাঘবের জন্য দো\'আ করেছেন; যতক্ষণ তা তরতাজা থাকবে। এটা নয় যে, আযাব বন্ধ করার ব্যাপারে গাছের ডালে এমন কোনো বৈশিষ্ট্য রয়েছে বা কাঁচা ডালে কোনো বৈশিষ্ট্য রয়েছে যা শুকনো ডালে নেই। [আউনুল মাবুদ (১/২৫)] অথচ আফসোসের বিষয় হচ্ছে, অনেক মুসলিমকে দেখা যায় তারা কবরের উপর ফুল দিচ্ছে, যা কখনও জয়েয নেই, প্রথমত: এটাতো নাসারাদের কাজ। দ্বিতীয়ত: যদি এ হাদীস দলীল হয় তবে এ হাদীস তো প্রমাণ করছে যে, এখানে মৃতব্যক্তির আযাব হচ্ছে, তারা যেখানে ফুল দিচ্ছে কিংবা খেজুর ডাল পুঁতে দিচ্ছে তাদের কাছে কি এসব কবরে আযাব হওয়ার বিষয়টির সংবাদ এসেছে? হাদীসের শিক্ষা ১. কবরের আযাব হক্ব ও যথার্থ। ২. আরো বুঝা যায় যে, চোগলখুরী বা একের কথা অন্যের কাছে লাগানো হারাম ও কবীরা গুনাহ। এর মাধ্যমে স্বার্থ হাসিল করা আরো বড় হারাম। ৩. চোগলখুরী ও পেশাব থেকে পবিত্র না হওয়া কবর আযাবের অন্যতম কারণ। ৪. আল্লাহ তা\'আলা কখনও কখনও মানুষের জন্য নবী সাল্লাল্লাহু \'আলাইহি ওয়াসাল্লামের কোনো নিদর্শন প্রকাশ করে দেন; যাতে মানুষ তা থেকে শিক্ষা গ্রহণ করতে পারে। ৫. সালাতের বিষয়টি অত্যধিক মহৎ হওয়া; কারণ এর একটি শর্ত বাস্তবায়ন না হওয়ায় বান্দার ওপর শাস্তি হচ্ছে। যারা সালাত ত্যাগ করে তাদের পরিণতি কত ভয়াবহ হতে পারে তা থেকেই অনুমেয়। ৬. উম্মতের প্রতি নবী সাল্লাল্লাহু \'আলাইহি ওয়াসাল্লামের ভালোবাসা; এমনকি তাদের মধ্যে যারা গুনাহগার তাদের নাজাতের জন্যও রাসূলুল্লাহ সাল্লাল্লাহু \'আলাইহি ওয়াসাল্লাম ঐকান্তিক প্রচেষ্টা চালাতেন। ৭. নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সুপারিশ কখনও কখনও কিছু সময়ের জন্য বা বড় কষ্ট থেকে ছোট কষ্টে নিয়ে যাওয়ার জন্য হতে পারে; কারণ রাসূলুল্লাহ্ সাল্লাল্লাহ "আলাইহি ওয়াসাল্লাম বলেছেন, \'আশা করা যায় যতক্ষণ এ দু\'টি ডাল শুষ্ক না হলে ততক্ষণ তাদের ওপর সে আযাব হালকা করা হবে। ৮. সাহাবায়ে কেরাম সর্বদা রাসুলুল্লাহ সাল্লাল্লাহু \'আলাইহি ওয়াসাল্লামের কাজের কারণ ও হিকমত জানতে সচেষ্ট থাকতেন। এজন্য তারা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে জিজ্ঞেস করলেন, হে আল্লাহর রাসূল আপনি এ কাজটি কেন করলেন? ৯. সাধারণ অপরাধী ও গুনাহগারদের অপমান না করে তাদেরকে গোপন করা জরুরী। কারণ রাসুলুল্লাহ সাল্লাল্লাহু \'আলাইহি ওয়াসাল্লাম এ দু\'জনের নাম বর্ণনা করেননি।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১৫৩।',
        name: '  পেশাব ধোয়া সম্বন্ধে যা বর্ণিত হয়েছে।',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                ' وَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِصَاحِبِ الْقَبْرِ: كَانَ لاَ يَسْتَتِرُ مِنْ بَوْلِهِ». وَلَمْ يَذْكُرْ سِوَى بَوْلِ النَّاسِ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জনৈক কবরবাসী সম্পর্কে বলেছে, সে তার পেশাব থেকে সতর্ক থাকত না। তিনি শুধু মানুষের পেশাব সম্পর্কেই উল্লেখ করেছেন। ২১৭। ইয়া’কুব ইবনু ইবরাহীম (রহঃ) .... আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম প্রাকৃতিক প্রয়োজনে বের হলে আমি তাঁর কাছে পানি নিয়ে যেতাম। তিনি তা দিয়ে ইসতিন্জা করতেন।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১৫৪।',
        name: ' পরিচ্ছেদ নাই। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                '২১৮। মুহাম্মদ ইবনুল মূসান্না (রহঃ) .... ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একবার দু’টি কররের কাছ দিয়ে যাচ্ছিলেন। এ সময় তিনি বললেনঃ এদের আযাব দেওয়া হচ্ছে, কোন কঠিন পাপের জন্য তাদের আযাব হচ্ছে না। তাদের একজন পেশাব থেকে সতর্ক থাকত না। আর অপরজন চোগলখুরী করে বেড়াত। তারপর তিনি একখানি কাঁচা খেজুরের ডাল নিয়ে ভেঙ্গে দু’ভাগ করলেন এবং প্রত্যেক কবরের ওপর একখানি পুঁতে দিলেন। সাহাবায়ে কিরাম (রাঃ) জিজ্ঞাসা করলেন, ‘ইয়া রাসূলাল্লাহ! এরূপ কেন করলেন?’ তিনি বললেনঃ হয়তো তাদের থেকে (আযাব) কিছুটা লাঘব করা হবে, যতদিন পর্যন্ত এ’টি না শুকাবে। ইবনুল মূসান্না (রহঃ)-আ’মাশ (রহঃ) বলেনঃ আমি মুজাহিদ (রহঃ) থেকে অনুরূপ শুনেছি। প্রাসঙ্গিক আলোচনা হাদীসে উল্লিখিত ব্যক্তিদেরকে কবরে আযাব দেওয়ার যে কারণ, তা ত্যাগ করা তাদের ওপর কঠিন ছিল না। বস্তুত কেউ যদি অন্যায় থেকে বাঁচার চেষ্টা করে আল্লাহ তাকে সাহায্য করেন। কিন্তু অধিকাংশ মানুষ চেষ্টা করে না। জীবিত মানুষের যেসব আমল মৃতদের কাজে লাগে সর্বসম্মত মতে, জীবিত মানুষের পক্ষ থেকে দো\'আ ঈমানদার মৃত মানুষের কাজে লাগে। এখানে রাসূলুল্লাহ সাল্লাল্লাহু \'আলাইহি ওয়াসাল্লাম যা করেছেন তা দো\'আর সমতুল্য। সুতরাং সেটা কাজে লাগবে। কিন্তু অন্য কারো জন্য এ ধরনের গাছ ভেঙ্গে দেয়ার ব্যাপারটি কোথাও বর্ণিত হয়নি। সুতরাং, বর্তমানে কারো জন্য গাছ ভেঙ্গে রোপন করলে সেটা কার্যকরী হবে বলা যায় না। রাসূলুল্লাহ সাল্লাল্লাহু \'আলাইহি ওয়াসাল্লামের উক্ত কাজটি তার সাথে বিশেষভাবে সংশ্লিষ্ট, অন্য কারো সাথে তা কার্যকারী হওয়ার প্রমাণ নেই। কারণ, এ হাদীসেরই অপর বর্ণনায় যা সহীহ মুসলিমে এসেছে, “আমার সুপারিশের কারণে আল্লাহ তাদের শাস্তি গাছের ডালটি শুষ্ক হওয়া পর্যন্ত লাঘব করবেন।” [সহীহ মুসলিম ৩০০৬] ইমাম খাত্তাবী রাহিমাহুল্লাহ বলেন, এটা এর উপর ধরা হবে যে, রাসূলুল্লাহ সাল্লাল্লাহু \'আলাইহি ওয়াসাল্লাম এ দুই কবরবাসীর ‘আযাব লাঘবের জন্য দো\'আ করেছেন; যতক্ষণ তা তরতাজা থাকবে। এটা নয় যে, আযাব বন্ধ করার ব্যাপারে গাছের ডালে এমন কোনো বৈশিষ্ট্য রয়েছে বা কাঁচা ডালে কোনো বৈশিষ্ট্য রয়েছে যা শুকনো ডালে নেই। [আউনুল মাবুদ (১/২৫)] অথচ আফসোসের বিষয় হচ্ছে, অনেক মুসলিমকে দেখা যায় তারা কবরের উপর ফুল দিচ্ছে, যা কখনও জয়েয নেই, প্রথমত: এটাতো নাসারাদের কাজ। দ্বিতীয়ত: যদি এ হাদীস দলীল হয় তবে এ হাদীস তো প্রমাণ করছে যে, এখানে মৃতব্যক্তির আযাব হচ্ছে, তারা যেখানে ফুল দিচ্ছে কিংবা খেজুর ডাল পুঁতে দিচ্ছে তাদের কাছে কি এসব কবরে আযাব হওয়ার বিষয়টির সংবাদ এসেছে? হাদীসের শিক্ষা ১. কবরের আযাব হক্ব ও যথার্থ। ২. আরো বুঝা যায় যে, চোগলখুরী বা একের কথা অন্যের কাছে লাগানো হারাম ও কবীরা গুনাহ। এর মাধ্যমে স্বার্থ হাসিল করা আরো বড় হারাম। ৩. চোগলখুরী ও পেশাব থেকে পবিত্র না হওয়া কবর আযাবের অন্যতম কারণ। ৪. আল্লাহ তা\'আলা কখনও কখনও মানুষের জন্য নবী সাল্লাল্লাহু \'আলাইহি ওয়াসাল্লামের কোনো নিদর্শন প্রকাশ করে দেন; যাতে মানুষ তা থেকে শিক্ষা গ্রহণ করতে পারে। ৫. সালাতের বিষয়টি অত্যধিক মহৎ হওয়া; কারণ এর একটি শর্ত বাস্তবায়ন না হওয়ায় বান্দার ওপর শাস্তি হচ্ছে। যারা সালাত ত্যাগ করে তাদের পরিণতি কত ভয়াবহ হতে পারে তা থেকেই অনুমেয়। ৬. উম্মতের প্রতি নবী সাল্লাল্লাহু \'আলাইহি ওয়াসাল্লামের ভালোবাসা; এমনকি তাদের মধ্যে যারা গুনাহগার তাদের নাজাতের জন্যও রাসূলুল্লাহ সাল্লাল্লাহু \'আলাইহি ওয়াসাল্লাম ঐকান্তিক প্রচেষ্টা চালাতেন। ৭. নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সুপারিশ কখনও কখনও কিছু সময়ের জন্য বা বড় কষ্ট থেকে ছোট কষ্টে নিয়ে যাওয়ার জন্য হতে পারে; কারণ রাসূলুল্লাহ্ সাল্লাল্লাহ "আলাইহি ওয়াসাল্লাম বলেছেন, \'আশা করা যায় যতক্ষণ এ দু \'টি ডাল শুষ্ক না হলে ততক্ষণ তাদের ওপর সে আযাব হালকা করা হবে। ৮. সাহাবায়ে কেরাম সর্বদা রাসুলুল্লাহ সাল্লাল্লাহু \'আলাইহি ওয়াসাল্লামের কাজের কারণ ও হিকমত জানতে সচেষ্ট থাকতেন। এজন্য তারা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে জিজ্ঞেস করলেন, হে আল্লাহর রাসূল আপনি এ কাজটি কেন করলেন? ৯. সাধারণ অপরাধী ও গুনাহগারদের অপমান না করে তাদেরকে গোপন করা জরুরী। কারণ রাসুলুল্লাহ সাল্লাল্লাহু \'আলাইহি ওয়াসাল্লাম এ দু\'জনের নাম বর্ণনা করেননি। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১৫৫। ',
        name:
            'এক বেদুঈনকে মসজিদে পেশাব শেষ করা পর্যন্ত নবী (ﷺ) এবং অন্যান্য লোকের পক্ষ থেকে অবকাশ দেওয়া। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ২১৯।',
            name:
                ' মূসা ইবনু ইসমা’ঈল (রহঃ) .... আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক বেদুঈনকে মসজিদে পেশাব করতে দেখলেন। তখন তিনি বললেনঃ ওকে ছেড়ে দাও। সে পেশাব শেষ করলে পানি আনিয়ে সেখানে পানি ঢেলে দিলেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১৫৬।',
        name: ' মসজিদে পেশাবের উপর পানি ঢেলে দেওয়া ',
        hadisNumberList: [
          HadisNumberModel(
            id: '২২০। ',
            name:
                '  আবূল ইয়ামান (রহঃ) .... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ এক বেদুঈন দাঁড়িয়ে মসজিদে পেশাব করে দিল। তখন লোকজন তাকে বাধা দিতে যাচ্ছিল। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের বললেনঃ ওকে ছেড়ে দাও এবং ওর পেশাবের উপর এক বালতি পানি ঢেলে দাও। কারন তোমাদের সহজ ও বিনম্র আচরণ করার জন্য পাঠানো হয়েছে, কঠোর আচরণের জন্য পাঠানো হয়নি।',
            ref: '',
          ),
          HadisNumberModel(
            id: '২২১। ',
            name:
                ' আবদান (রহঃ) ও খালিদ ইবনু মাখলাদ (রহঃ) ... আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ একবার এক বেদুঈন এসে মসজিদের এক কোণে পেশাব করে দিল। তা দেখে লোকজন তাকে ধমকাতে লাগল। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের নিষেধ করলেন। তার পেশাব শেষ হলে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর আদেশে এর উপর এক বালতি পানি ঢেলে দেওয়া হল। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১৫৭। ',
        name: ' শিশুদের পেশাব ',
        hadisNumberList: [
          HadisNumberModel(
            id: '২২২। ',
            name:
                '  আবদুল্লাহ ইবনু ইউসুফ (রহঃ) ... উম্মুল মু’মিনীন আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে একটি শিশুকে আনা হল। শিশুটি তাঁর কাপড়ে পেশাব করে দিল। তিনি পানি আনালেন এবং এর ওপর ঢেলে দিলেন।',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ২২৩। ',
            name:
                'আবদুল্লাহ ইবনু ইউসুফ (রহঃ) .... উম্মু কায়স বিনত মিহসান (রাঃ) থেকে বর্ণিত যে, তিনি তার এক ছোট ছেলেকে, যে তখনো খাবার খেতে শিখেনি, নিয়ে রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এলেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম শিশুটিকে তাঁর কোলে বসালেন। তখন সে তাঁর কাপড়ে পেশাব করে দিল। তিনি পানি আনিয়ে এর উপর ছিটিয়ে দিলেন এবং তা (ভাল করে) ধুইলেন না। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১৫৮।',
        name: '  দাঁড়িয়ে এবং বসে পেশাব করা',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                ' ২২৪। আদম (রহঃ) ... হুযায়ফা (রাঃ) থেকে বর্ণিত, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একবার কওমের আবর্জনা ফেলার স্থানে এলেন। তিনি সেখানে দাঁড়িয়ে পেশাব করলেন। তারপর পানি চাইলেন। আমি তাঁকে পানি নিয়ে দিলাম। তিনি উযূ (ওজু/অজু/অযু) করলেন।* * সাধারণত বসে পেশাব করাই ছিল রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর অভ্যাস। আ জন্যই আয়েশা (রাঃ) বলেন, যে ব্যাক্তি তোমাদের বলবে যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দাঁড়িয়ে পেশাব করেছেন- তার কথা বিশ্বাস করো না। (তিরমিযি, নাসাঈ)। এই একটি মাত্র স্থানেই তাঁর অভ্যাসের ব্যাতিক্রম পাওয়া যায়।এর কারণ সম্পর্কে আবু হুরাইরা (রাঃ) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কোমর ব্যাথার কারণে দাঁড়িয়ে পেশাব করেছেন। (বায়হাকি, হাকেম )।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১৫৯। ',
        name: '  সঙ্গীর কাছে বসে পেশাব করা এবং দেয়ালের আড়ালে করা',
        hadisNumberList: [
          HadisNumberModel(
            id: '২২৫। ',
            name:
                '  উসমান ইবনু আবূ শায়বা (রহঃ) .... হুযায়ফা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমার স্মরণ আছে যে, একবার আমিও নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক সাথে চলছিলাম। তিনি দেয়ালের পেছনে মহল্লার একটি আবর্জনা ফেলার জায়গায় এলেন। তারপর তোমাদের কেউ যেভাবে দাঁড়ায় সেভাবে দাঁড়িয়ে তিনি পেশাব করলেন। এ সময় আমি তাঁর কাছ থেকে সরে যাচ্ছিলাম কিন্তু তিনি আমাকে ইশারা করলেন। আমি এসে তাঁর পেশাব করা শেষ না হওয়া পর্যন্ত তাঁর পিছনে দাঁড়িয়ে থাকলাম।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১৬০। ',
        name: '  মহল্লার আবর্জনা ফেলার স্থানে পেশাব করা',
        hadisNumberList: [
          HadisNumberModel(
            id: '২২৬। ',
            name:
                ' মুহাম্মদ ইবনু ‘আর ‘আরা (রহঃ) .... আবূ ওয়াইল (রহঃ) থেকে বর্ণিত, তিনি বলেনঃ আবূ মূসা (রাঃ) পেশাবের ব্যাপারে খুব কড়াকড়ি করতেন এবং বলতেনঃ বনী ইসরাঈলের কারো কাপড়ে (পেশাব) লাগলে তা কেটে ফেলত। হুযায়ফা (রাঃ) বললেন, আবূ মূসা (রাঃ) যদি এ থেকে বিরত থাকতেন (তবে ভাল হত)। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মহল্লার আবর্জনা ফেলার স্থানে দাঁড়িয়ে পেশাব করেছেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১৬১।  ',
        name: 'রক্ত দুয়ে ফেলা। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ২২৭।',
            name:
                '  মুহাম্মদ ইবনুল মূসান্না (রহঃ) ..... আসমা (রাঃ) থেকে বর্ণিত, তিনি বলেন, এক মহিলা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এসে বললেনঃ ইয়া রাসূলাল্লাহ! বলুন, আমাদের কারো কাপড়ে হায়েযের রক্ত লেগে গেলে সে কি করবে? তিনি বললেনঃ সে তা ঘষে ফেলবে, তারপর পানি দিয়ে রগড়াবে এবং ভাল করে ধুয়ে ফেলবে। এরপর সেই কাপড়ে সালাত (নামায/নামাজ) আদায় করবে।',
            ref: '',
          ),
          HadisNumberModel(
            id: '২২৮।  ',
            name:
                'মুহাম্মদ (রহঃ) .... আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ ফাতিমা বিনত আবূ হুবায়শ (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এসে বললেন ইয়া রাসূলাল্লাহ! আমার এত বেশি রক্তস্রাব হয় যে, আর পবিত্র হই না। এমতাবস্থায় আমি কি সালাত (নামায/নামাজ) ছেড়ে দেব? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ না, এ তো ধমনি নির্গত রক্ত, হায়েয় নয়। তাই যখন তোমার হায়েয আসবে তখন সালাত ছেড়ে দিও। আর যখন তা বন্ধ হবে তখন রক্ত ধুয়ে ফেলবে, তারপর সালাত আদায় করবে। বর্ণনাকারী বলেন, আমার পিতা বলেছেনঃ তারপর এভাবে আরেক হায়েয না আসা পর্যন্ত প্রত্যেক সালাতের জন্য উযূ (ওজু/অজু/অযু) করবে। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১৬২।',
        name:
            '  বীর্য ধোয়া এবং ঘষে ফেলা এবং স্ত্রীলোক থেকে যা লেগে যায় তা ধুয়ে ফেলা',
        hadisNumberList: [
          HadisNumberModel(
            id: '২২৯। ',
            name:
                ' আবদান (রহঃ) .... ‘আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাপড় থেকে জানবাতের চিহ্ন ধুয়ে দিতাম এবং কাপড়ে ভিজা চিহ্ন নিয়ে তিনি সালাতে (নামাযে) বের হতেন। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '২৩০।  ',
            name:
                ' কুতয়বা ও মূসা’দ্দাদ (রহঃ) .... সুলায়মান ইবনু ইয়াসর (রহঃ) থেকে বর্ণিত, আমি ‘আয়িশা (রাঃ)-কে কাপড়ে লাগা বীর্য সম্পর্কে জিজ্ঞাসা করলাম। তিনি বললেনঃ আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাপড় থেকে তা ধুয়ে ফেলতাম। তিনি কাপড় ধোয়ার ভিজা দাগ নিয়ে সালাতে (নামাযে) বের হতেন।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১৬৩। ',
        name: ' জানাবাতের নাপাকী বা অন্য কিছু ধোয়ার পর যদি ভিজা দাগ থেকে যায় ',
        hadisNumberList: [
          HadisNumberModel(
            id: '২৩১। ',
            name:
                ' মূসা ইবনু ইসমা’ঈল (রহঃ) ...... আমর ইবনু মায়মুন (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ কাপড়ে জানবাতের নাপাকী লাগা সম্পর্কে আমি সুলায়মান ইবনু ইয়াসার (রহঃ)-কে জিজ্ঞাসা করলে তিনি বললেনঃ ‘আয়িশা (রাঃ) বলেছেনঃ আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাপড় থেকে তা ধুয়ে ফেলতাম। এরপর তিনি সালাতে (নামাযে) বেরিয়ে যেতেন আর তাতে পানি দিয়ে ধোয়ার চিহ্ন থাকত। ',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ২৩২।',
            name:
                ' আমর ইবনু খালিদ (রহঃ) ... আয়িশা (রাঃ) থেকে বর্ণিত, তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাপড় থেকে বীর্য ধুয়ে ফেলতেন। আয়িশা (রাঃ) বলেনঃ তারপর আমি তাতে পানির একটি বা কয়েকটি দাগ দেখতে পেতাম। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১৬৪।  ',
        name: ' উট, চতুস্পদ জন্তু ও বকরীর পেশাব এবং বকরীর খায়াড় প্রসঙ্গে',
        hadisNumberList: [
          HadisNumberModel(
            id: '২৩৩। ',
            name:
                '  সুলায়মান ইবনু হারব (রহঃ) ... আনাস (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ উকল বা উরায়না গোত্রের কিছু লোক (ইসলাম গ্রহণের জন্য) মদিনায় এলে তারা পীড়িত হয়ে পড়ল। রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের (সদকার) উটের কাছে যাবার এবং ওর পেশাব ও দুধ পান করার নির্দেশ দিলেন। তারা সেখানে চলে গেল। তারপর তারা সুস্থ হয়ে রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর রাখালকে হত্যা করে ফেলল এবং উটগুলি হাঁকিয়ে নিয়ে গেল। এ খবর দিনের প্রথম ভাগেই এসে পৌঁছল। তিনি তাদের পেছনে লোক পাঠালেন। বেলা বেড়ে উঠলে তাদেরকে (গ্রেফতার করে) আনা হল। তারপর তাঁর আদেশে তাদের হাত পা কেটে দেওয়া হল। উত্তপ্ত শলাকা দিয়ে তাদের চোখ ফুঁড়ে দেওয়া হল এবং গরম পাথুরে ভূমিতে তাদের নিক্ষেপ করা হল। তারা পানি চাইছিল, কিন্তু দেওয়া হয়নি। আবূ কিলাবা (রহঃ) বলেন, এরা চুরি করেছিল, হত্যা করেছিল, ঈমান আনার পর কুফরী করেছিল এবং আল্লাহ্ ও তার রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর বিরুদ্ধে যুদ্ধ করেছিল।',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ২৩৪। ',
            name:
                'আদম (রহঃ .... আনাস (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মসজিদ নির্মিত হবার পূর্বে বকরীর খোয়াড়ে সালাত (নামায/নামাজ) আদায় করতেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১৬৫।',
        name: '  ঘি এবং পানিতে নাপাকী পড়া।',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'وَقَالَ الزُّهْرِيُّ لاَ بَأْسَ بِالْمَاءِ مَا لَمْ يُغَيِّرْهُ طَعْمٌ أَوْ رِيحٌ أَوْ لَوْنٌ. وَقَالَ حَمَّادٌ لاَ بَأْسَ بِرِيشِ الْمَيْتَةِ. وَقَالَ الزُّهْرِيُّ فِي عِظَامِ الْمَوْتَى نَحْوَ الْفِيلِ وَغَيْرِهِ أَدْرَكْتُ نَاسًا مِنْ سَلَفِ الْعُلَمَاءِ يَمْتَشِطُونَ بِهَا، وَيَدَّهِنُونَ فِيهَا، لاَ يَرَوْنَ بِهِ بَأْسًا. وَقَالَ ابْنُ سِيرِينَ وَإِبْرَاهِيمُ وَلاَ بَأْسَ بِتِجَارَةِ الْعَاجِ যুহরী (রহঃ) বলেনঃ পানিতে নাপাকী পড়লে কোন ক্ষতি নেই, যতক্ষন তার স্বাদ, গন্ধ বা রং পরিবর্তন না হয়। হাম্মদ (রহঃ) বলেনঃ মৃত (পাখীর) পালক (পানিতে পড়লে) কোন দোষ নেই। যুহরী (রহঃ) মৃত জন্তু, যথাঃ হাতী প্রভৃতির হাড় সম্পর্কে বলেনঃ আমি পূর্ববর্তী উলামায়ে কিরামের মধ্যে কিছু আলিমকে পেয়েছি, তাঁরা তা দিয়ে (চিরুণী বানিয়ে) চুল আঁচড়াতেন এবং তার পাত্রে তেল রেখে ব্যবহার করতেন, এতে তাঁরা কোনরূপ দোষ মনে করতেন না। ইবন সীরীন (রহঃ) ও ইবরাহীম (রহঃ) বলেনঃ হাতীর দাঁতের ব্যবসায়ে কোন দোষ নেই। ২৩৫। ইসমা‘ঈল (রহঃ) .... মায়মূনা (রাঃ) থেকে বর্ণিত, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে ‘ঘি’র মধ্যে ইঁদুর পড়া সম্পর্কে জিজ্ঞাসা করা হল। তিনি বললেনঃ ইঁদুরটি এবং তার আশপাশ থেকে ফেলে দাও এবং তোমাদের ঘি ব্যবহার কর।',
            ref: '',
          ),
          HadisNumberModel(
            id: '২৩৬। ',
            name:
                ' আলী ইবনু ‘আবদুল্লাহ (রহঃ) .... মায়মূনা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে ‘ঘি’র মধ্যে ইঁদুর পড়ে যাওয়া সম্পর্কে জিজ্ঞাসা করা হল। তিনি বললেনঃ ইঁদুরটি এবং তার আশপাশ থেকে ফেলে দাও। মা’ন (রহঃ) বলেন, মালিক (রহঃ) আমার কাছে বহুবার এভাবে বর্ণনা করেছেনঃ ইবনু ‘আব্বাস (রাঃ) থেকে এবং ইবনু ‘আব্বাস (রাঃ) মায়মূনা (রাঃ) থেকেও। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '২৩৭। ',
            name:
                ' আহমদ ইবনু মুহাম্মদ (রহঃ) ... আবূ হুরায়রা (রাঃ) রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণনা করেন, তিনি বলেনঃ আল্লাহর রাস্তায় মুসলিমদের যে যখম হয়, কিয়ামতের দিন তার প্রতিটি যখম আঘাতকালীন সময়ে যে অবস্থায় ছিল তদ্রুপ হবে। রক্ত ছুটে বের হতে থাকবে। তার রং হবে রক্তের রং কিন্তু গন্ধ হবে মিশকের ন্যায়। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১৬৬।',
        name: ' স্থির পানিতে পেশাব করা ',
        hadisNumberList: [
          HadisNumberModel(
            id: '২৩৮।  ',
            name:
                'আবূল ইয়ামান (রহঃ) ... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছেন যে, আমরা শেষে আগমনকারী এবং (কিয়ামত দিবসে) অগ্রগামী। এ সনদেই তিনি বলেনঃ তোমাদের কেউ যেন স্থির- যা প্রবাহিত নয় এমন পানিতে কখনো পেশাব না করে। (সম্ভবত) পরে সে আবার তাতে গোসল করবে। প্রাসঙ্গিক আলোচনা পানি ও তার প্রকারভেদ যা প্রবাহমান নয় এমন পানি হলো, টাঙ্কির পানি, ছোট জলাধারের পানি ইত্যাদি। রাসূলুল্লাহ সাল্লাল্লাহু \'আলাইহি ওয়াসাল্লাম এগুলোতে ময়লা ফেলতে নিষেধ করেছেন যাতে করে তা দূষিত হয়ে না পড়ে। কারণ, এর মাধ্যমে ভাইরাস ছড়িয়ে পড়তে পারে। মারাত্মক রোগ ব্যাধির প্রাদুর্ভাব ঘটতে পারে। মানুষের মধ্যে এ জাতীয় পানি ব্যবহারে ঘৃণার জন্ম হতে পারে। পানি বিশুদ্ধ ও পরিচ্ছন্ন রাখা, নষ্ট ও দূষিত না করা ঈমানের দাবি। পানি তিন প্রকার ১. পবিত্র পানিঃ আর তা হলো পানি তার সৃষ্টিগত স্বাভাবিক অবস্থায় বিদ্যমান থাকা। আর তা হলো- যে পানি দ্বারা অপবিত্রতা ও শরীরের পবিত্র অঙ্গের আপতিত নাজাসাত দূর করা হয়েছে। আল্লাহ তাআলা বলেছেন, “এবং আকাশ থেকে তোমাদের উপর বৃষ্টি বর্ষণ করেন, আর যাতে এর মাধ্যমে তিনি তোমাদেরকে পবিত্র করেন।” [সূরা আল ১১] ২. পবিত্র পানিঃ যে পানি নাজাসাত ছাড়াই রঙ বা স্বাদ বা গন্ধ পরিবর্তন হয়ে গেছে। এ ধরনের পানি নিজে পবিত্র; তবে এর যে কোনো একটি গুণ পরিবর্তন হওয়ার কারণে এর দ্বারা অপবিত্রতা দূর করা যাবে না। ৩. অপবিত্র পানি: যে পানি অল্প বা বেশি নাজাসাতের কারণে এর ৩টি গুণের যেকোনো একটি গুণ পরিবর্তন হয়ে গেছে। অপবিত্র পানি পবিত্র হয়ে যাবে, তার পরিবর্তনের কারণ নিজে নিজে দূর হলে বা উক্ত পানি শুকিয়ে ফেললে অথবা এর সাথে এতটুকু পরিমাণ পানি মিশানো; যাতে পরিবর্তনের কারণ দূরীভূত হয়ে যায়। যখন কোনো মুসলিম পানির অপবিত্রতা বা পবিত্রতার ব্যাপারে সন্দেহ পোষণ করবে তখন সে তার নিশ্চিত ধারণার ওপর ভিত্তি করে পবিত্রতা অর্জন করবে। আর তা হলো, পবিত্র বস্তুসমূহের আসল হচ্ছে পবিত্র থাকা। যখন কোনো পানি, যা দ্বারা পবিত্রতা অর্জন করা যায় আর যা দ্বারা পবিত্রতা অর্জন করা যায় না এমন কোন পানির সাথে সন্দেহে নিপতিত করবে তখন তা বাদ দিয়ে তায়াম্মুম করবে। যখন কোনো পবিত্র কাপড়, অপবিত্র বা হারাম কাপড়ের সাথে একাকার হওয়ার কারণে সন্দেহে নিপতিত করবে, তখন ইয়াকীনের ওপর ভিত্তি করবে এবং সে কাপড় দ্বারা কেবল একটি সালাত আদায় করবে। হাদিস থেকে শিক্ষা ১. বদ্ধ পানিতে পেশাব করা হারাম, পায়খানা করা আরো বড় হারাম। ২. এ নিষেধাজ্ঞা দ্বারা কি হারাম বুঝানো হয়েছে নাকি মাকরূহে তাহরীমী বুঝানো হয়েছে এ ব্যাপারে দু\'টি মত রয়েছে: মালেকীরা বলেন, তা মাকরূহ, আর হাম্বলী ও যাহেরীরা বলেন, তা হারাম বুঝাবে। কোনো কোনো আলেম বলেন, অল্প পানির জন্য তা হারাম, আর বেশি পানির জন্য তা মাকরূহ। তবে হারাম হওয়াই অধিক যুক্তিযুক্ত। ৩. যদি পানিতে পেশাব করা হয় তবে তা কি নাপাক হয়ে যাবে? এ ব্যাপারে সবাই একমত যে, যদি পেশাব দ্বারা সে পানি পরিবর্তিত হয়ে যায় তবে তা অপবিত্র হয়ে যাবে। পানি কম হোক কিংবা বেশি। আর যদি পানি এত বেশি হয় যে, তাতে পেশাব তেমন পরিবর্তন করতে পারেনি, তবে সকলের ঐকমত্যে তা পবিত্র। কিন্তু যদি অল্প পানি থাকে আর তা পেশাব বা পায়খানা দ্বারা পরিবর্তন না করে থাকে, তবে এ ব্যাপারে দু\'টি মত রয়েছে- ইমাম মালিক, বুখারী ও দাউদ এর মতে তা পবিত্র থেকে যাবে। অন্য দিকে ইমাম আবু হানীফা, শাফোয়ী, আহমাদের মতে তা অপবিত্র হয়ে যাবে। যদিও ইমাম মালিকের মতটি অনেক সত্যনিষ্ঠ আলেম, যেমন শাইখুল ইসলাম ইবন তাইমিয়্যাহ প্রমুখের মতে বেশি শক্তিশালী। ৪. এ হাদীস থেকে আরো বুঝা যায় যে, অপবিত্র অবস্থা থেকে মুক্ত হওয়ার জন্য বদ্ধ পানি অর্থাৎ টাঙ্কি বা পানির ছোট হাউজে ডুব দিয়ে গোসল করা একেবারেই নিষেধ; যদিও তাতে পেশাব না করা হয়। নিয়ম হচ্ছে সেখান থেকে হাত বা কোনো কিছু দিয়ে পানি নিয়ে পবিত্র হওয়া। ৫. সর্বাবস্থায় কষ্টদায়ক যাবতীয় কাজ ও সীমালঙ্ঘনকারী কোনো কিছু করা নিষেধ হওয়া। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১৬৭।  ',
        name:
            ' মুসল্লীর পিঠের উপর ময়লা বা মৃত জন্তু ফেললে তার সালাত নষ্ট হবে না।',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'ইবন উমর (রাঃ) সালাত আদায়ের অবস্থায় তাঁর কাপড়ে রক্ত দেখলে (সেভাবেই) তা রেখে দিতেন এবং সালাত আদায় করে নিতেন। ইবনুল মুসায়্যাব ও শা’বী (রহঃ) বলেন, যখন কেউ সালাত আদায় করে আর তার কাপড়ে রক্ত অথবা জানাবাতের নাপাকী থাকে অথবা সে কিবলা ছাড়া অন্যদিকে মুখ করে অথবা তায়াম্মুম করে সালাত আদায় করে এরপর ওয়াক্তের মধ্যেই যদি পানি পেয়ে যায় তবে (সালাত) দুহরাবে না। ২৩৯। আবদান (রহঃ) ..... আবদুল্লাহ ইবনু মাস’উদ (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ একবার রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সিজদারত অবস্থায় ছিলেন। অন্য সূত্রে আহমদ ইবনু ‘উসমান (রহঃ) ‘আবদুল্লাহ ইবনু মাস্’উদ (রাঃ) বর্ণনা করেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একবার বায়তুল্লাহর পাশে সালাত (নামায/নামাজ) আদায় করছিলেন এবং সেখানে আবূ জাহল ও তার সঙ্গীরা বসা ছিল। এমন সময় তাদের একজন অন্যজনকে বলে উঠল, তোমাদের মধ্যে কে অমুক গোত্রের উটনীর নাড়ীভুঁড়ি এনে মুহাম্মদ যখন সিজদা করেন তখন তার পিঠের উপর রাখতে পারে? তখন কওমের বড় পাষন্ড (উকবা) তাড়াতাড়ি গিয়ে তা নিয়ে এল এবং তাঁর প্রতি নজর রাখল। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন সিজদায় গেলেন, তখন সে তাঁর পিঠের উপর দুই কাঁধের মাঝখানে তা রেখে দিল। ইবনু মাস’উদ (রাঃ) বলেন, আমি (এ দৃশ্য) দেখেছিলাম কিন্তু আমার কিছু করার ছিল না। হায়! আমার যদি কিছু প্রতিরোধ শক্তি থাকত! তিনি বলেন, তারা হাসতে লাগল এবং একে অন্যের উপর লুটিয়ে পড়তে লাগল। আর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তখন সিজদায় থাকলেন, মাথা উঠালেন না। অবশেষে ফাতিমা (রাঃ) এলেন এবং সেটি তাঁর পিঠের উপর থেকে ফেলে দিলেন। তারপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মাথা উঠিয়ে বললেনঃ ইয়া আল্লাহ্! আপনি কুরায়শকে ধ্বংস করুন। এরূপ তিনবার বললেন। তিনি যখন তাদের বদ দু’আ করেন তখন তা তাদের অন্তরে ভীতির সঞ্চার করল। বর্ণনাকারী বলেন, তারা জনত যে, এ শহরে দু’আ কবূল হয়। এরপর তিনি নাম ধরে বললেনঃ ইয়া আল্লাহ্! আবূ জাহলকে ধ্বংস করুন। এবং ‘উতবা ইবনু রাবী’আ, শায়বা ইবনু রবী’আ, ওয়ালীদ ইবনু ‘উতবা, উময়্যা ইবনু খালাফ ও ‘উকবা ইবনু মু’আইতকে ধ্বংস করুন। রাবী বলেন, তিনি সপ্তম ব্যাক্তির নামও বলেছিলেন কিন্তু তিনি স্মরণ রাখতে পারেন নি। ইবনু মাস’উদ (রাঃ) বলেনঃ সেই সত্তার কসম! যার হাতে আমার জান, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যাদের নাম উচ্চারণ করেছিলেন, তাদের আমি বদরের কূপের মধ্যে নিহত অবস্থায় পড়ে থাকতে দেখেছি। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১৬৮।',
        name: '  থুথু, শ্লেষ্মা ইত্যাদি কাপড়ে লেগে গেলে।',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'قَالَ عُرْوَةُ عَنِ الْمِسْوَرِ وَمَرْوَانَ خَرَجَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَمَنَ حُدَيْبِيَةَ فَذَكَرَ الْحَدِيثَ. وَمَا تَنَخَّمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نُخَامَةً إِلاَّ وَقَعَتْ فِي كَفِّ رَجُلٍ مِنْهُمْ فَدَلَكَ بِهَا وَجْهَهُ وَجِلْدَهُ উরওয়া (রহঃ) মিসওয়ার ও মাওয়ান (রহঃ) থেকে বর্ণনা করেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হুদায়বিয়ার সময় বের হলেন। তারপর পূর্ণ হাদীস বর্ণনা করার পর তিনি বলেন, আর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (সেদিন) যখনই কোন শ্লেষ্মা ঝেড়ে ফেলছিলেন, তখন তা কারো না কারো হাতে পড়ছিল। তারপর (বরকতস্বরূপ) ঐ ব্যক্তি তা তার মুখমন্ডল ও শরীরে মেখে নিচ্ছিল। ২৪০। মুহাম্মদ ইবনু ইউসুফ (রহঃ) ... আনাস (রাঃ) থেকে বর্ণিত, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একবার তাঁর কাপড়ে থুথু ফেললেন। ইমাম বুখারী (রহঃ) বলেন যে, ইবনু মারয়াম এই হাদীসটি বিস্তারিতরূপে বর্ণনা করেছেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১৬৯।',
        name:
            ' নাবীয (খেজুর, কিসমিস, মনাক্কা ইত্যাদি ভিজানো পানি) এবং নেশাকারক পানীয় দ্বারা উযূ করা না-জায়েয।  ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'كَرِهَهُ الْحَسَنُ وَأَبُو الْعَالِيَةِ. وَقَالَ عَطَاءٌ التَّيَمُّمُ أَحَبُّ إِلَيَّ مِنَ الْوُضُوءِ بِالنَّبِيذِ وَاللَّبَنِ হাসান (রহঃ) ও আবুল ‘আলিয়া (রহঃ) একে মাকরূহ বলেছেন। আতা (রহঃ) বলেনঃ নবীয এবং দুধ দিয়ে উযূ করার চাইতে তায়াম্মুম করাই আমার কাছে পছন্দনীয়। ২৪১। আলী ইবনু ‘আবদুল্লাহ (রহঃ) .... ‘আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে সকল পানীয় নেশা সৃষ্টি করে, তা হারাম। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১৭০। ',
        name: '  পিতার মুখমন্ডল থেকে কন্যা কর্তৃক রক্ত ধুয়ে ফেলা।',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'وَقَالَ أَبُو الْعَالِيَةِ امْسَحُوا عَلَى رِجْلِي فَإِنَّهَا مَرِيضَةٌ আবুল আলিয়া (রহঃ) বলেনঃ আমার পায়ে ব্যাথা, তোমরা আমার পা মসেহ করে দাও। ২৪২। মুহাম্মদ (রহঃ) .... আবূ হাযিম (রহঃ) বলেন, যখন আমার এবং সাহল ইবনু সা’দ আস-সা’ইদী (রাঃ)-এর মাঝখানে কেউ ছিল না, তখন লোকে প্রশ্ন করলঃ (উহুদ যুদ্ধে) কী দিয়ে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর যখমের চিকিৎসা করা হয়েছিল? তখন তিনি বললেনঃ এ ব্যাপারে আমার চেয়ে ভাল একজন জানে এমন কেউ জীবিত নেই। ‘আলী (রাঃ) তাঁর ঢালে করে পানি আনছিলেন আর ফাতিমা (রাঃ) তাঁর মুখমন্ডল থেকে রক্ত ধুইয়ে দিলেন। অবশেষে চাটাই পুড়িয়ে (তার ছাই) তাঁর ক্ষতস্থানে দেওয়া হল। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১৭১।',
        name: '  মিসওয়াক করা।',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'وَقَالَ ابْنُ عَبَّاسٍ بِتُّ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاسْتَنَّ ইবন আব্বাস (রাঃ) বলেনঃ আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের কাছে রাত কাটিয়েছিলাম। তখন তিনি মিসওয়াক করলেন। ২৪৩। আবূ’ন-নু’মান (রহঃ) .... আবূ বুরদা (রহঃ)-এর পিতা [আবূ মূসা (রাঃ)] থেকে বর্ণিত, তিনি বলেনঃ একবার আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এলাম। তখন তাঁকে দেখলাম তিনি মিসওয়াক করছেন এবং মিসওয়াক মুখে দিয়ে তিনি উ’, উ’, শব্দ করছেন যেন তিনি বমি করছেন। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '২৪৪। ',
            name:
                ' উসমান ইবনু আবূ শায়বা (রহঃ) ... হুযায়ফা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন রাতে (সালাত (নামায/নামাজ)-এর জন্য) উঠতেন তখন মিসওয়াক দিয়ে মুখ পরিষ্কার করতেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১৭৩। ',
        name: '  উযূ সহ রাতে ঘুমাবার ফযীলত',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                ' وَقَالَ عَفَّانُ حَدَّثَنَا صَخْرُ بْنُ جُوَيْرِيَةَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ "‏ أَرَانِي أَتَسَوَّكُ بِسِوَاكٍ، فَجَاءَنِي رَجُلاَنِ أَحَدُهُمَا أَكْبَرُ مِنَ الآخَرِ، فَنَاوَلْتُ السِّوَاكَ الأَصْغَرَ مِنْهُمَا، فَقِيلَ لِي كَبِّرْ‏.‏ فَدَفَعْتُهُ إِلَى الأَكْبَرِ مِنْهُمَا ‏"‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ اخْتَصَرَهُ نُعَيْمٌ عَنِ ابْنِ الْمُبَارَكِ عَنْ أُسَامَةَ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ পরিচ্ছেদঃ ১৭২. বয়সে বড় ব্যক্তিকে মিসওয়াক প্রদান করা ‘আফফান (রহঃ) .... ইবন ‘উমর (রাঃ) থেকে বর্ণনা করেন যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আমি (স্বপ্নে) দেখলাম যে, আমি মিসওযাক করছি। আমার কাছে দুই ব্যক্তি এলেন। একজন অপরজন থেকে বয়সে বড়। তারপর আমি তাদের মধ্যে কনিষ্ঠ ব্যক্তিকে মিসওয়াক দিতে গেলাম। তখন আমাকে বলা হল, ‘বড়কে দাও। তখন আমি তাদের মধ্যে বয়সে বড় ব্যক্তিকে দিলাম। আবূ আবদুল্লাহ্ বলেন, নু’আয়ম, ইবনুল মুবারক সূত্রে ইবন ‘উমর (রাঃ) থেকে হাদীসটি সংক্ষেপে বর্ণনা করেছেন। ২৪৫। মুহাম্মদ ইবনু মুকতিল (রহঃ) .... বারা ইবনু ‘আযিব (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যখন তুমি বিছানায় যাবে তখন সালাত (নামায/নামাজ)-এর উযূর মতো উযূ (ওজু/অজু/অযু) করে নেবে। তারপর ডান পার্শ্বে শুয়ে বলবেঃ اللَّهُمَّ أَسْلَمْتُ وَجْهِي إِلَيْكَ وَفَوَّضْتُ أَمْرِي إِلَيْكَ وَأَلْجَأْتُ ظَهْرِي إِلَيْكَ رَغْبَةً وَرَهْبَةً إِلَيْكَ لاَ مَلْجَأَ وَلاَ مَنْجَا مِنْكَ إِلاَّ إِلَيْكَ اللَّهُمَّ آمَنْتُ بِكِتَابِكَ الَّذِي أَنْزَلْتَ “হে আল্লাহ্! আমার জীবন আপনার কাছে সমর্পণ করলাম। আমার সকল কাজ আপনার কাছে সোপর্দ করলাম এবং আমি আপনার আশ্রয় গ্রহণ করলাম, আপনার প্রতি আগ্রহ ও ভয় নিয়ে। আপনি ছাড়া কোন আশ্রয়স্থল ও নাজাতের স্থান নেই। হে আল্লাহ্! আমি ঈমান আনলাম আপনার নাযিলকৃত কিতাবের উপর এবং আপনার প্রেরিত নবীর উপর।” তারপর যদি সে রাতেই তোমার মৃত্যু হয় তবে ফিতরাতে ইসলামের উপর তোমার মৃত্যু হবে। এ কথাগুলি তোমার শেষ কথা বনিয়ে নাও। তিনি বললেন, ‘আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে এ কথাগুলি পুনরায় শোনালাম। যখন اللَّهُمَّ آمَنْتُ بِكِتَابِكَ الَّذِي أَنْزَلْتَ পর্যন্ত পৌঁছে وَرَسُولِكَ বললাম, তখন তিনি বললেনঃ না; বরং وَنَبِيِّكَ الَّذِي أَرْسَلْتَ বল।',
            ref: '',
          ),
        ]),
  ];
  List<PorichedModel> chapterFive = [
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১৭৪। ',
        name: ' গোসলের পূর্বে উযূ করা',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                ' এ প্রসঙ্গে আল্লাহ্‌ তা’আলার বাণীঃ “যদি তোমরা অপবিত্র থাক তবে বিশেষভাবে পবিত্র হবে। তোমরা যদি পীড়িত হও বা সফরে থাক বা তোমাদের কেউ শৌচগার থেকে আসে অথবা তোমরা স্ত্রীর সাথে সংগত হও এবং পানি না পাও তবে পবিত্র মাটি দিয়ে তায়াম্মুম করবে এবং তা তোমাদের মুখে ও হাতে বুলাবে। আল্লাহ্‌ তোমাদের কষ্ট দিতে চান না; বরং তিনি তোমাদের পবিত্র করতে চান যাতে তোমরা শোকর আদায় কর।” (৫ : ৬) এবং আল্লাহ্‌র বাণীঃ “হে মু’মিনগণ! তোমরা নেশাগ্রস্ত অবস্থায় সালাতের ধারেও যেয়োনা, যতক্ষন না তোমরা যা বল তা বুঝতে পার, আর যদি তোমরা পথবাহী না হও তবে অপবিত্র অবস্থায়ও না, যতক্ষন না তোমরা গোসল কর। আর তোমরা যদি পীড়িত হও অথবা সফরে থাক অথবা তোমাদের কেউ যদি শৌচাগার থেকে আসে অথবা স্ত্রীসংগম করে, আর পানি না পায়, তাহলে পবিত্র মাটি দিয়ে তায়াম্মুম কর, এবং তা মুখ ও হাতে বুলাবে। আল্লাহ্‌ পাপ মোচনকারী ও ক্ষমাশীল। (৪ : ৪৩) ২৪৬। আবদুল্লাহ ইবনু ইউসুফ (রহঃ) .... ‘আয়িশা (রাঃ) থেকে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন জানবাতের গোসল করতেন, তখন প্রথমে তাঁর হাত দু’টো ধুয়ে নিতেন। তারপর সালাত (নামায/নামাজ)-এর উযূর মত উযূ (ওজু/অজু/অযু) করতেন। তারপর তাঁর আঙ্গুলগুলো পানিতে ডুবিয়ে নিয়ে চুলের গোড়া খিলাল করতেন। তারপর তাঁর উভয় হাতের তিন আঁজলা পানি মাথায় ঢালতেন। তারপর তাঁর সারা দেহের উপর পানি পৌঁছিয়ে দিতেন।',
            ref: '',
          ),
          HadisNumberModel(
            id: '২৪৭।  ',
            name:
                ' মুহাম্মদ ইবনু ইউসুফ (রহঃ) ..... মায়মুনা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সালাতের উযূর ন্যায় উযূ (ওজু/অজু/অযু) করলেন, অবশ্য পা দুটো ছাড়া এবং তাঁর লজ্জাস্থান ও যে যে স্থানে নাপাক লেগেছে তা ধুয়ে নিলেন। তারপর নিজের উপর পানি ঢেলে দেন। তারপর সেখান থেকে সরে গিয়ে পা দুটো ধুয়ে নেন। এই ছিল তাঁর জানবাতের গোসল।',
            ref: '',
          )
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১৭৫। ',
        name: 'স্বামী-স্ত্রীর একসাথে গোসল ',
        hadisNumberList: [
          HadisNumberModel(
            id: '২৪৮।  ',
            name:
                'আদম ইবনু আবূ ইয়াস (রহঃ) ... আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি ও নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একই পাত্রে (কাদাহ) থেকে (পানি নিয়ে) গোসল করতাম। সেই পাত্রকে ফারাক বলা হতো। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১৭৬। ',
        name: '  এক সা’ বা অনুরূপ পাত্রের পানিতে গোসল',
        hadisNumberList: [
          HadisNumberModel(
            id: '২৪৯। ',
            name:
                ' আবদুল্লাহ ইবনু মুহাম্মদ (রহঃ) .... আবূ সালামা (রহঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি ও ‘আয়িশা (রাঃ)-এর ভাই ‘আয়িশা (রাঃ)-এর নিকট গেলাম। তাঁর ভাই তাঁকে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর গোসল সম্পর্কে জিজ্ঞাসা করলেন। তিনি প্রায় এক সা’ (তিন কেজির চেয়ে কিছু পরিমাণ বেশি)-এর সমপরিমান এক পাত্র আনালেন। তারপর তিনি গোসল করলেন এবং নিজের মাথার উপর পানি ঢাললেন। তখন আমাদের ও তাঁর মাঝে পর্দা ছিল। আবূ ‘আবদুল্লাহ [ইমাম বুখারী (রহঃ)] বলেন যে, ইয়াযীদ ইবনু হারূন (রহঃ), বাহয ও জুদ্দী (রহঃ) শু’বা (রহঃ) থেকে نَحْوًا مِنْ صَاعٍ এর পরিবর্তে قَدْرِ صَاعٍ (এক সা’ পরিমাণ)-এর কথা বর্ণনা করেন। ',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ২৫০।',
            name:
                ' আবদুল্লাহ ইবনু মুহাম্মদ (রহঃ) ... আবূ জা’ফর (রহঃ) থেকে বর্ণনা করেন যে, তিনি ও তাঁর পিতা জাবির ইবনু আবদুল্লাহ (রাঃ)-এর কাছে ছিলেন। সেখানে আরো কিছু লোক ছিলেন। তাঁরা তাঁকে গোসল সম্পর্কে জিজ্ঞাসা করলেন। তিনি বললেন, এক সা’ তোমার জন্য যথেষ্ট। তখন এক ব্যাক্তি বলে উঠলঃ আমার জন্য তা যথেষ্ট নয়। জাবির (রাঃ) বললেনঃ যাঁর মাথায় তোমার চাইতে বেশি চুল ছিল এবং তোমার চাইতে যিনি উত্তম ছিলেন রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর জন্য তো এ পরিমাণই যথেষ্ট ছিল। তারপর তিনি এক কাপড়ে আমাদের ইমামতি করেন।',
            ref: '',
          ),
          HadisNumberModel(
            id: '২৫১। ',
            name:
                '  আবূ নু’আয়ম (রহঃ) .... ইবনু আব্বাস (রাঃ) থেকে বর্ণনা করেন যে, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও মায়মূনা (রাঃ) একই পাত্রের পানি দ্বারা গোসল করতেন। আবূ আবদুল্লাহ (রহঃ) বলেন, ইবনু ‘উয়ায়না (রহঃ) তাঁর শেষ জীবনে ইবনু আব্বাস (রাঃ)-এর মাধ্যমে মায়মূনা (রাঃ) থেকে ইহা বর্ণনা করতেন। তবে আবূ নু’আয়ম (রাঃ)-এর বর্ণনাই ঠিক।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১৭৭। ',
        name: '  মাথায় তিনবার পানি ঢালা',
        hadisNumberList: [
          HadisNumberModel(
            id: '২৫২।  ',
            name:
                ' আবূ নু’আয়ম (রহঃ) .... জুবায়র ইবনু মুত’ইম (রাঃ) থেকে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমি মাথায় তিনবার পানি ঢেলে থাকি। এই বলে তিনি উভয় হাতের দ্বারা ইশারা করেন।',
            ref: '',
          ),
          HadisNumberModel(
            id: '২৫৩। ',
            name:
                '   মুহাম্মদ ইবনু বাশশার (রহঃ) .... জাবির ইবনু ‘আবদুল্লাহ (রাঃ) থেকে বর্ণিত, তিনি বলেন যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিজের মাথায় তিনবার পানি ঢালতেন।',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ',
            name:
                '২৫৪। আবূ নু’আয়ম (রহঃ) .... আবূ জা’ফর (রহঃ) থেকে বর্ণিত, তিনি বলেনঃ আমাকে জাবির (রাঃ) বলেছেন, আমার কাছে তোমার চাচাত ভাই অর্থাৎ হাসান ইবনু মুহাম্মদ ইবনু হানাফিয়্যা এসেছিলেন। তিনি জিজ্ঞাসা করলেন, জানবাতের গোসল কিভাবে করতে হয়? আমি বললাম, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তিন আঁজলা পানি নিতেন এবং নিজের মাথার উপর ঢেলে দিতেন। তারপর নিজের সারা দেহে পানি পৌঁছিয়ে দিতেন। তখন হাসান আমাকে বললেন, আমার মাথার চুল খুব বেশি। আমি তাঁকে বললাম, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর চুল তোমার চেয়ে অধিক ছিল। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১৭৮।  ',
        name: ' একবার পানি ঢেলে গোসল করা',
        hadisNumberList: [
          HadisNumberModel(
            id: '২৫৫।  ',
            name:
                ' মূসা ইবনু ইসমা‘ঈল (রহঃ) ... ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিত, তিনি বলেন, মায়মূনা (রাঃ) বলেনঃ আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর জন্য গোসলের পানি রাখলাম। তিনি তাঁর হাত দু’বার বা তিনবার ধুয়ে নিলেন। পরে তাঁর বাম হাতে পানি নিয়ে তাঁর লজ্জাস্থান ধুয়ে ফেললেন। তারপর মাটিতে হাত ঘষলেন। তারপর কুলি করলেন, নাকে পানি দিলেন আর তাঁর চেহারা ও দু’হাত ধুয়ে নিলেন। এরপর তাঁর সারা দেহে পানি ঢাললেন। তারপর একটু সরে গিয়ে দু’পা ধুয়ে নিলেন।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১৭৯।',
        name: '  গোসলে হিলাব* বা খুশবু ব্যবহার করা।',
        hadisNumberList: [
          HadisNumberModel(
            id: '২৫৬। ',
            name:
                '  মুহাম্মদ ইবনুল মূসান্না (রহঃ) ... আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন জানবাতের গোসল করতেন, তখন হিলাবের অনুরূপ পাত্র চেয়ে নিতেন। তারপর এক আঁজলা পানি নিয়ে প্রথমে মাথার ডান পাশ এবং পরে বাম পাশ ধুয়ে ফেলতেন। দু’হাতে মাথার মাঝখানে পানি ঢালতেন। *হিলাবঃ উটনীর দুধ দোহনের পাত্র ।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১৮০।',
        name: ' জানাবাতের গোসলে কুলি করা ও নাকে পানি দেওয়া ',
        hadisNumberList: [
          HadisNumberModel(
            id: '২৫৭। ',
            name:
                '  উমর ইবনু হাফস্ ইবনু গিয়াস (রহঃ) .... ইবনু আব্বাস (রাঃ) থেকে বর্ণনা করেন যে, মায়মূনা (রাঃ) বলেনঃ আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর জন্য গোসলের পানি ঢেলে রাখলাম। তিনি তাঁর ডান হাত দিয়ে বাঁ হাতে পানি ঢাললেন এবং উভয় হাত ধুইলেন। এরপর তাঁর লজ্জাস্থান ধুয়ে নিলেন এবং মাটিতে তাঁর হাত ঘষে নিলেন। পরে তা ধুয়ে কুলি করলেন, নাকে পানি দিলেন, তারপর তাঁর চেহারা ধুইলেন এবং মাথার উপর পানি ঢাললেন। পরে ঐ স্থান থেকে সরে গিয়ে দুই পা ধুইলেন। অবশেষে তাঁকে একটি রুমাল দেওয়া হল, কিন্তু তিনি তা দিয়ে শরীর মুছলেন না।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১৮১। ',
        name: 'পরিচ্ছন্নতার জন্য মাটিতে হাত ঘষা ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ২৫৮।',
            name:
                ' আবদুল্লাহ ইবনু যুবাইর হুমায়দী (রহঃ) .... মায়মূনা (রাঃ) থেকে বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জানবাতের গোসল করলেন। তিনি নিজের লজ্জাস্থান ধুয়ে ফেললেন। তারপর হাত ঘষলেন এবং তা ধুইলেন। তারপর সালাতের উযূর মত উযূ (ওজু/অজু/অযু) করলেন। গোসল শেষ করে তিনি তাঁর দু পা ধুইলেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১৮২। ',
        name:
            ' যখন জানাবাত ছাড়া হাতে কোন নাপাকী না থাকে, ফরয গোসলের আগে হাত না ধুয়ে পানির পাত্রে তা প্রবেশ করানো যায় কি?',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'وَأَدْخَلَ ابْنُ عُمَرَ وَالْبَرَاءُ بْنُ عَازِبٍ يَدَهُ فِي الطَّهُورِ، وَلَمْ يَغْسِلْهَا ثُمَّ تَوَضَّأَ. وَلَمْ يَرَ ابْنُ عُمَرَ وَابْنُ عَبَّاسٍ بَأْسًا بِمَا يَنْتَضِحُ مِنْ غُسْلِ الْجَنَابَةِ ইবন ‘উমর (রাঃ) ও বারা ইবন ‘আযিব (রাঃ) হাত না ধুয়ে পানিতে হাত ঢুকিয়েছেন, তারপর উযূ করেছেন। ইবন ‘উমর (রাঃ) ও ইবন ‘আব্বাস (রাঃ) যে পানিতে ফরয গোসলের পানির ছিটা পড়েছে তা ব্যবহারে কোন দোষ মনে করতেন না। ২৫৯। আবদুল্লাহ ইবনু মাসলামা (রহঃ) .... আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি ও নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একই পাত্রের পানি দিয়ে এভাবে গোসল করতাম যে, তাতে আমাদের দু’জনের হাত একের পর এক পড়তে থাকত। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '২৬০। ',
            name:
                ' মূসা’দ্দাদ (রহঃ) .... ‘আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জানবাতের গোসল করার সময় প্রথমে হাত ধুয়ে নিতেন। ',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ২৬১।',
            name:
                ' আবূল ওয়ালীদ (রহঃ) .... আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি ও নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একই পাত্রের পানি দিয়ে জানবাতের গোসল করতাম। ‘আবদুর রহমান ইবনু কাসিম (রহঃ) তাঁর পিতার সূত্রে ‘আয়িশা (রাঃ) থেকে অনুরূপ হাদীস বর্ণনা করেন। ',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ২৬২। ',
            name:
                'আবূল ওয়ালীদ (রহঃ) .... আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত যে, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও তার স্ত্রীদের কেউ কেউ একই পাত্রের পানি নিয়ে গোসল করতেন। মুসলিম (রহঃ) এবং ওয়াহ্ব ইবনু জারীর (রহঃ) শু’বা (রাঃ) থেকে ‘তা ফরয গোসল ছিল’ বলে বর্ণনা করেছেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১৮৩।',
        name: '  গোসলের সময় ডান হাত থেকে বাম হাতের উপর পানি ঢালা।',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ২৬৩।',
            name:
                ' মূসা ইবনু ইসমা’ঈল (রহঃ) .... মায়মূনা বিনত হারিস (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর জন্য গোসলের পানি রেখে পর্দা করে দিলাম। তিনি পানি দিয়ে দু’বার কিংবা তিনবার হাত ধুইলেন। সুলায়মান (রহঃ) বলেন, তৃতীয়বারের কথা বলেছেন কিনা মনে পড়ে না। তখন তিনি ডান হাতে পানি নিয়ে বাম হাতে ঢাললেন এবং লজ্জাস্থান ধুয়ে নিলেন। তারপর তাঁর হাত মাটিতে বা দেওয়ালে ঘষলেন। পরে তিনি কুলি করলেন, নাকে পানি দিলেন এবং তাঁর চেহারা ও দু’ হাত ধুইলেন এবং মাথা ধুয়ে ফেললেন্ তারপর তাঁর শরীরে পানি ঢেলে দিলেন। পরে সেখান থেকে সরে গিয়ে তাঁর দু’পা ধুইলেন। অবশেষে আমি তাঁকে একখন্ড কাপড় দিলাম; কিন্তু তিনি হাতের ইশারায় নিষেধ করলেন এবং তা নিলেন না। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১৮৪।',
        name: ' গোসল ও উযূর অঙ্গ পৃথকভাবে ধোয়া। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'وَيُذْكَرُ عَنِ ابْنِ عُمَرَ أَنَّهُ غَسَلَ قَدَمَيْهِ بَعْدَ مَا جَفَّ وَضُوءُهُ ইবন ‘উমর (রাঃ) থেকে বর্ণিত, তিনি উযূর অঙ্গসমূহ শুকিয়ে যাওয়ার পর দু’পা ধুয়েছিলেন। ২৬৪। মুহাম্মদ ইবনু মাহবূব (রহঃ) .... মায়মূনা (রাঃ) বলেনঃ আমি রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর জন্য গোসলের পানি রাখলাম, তিনি উভয় হাতে পানি ঢেলে দু’বার করে বা তিনবার করে তা ধুইয়ে নিলেন। এরপর তিনি ডান হাতে পানি নিয়ে বাম হাতে ঢাললেন এবং তাঁর লজ্জাস্থান ধুইলেন। পরে তাঁর হাত মাটিতে ঘষলেন। তারপর কুলি করলেন ও নাকে পানি দিলেন। তারপর তাঁর মাথা তিনবার ধুইলেন এবং তাঁর সারা শরীরে পানি ঢাললেন। অবশেষে সেখান থেকে একটু সরে গিয়ে তাঁর দু’পা ধুয়ে ফেললেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১৮৫।',
        name:
            '  একাধিকবার বা একাধিক স্ত্রীর সাথে সংগত হওয়ার পর একবার গোসল করা।',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ২৬৫।',
            name:
                '  মুহাম্মদ ইবনু বাশ্‌শার (রহঃ) .... মুহাম্মদ ইবনু মুনতাশির (রহঃ) তাঁর পিতা থেকে বর্ণিত, তিনি বলেনঃ আমি ‘আয়িশা (রাঃ)-এর কাছে [আবদুল্লাহ ইবনু ‘উমর (রাঃ)]-এর উক্তিটি* উল্লেখ করলাম। তিনি বললেনঃ আল্লাহ্ আবূ ‘আবদুর রহমানকে রহম করুন। আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে খুশবু লাগাতাম, তারপর তিনি তাঁর স্ত্রীদের সঙ্গে মিলিত হতেন। তারপর ভোরবেলায় এমন অবস্থায় ইহ্‌রাম বাঁধতেন যে, তাঁর দেহ থেকে খুশবু ছড়িয়ে পড়তো। [আবদুল্লাহ্ ইবন ‘উমর (রাঃ)]-এর উক্তিটি: আমি এমন অবস্থায় ইহরাম বাঁধতে পছন্দ করি না, যাতে সকালে আমার দেহ থেকে খুশবু ছড়িয়ে পড়ে ।',
            ref: '',
          ),
          HadisNumberModel(
            id: '২৬৬। ',
            name:
                '  মুহাম্মদ ইবনু বাশ্‌শার (রহঃ) .... আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর স্ত্রীগণের কাছে দিনের বা রাতের কোন এক সময় পর্যায়ক্রমে মিলিত হতেন। তাঁরা ছিলেন এগারজন। বর্ণনাকারী বলেন, আমি আনাস (রাঃ)-কে জিজ্ঞাসা করলাম, তিনি কি এত শক্তি রাখতেন? তিনি বললেন, আমরা পরস্পর বলাবলি করতাম যে, তাঁকে ত্রিশজনের শক্তি দেওয়া হয়েছে। সা’ঈদ (রহঃ) কাতাদা (রহঃ) থেকে বর্ণনা করেন, আনাস (রাঃ) তাঁদের কাছে হাদীস বর্ণনা প্রসঙ্গে (এগারজনের স্থলে) নয়জন স্ত্রীর কথা বলেছেন।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১৮৬।',
        name: ' মযী বের হলে তা ধুয়ে ফেলা ও উযূ করা। ',
        hadisNumberList: [
          HadisNumberModel(
            id: '২৬৭। ',
            name:
                ' আবূল ওলীদ (রহঃ) .... ‘আলী (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমার অধিক মযী বের হতো। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কন্যা আমার স্ত্রী হওয়ার কারনে আমি একজনকে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এ বিষয়ে জিজ্ঞাসা করার জন্য পাঠালাম। তিনি প্রশ্ন করলে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ উযূ (ওজু/অজু/অযু) কর এবং লজ্জাস্থান ধুয়ে ফেল। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১৮৭।  ',
        name: 'খুশবু লাগিয়ে গোসল করার পর খুশবুর তাসির থেকে গেলে। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ২৬৮। ',
            name:
                'আবূ নু’মান (রহঃ) .... মুহাম্মদ ইবনু মুনতাশির (রহঃ) তাঁর পিতা থেকে বর্ণিত, আমি আয়িশা (রাঃ)-কে জিজ্ঞাসা করলাম এবং ‘আবদুল্লাহ ইবনু ‘উমর (রাঃ)-এর উক্তি উল্লেখ করলাম, “আমি এমন অবস্থায় ইহরাম বাঁধা পছন্দ করি না, যাতে সকালে আমার দেহ থেকে খুশবু ছড়িয়ে পড়ে।” ‘আয়িশা (রাঃ) বললেনঃ আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে সুগন্ধি লাগিয়েছি, তারপর তিনি পর্যায়ক্রমে তাঁর স্ত্রীদের সঙ্গে মিলিত হয়েছেন এবং তাঁর ইহ্‌রাম অবস্থায় প্রভাত হয়েছে। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '২৬৯।  ',
            name:
                ' আদম ইবনু (রহঃ) .... ‘আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি যেন এখনো দেখছি, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইহ্‌রাম অবস্থায় তাঁর সিথিতে খুশবুর ঔজ্জ্বল্য রয়েছে।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১৮৮।  ',
        name:
            'চুল খিলাল করা এবং চামড়া ভিজেছে বলে নিশ্চিত হওয়ার পর তাতে পানি ঢালা। ',
        hadisNumberList: [
          HadisNumberModel(
            id: '২৭০। ',
            name:
                ' আবদান (রহঃ) ..... আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন জানাবতের গোসল করতেন, তখন তিনি দু’হাত ধুইতেন এবং সালাতের উযূর মত উযূ (ওজু/অজু/অযু) করতেন। তারপর গোসল করতেন। পরে তাঁর হাত দিয়ে চুল খিলাল করতেন। চামড়া ভিজেছে বলে যখন তিনি নিশ্চিত হতেন, তখন তাতে তিনবার পানি ঢালতেন। তারপর সমস্ত শরীর ধুয়ে ফেলতেন। ‘আয়িশা (রাঃ) আরো বলেছেনঃ আমি ও রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একই পাত্র থেকে গোসল করতাম। আমরা একই সাথে তা থেকে আঁজলা ভরে পানি নিতাম। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১৮৮।',
        name:
            ' চুল খিলাল করা এবং চামড়া ভিজেছে বলে নিশ্চিত হওয়ার পর তাতে পানি ঢালা। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ২৭০।',
            name:
                '  আবদান (রহঃ) ..... আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন জানাবতের গোসল করতেন, তখন তিনি দু’হাত ধুইতেন এবং সালাতের উযূর মত উযূ (ওজু/অজু/অযু) করতেন। তারপর গোসল করতেন। পরে তাঁর হাত দিয়ে চুল খিলাল করতেন। চামড়া ভিজেছে বলে যখন তিনি নিশ্চিত হতেন, তখন তাতে তিনবার পানি ঢালতেন। তারপর সমস্ত শরীর ধুয়ে ফেলতেন। ‘আয়িশা (রাঃ) আরো বলেছেনঃ আমি ও রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একই পাত্র থেকে গোসল করতাম। আমরা একই সাথে তা থেকে আঁজলা ভরে পানি নিতাম।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১৮৯।',
        name:
            '  জানাবাত অবস্থায় যে উযূ করে সমস্ত শরীর ধোয় কিন্তু উযূর প্রত্যঙ্গগুলো দ্বিতীয়বার ধোয় না।',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ২৭১। ',
            name:
                ' ইউসুফ ইবনু ‘ঈসা (রহঃ) ..... মায়মূনা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জানবাতের গোসলের জন্য পানি রাখলেন। তারপর দু’বার বা তিনবার ডান হাতে বাম হাতের উপর পানি ঢাললেন এবং তাঁর লজ্জাস্থান ধুইলেন। তারপর তাঁর হাত মাটিতে বা দেওয়ালে দু’বার বা তিনবার ঘষলেন। পরে তিনি কুলি করলেন ও নাকে পানি দিলেন এবং চেহারা ও দু’হাত ধুইলেন। তারপর তাঁর মাথায় পানি ঢাললেন এবং তাঁর শরীর ধুইলেন। একটু সরে গিয়ে তাঁর দুই পা ধুইলেন। মায়মূনা (রাঃ) বলেনঃ এরপর আমি একখন্ড কাপড় দিলে তিনি তা নিলেন না, বরং নিজ হাতে পানি ঝেড়ে ফেলতে থাকলেন।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১৯০। ',
        name:
            'মসজিদের ভিতরে নিজের জানাবাতের কথা স্মরণ হলে তখনেই বেরিয়ে পড়বে, তায়াম্মুম করতে হবে না ',
        hadisNumberList: [
          HadisNumberModel(
            id: '২৭২। ',
            name:
                ' আবদুল্লাহ ইবনু মুহাম্মদ (রহঃ) .... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ একবার সালাতের ইকামত দেওয়া হলে সবাই দাঁড়িয়ে কাতার সোজা করছিলেন, তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের সামনে বেরিয়ে আসলেন। তিনি মূসাল্লায় দাঁড়ালে তাঁর মনে হল যে, তিনি জানবাত অবস্থায় আছেন। তখন তিনি আমাদের বললেনঃ স্ব স্ব স্থানে দাঁড়িয়ে থাক। তিনি ফিরে গিয়ে গোসল করে আবার আমাদের সামনে আসলেন এবং তাঁর মাথা থেকে পানি ঝরছিল। তিনি তাকবীর (তাহ্‌রীমা) বাঁধলেন, আর আমরাও তাঁর সাথে সালাত (নামায/নামাজ) আদায় করলাম। আবদুল আ’লা (রহঃ) যুহরী (রহঃ) থেকে এবং আওযাঈ (রহঃ)-ও যুহরী (রহঃ) থেকে অনুরূপ বর্ণনা করেছেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১৯১।',
        name: '  জানাবাতের গোসলের পর দু’হাত ঝাড়া',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ২৭৩।',
            name:
                ' আবদান (রহঃ) ... মায়মূনা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর জন্য গোসলের পানি রাখলাম এবং কাপড় দিয়ে পর্দা করে দিলাম। তিনি দু’হাতের উপর পানি ঢেলে উভয় হাত ধুয়ে নিলেন। তারপর ডান হাত দিয়ে বাম হাতে পানি ঢেলে লজ্জাস্থান ধুইলেন। পরে হাতে মাটি লাগিয়ে ঘষে নিলেন এবং ধুয়ে ফেললেন। এরপর কুলি করলেন, নাকে পানি দিলেন, চেহারা ও দু’হাত (কনুই পর্যন্ত) ধুইলেন। তারপর মাথায় পানি ঢাললেন ও সমস্ত শরীরে পানি পৌঁছালেন। তারপর একটু সরে গিয়ে দু’পা ধুয়ে নিলেন। এরপর আমি তাঁকে কাপড় দিলাম কিন্তু তিনি তা নিলেন না। তিনি দু’হাত ঝাড়তে ঝাড়তে চলে গেলেন ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১৯২।',
        name: ' মাথার ডান দিক থেকে গোসল শুরু করা। ',
        hadisNumberList: [
          HadisNumberModel(
            id: '২৭৪।  ',
            name:
                ' খাল্লাদ ইবনু ইয়াহ্ইয়া (রহঃ) ..... আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমাদের কারও জানবাতের গোসলের প্রয়োজন হলে সে দু’হাতে পনি নিয়ে তিনবার মাথায় ঢালত। পরে হাতে পানি নিয়ে ডান পাশে তিনবার এবং আবার হাতে পানি নিয়ে বাম পাশে তিনবার ঢালত।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১৯৩। ',
        name:
            ' নির্জনে বিবস্ত্র হয়ে গোসল করা এবং পর্দা করে গোসল করা। পর্দা করে গোসল করাই উত্তম। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                ' وَقَالَ بَهْزٌ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «اللَّهُ أَحَقُّ أَنْ يُسْتَحْيَا مِنْهُ مِنَ النَّاسِ বাহয (রহঃ) তাঁর পিতার সূত্রে তাঁর দাদা থেকে বর্ণনা করেন যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, লজ্জা করার ব্যাপারে মানুষের চেয়ে আল্লাহ্ পাকই অধিকতর হকদার। ২৭৫। ইসহাক ইবনু নাসর (রহঃ) ... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ বনী ইসরাঈলের লোকেরা নগ্ন হয়ে একে অপরকে দেখা অবস্থায় গোসল করত। কিন্তু মূসা (আঃ) একাকী গোসল করতেন। এতে বনী ইসরাঈলের লোকেরা বলাবলি করছিল, আল্লাহর কসম! মূসা (আঃ) কোষবৃদ্ধি’ রোগের কারনেই আমাদের সাথে গোসল করে না। একবার মূসা (আঃ) একটা পাথরের উপর কাপড় রেখে গোসল করছিলেন। পাথরটা তাঁর কাপড় নিয়ে পালাতে লাগল। তখন মূসা (আঃ) “পাথর! আমার কাপড় দাও, পাথর! আমার কাপড় দাও” বলে পেছন পেছন ছুটলেন। এদিকে বনী ইসরাঈল মূসার দিকে তাকাল। তখন তারা বলল, আল্লাহর কসম! মূসার কোন রোগ নেই। মূসা (আঃ) পাথর থেকে কাপড় নিয়ে পরলেন এবং পাথরটাকে পিটাতে লাগলেন। আবূ হুরায়রা (রাঃ) বলেনঃ আল্লাহর কসম! পাথরটিতে ছয় কিংবা সাতটি পিটুনির দাগ পড়ে গেল। আবূ হুরায়রা (রাঃ) আরো বলেন যে, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ এক সময় আইয়ূব (আঃ) বিবস্ত্রাবস্থায় গোসল করছিলেন। তখন তাঁর উপর সোনার পঙ্গপাল বর্ষিত হচ্ছিল। আইয়ূব (আঃ) তাঁর কাপড়ে সেগুলো কুড়িয়ে নিচ্ছিলেন। তখন তাঁর রব তাঁকে বললেনঃ হে আইয়ূব! আমি কি তোমাকে এগুলো থেকে অমুখাপেক্ষী করিনি? উত্তরে তিনি বললেন, হ্যাঁ, আপনার ইযযতের কসম! অবশ্যই করেছেন। তবে আমি আপনার বরকত থেকে বেনিয়ায নেই। এভাবে বর্ণনা করেছেন ইব্রাহীম (রহঃ) আবূ হুরায়রা (রাঃ) থেকে যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ একবার আইয়ূব আলাইহি ওয়া সাল্লাম বিবস্ত্রাবস্থায় গোসল করেছিলেন।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১৯৪।  ',
        name: ' লোকদের সামনে গোসলের সময় পর্দা করা।',
        hadisNumberList: [
          HadisNumberModel(
            id: '২৭৬।  ',
            name:
                'আবদুল্লাহ ইবনু মাসলামা (রহঃ) ... উম্মে হানী বিনত আবূ তালিব (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি মক্কা বিজয়ের বছর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে গিয়ে তাঁকে গোসলরত অবস্থায় দেখলাম, ফাতিমা (রাঃ) তাঁকে পর্দা করে রেখেছিলেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জিজ্ঞাসা করলেনঃ ইনি কে? আমি বললামঃ আমি উম্মে হানী। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১৯৪। ',
        name: '  লোকদের সামনে গোসলের সময় পর্দা করা।',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ২৭৭। ',
            name:
                'আবদান (রহঃ) ... মায়মূনা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর জন্য পর্দা করেছিলাম আর তিনি জানবাতের গোসল করছিলেন। তিনি দু’হাত ধুইলেন। তারপর ডান হাত দিয়ে বাম হাতে পানি নিয়ে লজ্জাস্থান এবং যেখানে কিছু লেগেছিল তা ধুয়ে ফেললেন। তারপর মাটিতে বা দেওয়ালে হাত ঘষলেন এবং দু’পা ছাড়া সালাতের উযূর মতই উযূ (ওজু/অজু/অযু) করলেন। তারপর তাঁর সমস্ত শরীরে পানি পৌঁছালেন। তারপর একটু সরে গিয়ে দু’পা ধুইলেন। আবূ আওয়ানা (রহঃ) ও ইবনু ফুযাইল (রহঃ) (ستر‏) সতর (পর্দা করা)-এর ব্যাপারটি এই হাদীসের অনুরূপ বর্ণনা করেছেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১৯৫। ',
        name: '  মহিলাদের ইহ্তিলাম (স্বপ্নদোষ) হলে।',
        hadisNumberList: [
          HadisNumberModel(
            id: '২৭৮। ',
            name:
                ' আবদুল্লাহ ইবনু ইউসুফ (রহঃ) .... উম্মুল মু’মিনীন উম্মে সালামা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আবূ তালহা (রাঃ)-এর স্ত্রী উম্মে সুলায়ম (রাঃ) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর খিদমতে এসে বললেনঃ ইয়া রাসুলাল্লাহ! আল্লাহ্ তা’আলা হকের ব্যাপারে লজ্জা করেন না। স্ত্রীলোকের ইহ্‌তিলাম (স্বপ্নদোষ) হলে কি গোসল ফরয হবে? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ হ্যাঁ। যদি তারা বীর্য দেখে। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১৯৬।',
        name: ' জুনুবী ব্যক্তির ঘাম, নিশ্চয় মুসলিম অপবিত্র নয় ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ২৭৯।',
            name:
                ' আলী ইবনু ‘আবদুল্লাহ (রহঃ) ... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ তাঁর সঙ্গে মদিনার কোন এক পথে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর দেখা হল। আবূ হুরায়রা (রাঃ) তখন জানবাতের অবস্থায় ছিলেন। তিনি বলেন, আমি নিজেকে নাপাক মনে করে সরে পড়লাম। পরে আবূ হুরায়রা (রাঃ) গোসল করে এলেন। পুনরায় সাক্ষাৎ হলে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জিজ্ঞাসা করলেনঃ আবূ হুরায়রা! কোথায় ছিলে? আবূ হুরায়রা (রাঃ) বললেন, আমি জানবাতের অবস্থায় আপনার সঙ্গে বসা সমীচীন মনে করিনি। তিনি বললেনঃ সুবাহানাল্লাহ্! মু’মিন নাপাক হয় না। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১৯৭।',
        name: ' জানাবাতের সময় বের হওয়া এবং বাজার ইত্যাদিতে চলাফেরা করা। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'وَقَالَ عَطَاءٌ يَحْتَجِمُ الْجُنُبُ وَيُقَلِّمُ أَظْفَارَهُ، وَيَحْلِقُ رَأْسَهُ، وَإِنْ لَمْ يَتَوَضَّأْ ‘আতা (রহঃ) বলেছেন, জুনুবী ব্যক্তি উযূ না করেও শিঙ্গা লাগাতে, নখ কাটতে এবং মাথা কামাতে পারে। ২৮০। আবদুল্লাহ আ’লা (রহঃ) .... আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একই রাতে পর্যায়ক্রমে তাঁর স্ত্রীদের সঙ্গে মিলিত হতেন। তখন তাঁর নয়জন স্ত্রী ছিলেন। ',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ২৮১।',
            name:
                '  আয়্যাশ (রহঃ) ... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমার সঙ্গে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাক্ষাৎ হল, তখন আমি জুনুবী ছিলাম। তিনি আমার হাত ধরলেন, আমি তাঁর সঙ্গে চললাম। এক স্থানে তিনি বসে পড়লেন। তখন আমি সরে পড়ে বাসস্থানে এসে গোসল করলাম। আবার তাঁর কাছে গিয়ে তাঁকে বসা অবস্থায় পেলাম। তিনি জিজ্ঞাসা করলেনঃ আবূ হুরায়রা! কোথায় ছিলে? আমি তাঁকে (ঘটনা) বললাম। তখন তিনি বললেনঃ সুবহানাল্লাহ্! মু’মিন অপবিত্র হয় না।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ১৯৮। ',
        name: '  জুনুবী ব্যক্তির গোসলের আগে উযূ করে ঘরে অবস্থান করা।',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ২৮২।',
            name:
                ' আবূ নু’আয়ম (রহঃ) .... আবূ সালামা (রহঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি ‘আয়িশা (রাঃ)-কে জিজ্ঞাসা করলামঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কি জানবাতের অবস্থায় ঘুমাতেন? তিনি বললেনঃ হ্যাঁ, তবে তিনি উযূ (ওজু/অজু/অযু) করে নিতেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ১৯৯। ',
        name: 'জুনুবীর নিদ্রা ',
        hadisNumberList: [
          HadisNumberModel(
            id: '২৮৩।  ',
            name:
                'কুতাইবা ইবনু সা’ঈদ (রহঃ) .... ‘উমর ইবনুু’ল খাত্তাব (রাঃ) থেকে বর্ণিত, তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে জিজ্ঞাসা করলেনঃ আমাদের কেউ জানবাতের অবস্থায় ঘুমাতে পারবে কি? তিনি বললেনঃ হ্যাঁ, উযূ (ওজু/অজু/অযু) করে নিলে জানবাতের অবস্থায়ও ঘুমাতে পারে। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২০০.',
        name: ' পরিচ্ছেদঃ জুনুবী উযূ করে ঘুমাবে। ',
        hadisNumberList: [
          HadisNumberModel(
            id: '২৮৪। ',
            name:
                ' ইয়াহ্ইয়া ইবনু বুকায়র (রহঃ) .... আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন জানবাতের অবস্থায় ঘুমাতে ইচ্ছা করতেন তখন তিনি লজ্জাস্থান ধুয়ে সালাত (নামায/নামাজ)-এর উযূর মত উযূ (ওজু/অজু/অযু) করতেন। ',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ২৮৫।',
            name:
                ' মূসা ইবনু ইসমা’ঈল (রহঃ) ... ‘আবদুল্লাহ ইবনু ‘উমর (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ ‘উমর (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে জিজ্ঞাসা করলেনঃ আমাদের কেউ জুনুবী অবস্থায় ঘুমাতে পারবে কি? তিনি বললেনঃ হ্যাঁ, যদি উযূ (ওজু/অজু/অযু) করে নেয়। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '২৮৬। ',
            name:
                '  আবদুল্লাহ ইবনু ইউসুফ (রহঃ) ..... আবদুল্লাহ ইবনু উমর (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ উমর ইবনুল খাত্তাব (রাঃ) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বললেন, রাত্রে কোন সময় তাঁর জানবাতের গোসল ফরয হয় (তখন কি করতে হবে?) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁকে বললেন, উযূ (ওজু/অজু/অযু) করবে, লজ্জাস্থান ধুয়ে নিবে, তারপর ঘুমাবে।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২০১। ',
        name: ' দু’লজ্জাস্থান পরস্পর মিলিত হলে। ',
        hadisNumberList: [
          HadisNumberModel(
            id: '২৮৭। ',
            name:
                ' মু‘আয ইবনু ফাযালা (রহঃ) ও আবূ নু’য়ম (রহঃ) .... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কেউ স্ত্রীর চার শাখার মাঝে বসে তার সাথে সঙ্গত হলে, গোসল ওয়াজিব হয়ে যায়। ‘আমর (রহঃ) শু’বার সূত্রে এই হাদীসের অনুরূপ হাদীস বর্ণনা করেছেন। আর মূসা (রহঃ) হাসান [বসরী (রহঃ)] সূত্রেও অনুরূপ বলেছেন। আবূ ‘আবদুল্লাহ (ইমাম বুখারি) (রহঃ) বলেনঃ এটা উত্তম ও অধিকতর মজবুত। মতভেদের করনে আমরা অন্য হাদীসটিও বর্ণনা করেছি, গোসল করাই অধিকতর সাবধানতা। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২০২।',
        name: '  স্ত্রী অঙ্গ থেকে কিছু লাগলে ধুয়ে ফেলা',
        hadisNumberList: [
          HadisNumberModel(
            id: '২৮৮। ',
            name:
                ' আবূ মা’মার (রহঃ) .... যায়দ ইবনু খালিদ আল-জুহানী (রহঃ) থেকে বর্ণিত, তিনি উসমান ইবনু ‘আফফান (রাঃ)-কে জিজ্ঞাসা করলেনঃ স্বামী-স্ত্রী সংগত হলে যদি মনি বের না হয় (তখন কি করবে)? উসমান (রাঃ) বললেনঃ সালাত (নামায/নামাজ)-এর উযূর মত উযূ (ওজু/অজু/অযু) করবে এবং লজ্জাস্থান ধুয়ে ফেলবে। ‘উসমান (রাঃ) বলেনঃ আমি এটা রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে শুনেছি। এরপর ‘আলী ইবনু আবূ তালিব, যুবায়র ইবনুল-আওওয়াম, তালহা ইবনু ‘উবায়দুল্লাহ্ ও উবাই ইবনু কা’ব (রাঃ)-কে জিজ্ঞাসা করেছিলাম। তাঁরা সবাই ঐ একই জবাব দিয়েছেন। আবূ সালামা (রহঃ) আবূ আয়্যূব (রাঃ) থেকে বর্ণনা করেন যে, তিনি [আবূ আবয়্যূব (রাঃ)] এ কথা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে শুনেছেন। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '২৮৯। ',
            name:
                '  মূসা’দ্দাদ (রহঃ) ... উবাই ইবনু কা’ব (রাঃ) থেকে বর্ণিত, তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে জিজ্ঞাসা করলেনঃ ইয়া রাসূলাল্লাহ! স্ত্রীর সাথে সঙ্গত হলে যদি বীর্য বের না হয় (তার হুকুম কি)? তিনি বললেনঃ স্ত্রীর থেকে যা লেগেছে তা ধুয়ে উযূ (ওজু/অজু/অযু) করবে ও সালাত (নামায/নামাজ) আদায় করবে। আবু আবূদুল্লাহ্ (ইমাম বুখারী) (রহঃ) বলেনঃ গোসল করাই শ্রেয়। আর তা-ই সর্বশেষ হুকুম। আমি এই শেষের হাদীসটি বর্ণনা করেছি মতভেদ থাকার কারনে। কিন্তু পানি (গোসল) অধিক পবিত্রকারী।',
            ref: '',
          ),
        ]),
  ];
  List<PorichedModel> chapterSix = [
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২০৩।',
        name: ' হায়যের ইতিকথা। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'وَيَسْأَلُونَكَ عَنْ الْمَحِيضِ قُلْ هُوَ أَذًى فَاعْتَزِلُوا النِّسَاءَ فِي الْمَحِيضِ إِلَى قَوْلِهِ وَيُحِبُّ الْمُتَطَهِّرِينَআর আল্লাহ্‌র বাণীঃ “লোকেরা তোমাকে হায়য সম্পর্কে জিজ্ঞাসা করে। বল, তা অপবিত্রতা। সুতরাং হায়য অবস্থায় স্ত্রীদের থেকে দূরে থাক। আর তারা পাক-পবিত্র হওয়ার পূর্বে তাদের সাথে মিলিত হয়ো না। তারা পাক-পবিত্র হলে আল্লাহ্‌র নির্দেশ মুতাবিক তাদের কাছে যাও। নিশ্চয়ই আল্লাহ্‌ তওবাকারীদের ভালবাসেন; তিনি পবিত্রতা রক্ষাকারীদেরও ভালবাসেন।” (২ : ২২২) وَقَوْلِ النَّبِيِّ صلى الله عليه وسلم ‏"‏ هَذَا شَىْءٌ كَتَبَهُ اللَّهُ عَلَى بَنَاتِ آدَمَ ‏"‏‏.‏ وَقَالَ بَعْضُهُمْ كَانَ أَوَّلُ مَا أُرْسِلَ الْحَيْضُ عَلَى بَنِي إِسْرَائِيلَ، وَحَدِيثُ النَّبِيِّ صلى الله عليه وسلم أَكْثَرُ‏.‏ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ এটি এমন একটি বিষয় যা আল্লাহ্ তা’আলা আদম-কন্যাদের জন্য নির্ধারণ করে দিয়েছেন। কারো কারো মতে সর্বপ্রথম হায়য শুরু হয় বনী ইসরাঈলী মহিলাদের। আবূ আবদুল্লাহ্ বুখারী (রহঃ) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের হাদীসই গ্রহণযোগ্য। ২৯০। আলী ইবনু ‘আবদুল্লাহ (রহঃ) .... আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমরা হজ্জের উদ্দেশ্যেই (মদিনা থেকে) বের হলাম। ‘সারিফ’ নামক স্থানে পৌঁছার পর আমার হায়য আসলো। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এসে আমাকে কাঁদতে দেখলেন; এবং বললেনঃ কি হল তোমার? তোমার হায়য এসেছে? আমি বললাম, হ্যাঁ। তিনি বললেনঃ এ তো আল্লাহ্ তা’আলাই আদম-কন্যাদের জন্য নির্ধারণ করে দিয়েছেন। সুতরাং তুমি বায়তুল্লাহর তাওয়াফ ছাড়া হজ্জের বাকী সব কাজ করে যাও। ‘আয়িশা (রাঃ) বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর স্ত্রীগণের পক্ষ থেকে গাভী কুরবানী করলেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২০৪।',
        name: ' হায়যের সময় স্বামীর মাথা ধুয়ে দেওয়া ও চুল আঁচড়িয়ে দেওয়া ',
        hadisNumberList: [
          HadisNumberModel(
            id: '২৯১। ',
            name:
                '  আবদুল্লাহ ইবনু ইউসুফ (রহঃ) .... ‘আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি হায়য অবস্থায় রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর মাথা আঁচড়িয়ে দিতাম।',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ২৯২। ',
            name:
                'ইব্‌রাহীম ইবনু মূসা (রহঃ) .... উরওয়া (রহঃ) থেকে বর্ণিত, তাঁকে (উরওয়াকে) প্রশ্ন করা হয়েছিল যে, ঋতুবতী স্ত্রী কি স্বামীর খিদমত করতে পারে? অথবা গোসল ফরয হওয়া অবস্থায় কি স্ত্রী স্বামীর নিকটবর্তী হতে পারে? উরওয়া জওয়াব দিলেন, এ সবই আমার কাছে সহজ। এ ধরনের সকল মহিলাই স্বামীর খিদমত করতে পারে। এ ব্যাপারে কারো অসুবিধা থাকার কথা নয়। আমাকে আয়িশা (রাঃ) বলেছেন যে, তিনি হায়যের অবস্থায় রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর চুল আঁচড়ে দিতেন। আর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইতিকাফ অবস্থায় মসজিদ থেকে তাঁর (আয়িশার) হুজরার দিকে তাঁর কাছে মাথাটা বাড়িয়ে দিতেন। তখন তিনি মাথার চুল আঁচড়াতেন অথচ তিনি ছিলেন ঋতুবতী। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২০৫।',
        name: '  স্ত্রীর হায়য অবস্থায় তার কোলে মাথা রেখে কুরআন তিলাওয়াত করা।',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'وَكَانَ أَبُو وَائِلٍ يُرْسِلُ خَادِمَهُ وَهْيَ حَائِضٌ إِلَى أَبِي رَزِينٍ، فَتَأْتِيهِ بِالْمُصْحَفِ فَتُمْسِكُهُ بِعِلاَقَتِهِ আবূ ওয়াইল (রহঃ) তাঁর ঋতুবতী দাসীকে আবূ রাযীন (রহঃ)-এর কাছে পাঠাতেন, আর দাসী জুযদানে পেঁচিয়ে কুরআন মাজীদ নিয়ে আসত। ২৯৩। আবূ নু’আয়ম (রহঃ) .... আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার কোলে হেলান দিয়ে কুরআন তিলাওয়াত করতেন। আর তখন আমি হায়যের অবস্থায় ছিলাম। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২০৬। ',
        name: ' নিফাসকে হায়য বলা ',
        hadisNumberList: [
          HadisNumberModel(
            id: '২৯৪। ',
            name:
                ' মক্কী ইবনু ইব্রাহীম (রহঃ) .... উম্মে সালামা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে একই চাঁদরের নীচে শুয়ে ছিলাম। হঠাৎ আমার হায়য দেখা দিলে আমি চুপি চুপি বেরিয়ে গিয়ে হায়যের কাপড় পরে নিলাম। তিনি বললেনঃ তোমার কি নিফাস দেখা দিয়েছে? আমি বললাম, ‘হ্যাঁ’। তখন তিনি আমাকে ডাকলেন। আমি তাঁর সঙ্গে চাঁদরের ভিতর শুয়ে পড়লাম। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২০৭।',
        name: ' হায়য অবস্থায় স্ত্রীর সাথে মেলামেশা করা ',
        hadisNumberList: [
          HadisNumberModel(
            id: '২৯৫।  ',
            name:
                'কাবীসা (রহঃ) .... আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি ও নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জানবাত অবস্থায় একই পাত্র থেকে পানি নিয়ে গোসল করতাম এবং তিনি আমাকে নির্দেশ দিলে আমি ইযার পরে নিতাম, আর আমার হায়য অবস্থায় তিনি আমার সাথে মিশামিশি করে শুইতেন। তাছাড়া তিনি ই’তিকাফ অবস্থায় মাথা বের করে দিতেন, আর আমি হায়য অবস্থায় মাথা ধুয়ে দিতাম। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '২৯৬। ',
            name:
                ' ইসমা’ঈল ইবনু খলীল (রহঃ) .... আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমাদের কেউ হায়য অবস্থায় থাকলে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর সাথে মিশামিশি করতে চাইলে তাকে হায়যের ইযার পরার নির্দেশ দিতেন। তারপর তার সাথে মিশামিশি করতেন। তিনি [আয়িশা (রাঃ)] বলেনঃ তোমাদের মধ্যে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর মত কাম-প্রবৃত্তি দমন করার শক্তি রাখে কে? খালিদ ও জারীর (রহঃ) আশ-শায়বানী (রহঃ) থেকে এই হাদীসের অনুরূপ বর্ণনা করেছেন। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '২৯৭ ',
            name:
                '। আবূ নু’মান (রহঃ) .... মায়মূনা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর কোন স্ত্রীর সাথে হায়য অবস্থায় মিশামিশি করতে চাইলে তাকে ইযার পরতে বলতেন। শায়বানী (রহঃ) থেকে সুফিয়ান (রহঃ) এ বর্ণনা করেছেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২০৮। ',
        name: ' হায়য অবস্থায় সওম ছেড়ে দেওয়া ',
        hadisNumberList: [
          HadisNumberModel(
            id: '২৯৮।  ',
            name:
                ' সা’ঈদ ইবনু আবূ মারয়াম (রহঃ) ... আবূ সা’ঈদ খুদরী (রাঃ) থেকে বর্ণিত, একবার ঈদুল আযহা বা ঈদুল ফিতরের সালাত (নামায/নামাজ) আদায়ের জন্য রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঈদগাহের দিকে যাচ্ছিলেন। তিনি মহিলাদের পাশ দিয়ে যাওয়ার সময় বললেনঃ হে মহিলা সমাজ! তোমরা সা’দকা করতে থাক। কারন আমি দেখেছি জাহান্নামের অধিবাসীদের মধ্যে তোমরাই অধিক। তাঁরা আরয করলেনঃ কী কারনে, ইয়া রাসূলাল্লাহ? তিনি বললেনঃ তোমরা অধিক পরিমাণে অভিশাপ দিয়ে থাক আর স্বামীর না-শোকরী করে থাক। বুদ্ধি ও দ্বীনের ব্যাপারে ত্রুটি থাকা সত্ত্বেও একজন সদাসতর্ক ব্যাক্তির বুদ্ধি হরণে তোমাদের চাইতে পারদর্শী আমি আর কাউকে দেখিনি। তাঁরা বললেনঃ আমাদের দ্বীন ও বুদ্ধির ত্রুটি কোথায়, ইয়া রাসূলাল্লাহ! তিনি বললেনঃ একজন মহিলার সাক্ষ্য কি একজন পুরুষের সাক্ষের অর্ধেক নয়? তাঁরা উত্তর দিলেন, ‘হ্যাঁ’। তখন তিনি বললেনঃ এ হচ্ছে তাদের বুদ্ধির ত্রুটি। আর হায়য অবস্থায় তারা কি সালাত ও সিয়াম থেকে বিরত থাকে না? তাঁরা বললেন, ‘হাঁ’। তিনি বললেনঃ এ হচ্ছে তাদের দ্বীনের ত্রুটি।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২০৯।',
        name: ' হায়য অবস্থায় কা’বার তাওয়াফ ছাড়া হজ্জের অন্যান্য কাজ করা যায়। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                ' وَقَالَ إِبْرَاهِيمُ لاَ بَأْسَ أَنْ تَقْرَأَ الآيَةَ. وَلَمْ يَرَ ابْنُ عَبَّاسٍ بِالْقِرَاءَةِ لِلْجُنُبِ بَأْسًا. وَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَذْكُرُ اللَّهَ عَلَى كُلِّ أَحْيَانِهِ. وَقَالَتْ أُمُّ عَطِيَّةَ كُنَّا نُؤْمَرُ أَنْ يَخْرُجَ الْحُيَّضُ، فَيُكَبِّرْنَ بِتَكْبِيرِهِمْ وَيَدْعُونَ. وَقَالَ ابْنُ عَبَّاسٍ أَخْبَرَنِي أَبُو سُفْيَانَ أَنَّ هِرَقْلَ دَعَا بِكِتَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَرَأَ فَإِذَا فِيهِ: «بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ وَ(يَا أَهْلَ الْكِتَابِ تَعَالَوْا إِلَى كَلِمَةٍ)». الآيَةَ. وَقَالَ عَطَاءٌ عَنْ جَابِرٍ حَاضَتْ عَائِشَةُ فَنَسَكَتِ الْمَنَاسِكَ غَيْرَ الطَّوَافِ بِالْبَيْتِ، وَلاَ تُصَلِّي. وَقَالَ الْحَكَمُ إِنِّي لأَذْبَحُ وَأَنَا جُنُبٌ. وَقَالَ اللَّهُ: (وَلاَ تَأْكُلُوا مِمَّا لَمْ يُذْكَرِ اسْمُ اللَّهِ عَلَيْهِ) ইবরাহীম (রহঃ) বলেছেনঃ (হায়য অবস্থায়) আয়াত পাঠে কোন দোষ নেই। ইবন ‘আব্বাস (রাঃ) জুনুবীর জন্য কুরআন পাঠে কোন দোষ মনে করতেন না। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সর্বাবস্থায় আল্লাহর যিকর করতেন। উম্মে আতিয়্যা (রাঃ) বলেনঃ (ঈদের দিন) হায়য অবস্থায় মহিলাদের বাইরে নিয়ে আসার জন্য বলা হতো, যাতে তারা পুরুষদের সাথে তাকবীর বলে ও দু’আ করে। ইবন ‘আব্বাস (রাঃ) আবূ সুফিয়ান (রাঃ) থেকে বর্ণনা করেন যে, হিরাকল (রোম সম্রাট) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের পত্র চেয়ে নিলেন এবং তা পাঠ করলেন। তাতে লেখা ছিলঃ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ وَ(يَا أَهْلَ الْكِتَابِ تَعَالَوْا إِلَى كَلِمَةٍ) الآيَةَ “দয়াময় পরম দয়ালু আল্লাহর নামে। আপনি বলুন! হে কিতাবীগণ! এস সে কথায় যা আমাদের ও তোমাদের মধ্যে একই-যেন আমরা আল্লাহ্ ব্যতীত কারো ইবাদত না করি। কোন কিছুকেই তাঁর শরীক না করি এবং আমাদের কেউ কাকেও আল্লাহ্ ব্যতীত রবরূপে গ্রহণ না করি। যদি তারা মুখ ফিরিয়ে নেয় তবে বলুন, তোমরা সাক্ষী থাক আমরা মুসলিম (৩ : ৬৪)। ‘আতা (রহঃ) জাবির (রাঃ) থেকে বর্ণনা করেন যে, ‘আয়িশা (রাঃ) হায়য অবস্থায় কা’বা তাওয়াফ ছাড়া হজ্জের অন্যান্য আহকাম পালন করেছেন কিন্তু সালাত আদায় করেন নি। হাকাম (রহঃ) বলেছেনঃ আমি জুনুবী অবস্থায়ও যবেহ করে থাকি। অথচ আল্লাহর বাণী হলোঃ وَلاَ تَأْكُلُوا مِمَّا لَمْ يُذْكَرِ اسْمُ اللَّهِ عَلَيْهِ “তোমরা আহার করো না সে সব প্রাণী, যার ওপর আল্লাহর নাম নেওয়া হয়নি।” (৬ : ১২১) ২৯৯। আবূ নু’আয়ম (রহঃ) ... আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে হজ্জের উদ্দেশ্যে বেরিয়েছিলাম। আমরা সারিফ নামক স্থানে পৌঁছলে আমি ঋতুবতী হই। এ সময় নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এসে আমাকে কাঁদতে দেখলেন এবং জিজ্ঞাসা করলেনঃ তুমি কাঁদছ কেন? আমি বললামঃ আল্লাহর শপথ! এ বছর হাজ্জ (হজ্জ) না করাই আমার জন্য পছন্দনীয়। তিনি বললেনঃ সম্ভবত তুমি ঋতুবতী হয়েছ। আমি বললাম, ‘হ্যাঁ’। তিনি বললেনঃ এ তো আদম কন্যাদের জন্য আল্লাহ্ নির্ধারিত করেছেন। তুমি পাক হওয়া পর্যন্ত অন্যান্য হাজীদের মত সমস্ত কাজ করে যাও, কেবল কাবার তাওয়াফ করবে না।',
            ref: '',
          ),
        ]),
    PorichedModel(id: ' পরিচ্ছেদঃ ২১০।', name: '  ইসতিহাযা', hadisNumberList: [
      HadisNumberModel(
        id: ' ৩০০।',
        name:
            '  আবদুল্লাহ ইবনু ইউসুফ (রহঃ) ... আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ ফাতিমা বিনত আবূ হূবায়শ (রাঃ) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে জিজ্ঞাসা করলেনঃ ইয়া রাসূলাল্লাহ! আমি কখনও পবিত্র হই না। এমতাবস্থাই আমি কি সালাত (নামায/নামাজ) ছেড়ে দেব? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ এ হল এক ধরনের বিশেষ রক্ত, হায়যের রক্ত নয়। যখন তোমার হায়য শুরু হয় তখন তুমি সালাত ছেড়ে দাও। আর হায়য শেষ হলে রক্ত ধুয়ে সালাত আদায় কর।* * হায়স ও নিফাসের মেয়াদের অতিরক্ত সময়কালিন রজঃস্রাবকে ইস্তিহাজা এবং সে মহিলাকে মুস্তাহাযা বলে।',
        ref: '',
      ),
    ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২১১। ',
        name: ' হায়যের রক্ত ধুয়ে ফেলা ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৩০১। ',
            name:
                '  আবদুল্লাহ ইবনু ইউসুফ (রহঃ) .... আসমা বিনতে আবূ বকর সিদ্দীক (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ এক মহিলা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে জিজ্ঞাসা করলেনঃ ইয়া রাসুলাল্লাহ! আমাদের কারো কাপড়ে হায়যের রক্ত লাগলে কি করবে? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তোমাদের কারো কাপড়ে হায়যের রক্ত লাগলে সে তা রগড়িয়ে, তারপর পানিতে ধুয়ে নেবে এবং সে কাপড়ে সালাত (নামায/নামাজ) আদায় করবে।',
            ref: '',
          ),
          HadisNumberModel(
            id: '৩০২।  ',
            name:
                ' আসবাগ (রহঃ) ... ’আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমাদের কারো হায়য হলে, পাক হওয়ার পর রক্ত রগড়িয়ে কাপড় পানি দিয়ে ধুয়ে সেই কাপড়ে তিনি সালাত (নামায/নামাজ) আদায় করতেন।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২১২।',
        name: ' মুসতাহাযা’র ই’তিকাফ ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৩০৩। ',
            name:
                ' ইসহাক ইবনু শাহীন (রহঃ) ... আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে তাঁর কোন এক স্ত্রী ইস্তিহাযার অবস্থায় ই’তিকাফ করেন। তিনি রক্ত দেখতেন এবং স্রাবের কারনে প্রায়ই তার নীচে একটি পাত্র রাখতেন। রাবী বলেনঃ ‘আয়িশা (রাঃ) হলুদ রঙের পানি দেখে বলেছেন, এ যেন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর অমুক স্ত্রীর ইস্তিহাযার রক্ত। ',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ৩০৪। ',
            name:
                ' কুতায়বা (রহঃ) .... আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে তার কোন একজন স্ত্রী ই’তিকাফ করেছিলেন। তিনি রক্ত ও হলদে পানি বের হতে দেখতেন আর তাঁর নীচে একটা পাত্র বসিয়ে রাখতেন এবং সে অবস্থায় সালাত (নামায/নামাজ) আদায় করতেন।',
            ref: '',
          ),
          HadisNumberModel(
            id: '৩০৫।  ',
            name:
                'মুসাদ্দাদ (রহঃ) ... আয়িশা (রাঃ) থেকে বর্ণিত, উম্মুল-মু\'মিনীদের একজন ইস্তিহাযা অবস্থায় ইতিকাফ করেছিলেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২১৩।',
        name: ' হায়য অবস্থায় পরিহিত পোশাকে সালাত আদায় করা যায় কি? ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৩০৬ ',
            name:
                ' । আবূ নূ’আয়ম (রহঃ) .... আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমাদের কারো একটির বেশি কাপড় ছিল না। তিনি হায়য অবস্থায়ও এই কাপড়খানই ব্যাবহার করতেন, তাতে রক্ত থুথু দিয়ে ভিজিয়ে নখ দ্বারা রগড়িয়ে নিতেন।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২১৪।',
        name: '  হায়য থেকে পবিত্রতার গোসলে সুগন্ধি ব্যাবহার।',
        hadisNumberList: [
          HadisNumberModel(
            id: '৩০৭। ',
            name:
                ' আবদুল্লাহ ইবনু ‘আবদুল ওয়াহহাব (রহঃ) ..... উম্মে ‘আতিয়া (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ কোন মৃত ব্যাক্তির জন্য আমাদের তিন দিনের বেশী শোক পালন করা থেকে নিষেধ করা হত। কিন্তু স্বামীর ক্ষেত্রে চার মাস দশ দিন (শোক পালনের অনুমতি ছিল)। আমরা তখন সুরমা লাগাতাম না, সুগন্ধি ব্যাবহার করতাম না, ইয়েমেনের তৈরি রঙ্গিন কাপড় ছাড়া অন্য কোন রঙ্গিন কাপড় পরতাম না। তবে হায়য থেকে পবিত্রতার গোসলে আজফারের খোশবু মিশ্রিত বস্ত্রখন্ড ব্যাবহারের অনুমতি ছিল। আর আমাদের জানাযার পেছনে যাওয়া নিষিদ্ধ ছিল। এই বর্ণনা হিশাম ইবনু হাসসান (রহঃ) হাফসা (রাঃ) থেকে, তিনি উম্মে ‘আতিয়্যা (রাঃ) থেকে এবং তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বিবৃত করেছেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২১৫।',
        name:
            ' হায়য এর পরে পবিত্রতা অর্জনের সময় দেহ ঘষামাজা করা, গোসলের পদ্ধতি এবং মিশকযুক্ত বস্ত্রখন্ড দিয়ে রক্তের চিহ্ন পরিষ্কার করা। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ৩০৮।',
            name:
                ' ইয়াহইয়া (রহঃ) .... আয়িশা (রাঃ) থেকে বর্ণিত, এক মহিলা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম–কে হায়যের গোসল সম্পর্কে জিজ্ঞাসা করলেন। তিনি তাকে গোসলের নিয়ম বলে দিলেন যে, এক টুকরা কস্তুরি লাগানো নেকড়া নিয়ে পবিত্রতা হাসিল কর। মহিলা বললেনঃ কিভাবে? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তা দিয়ে পবিত্রতা হাসিল কর। মহিলা (তৃতীয়বার) বললেন; কিভাবে? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ সুবানহানাল্লাহ! তা দিয়ে পবিত্রতা হাসিল কর। ‘আয়িশা (রাঃ) বলেনঃ তখন আমি তাকে টেনে আমার কাছে নিয়ে আসলাম এবং বললামঃ তা দিয়ে রক্তের চিহ্ন বিশেষভাবে মুছে ফেল। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২১৬। ',
        name: '  হায়যের গোসলের বিবরণ।',
        hadisNumberList: [
          HadisNumberModel(
            id: '৩০৯। ',
            name:
                '  মুসলিম (রহঃ) .... আয়িশা (রাঃ) থেকে বর্ণিত যে, একজন আনসারী মহিলা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে জিজ্ঞাসা করলেনঃ আমি কিভাবে হায়যের গোসল করবো? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ এক টুকরা কস্তুরিযুক্ত নেকড়া লও এবং তিনবার ধুয়ে নাও। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এরপর লজ্জাবশত অন্যদিকে মুখ ফিরিয়ে নিলেন এবং বললেনঃ তা দিয়ে তুমি পবিত্র হও। ‘আয়িশা (রাঃ) বলেনঃ আমি তাকে নিজের দিকে টেনে নিলাম। তারপর তাকে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কথার মর্ম বুঝিয়ে দিলাম।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২১৭।',
        name: '  হায়যের গোসলের সময় চুল আঁচড়ানো',
        hadisNumberList: [
          HadisNumberModel(
            id: '  ৩১০।',
            name:
                ' মূসা ইবনু ঈসমাঈল (রহঃ) ...... আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে বিদায় হাজ্জের ইহরাম বেঁধেছিলাম। আমিও তাদেরই একজন ছিলাম যারা তামাত্তু’র (একই সফরে হাজ্জ ও উমরা করা) নিয়্যত করেছিল এবং কুরবানীর পশু নেয়নি। তিনি বলেনঃ তাঁর হায়ায শুরু হয় আর আরফা-এর রাত পর্যন্ত তিনি পাক হন নি। আয়িশা (রাঃ) বলেনঃ আমি বললাম, ইয়া রাসূলাল্লাহ! আজ তো আরাফার রাত, আর আমি হাজ্জের সঙ্গে উমরারও নিয়্যত করেছি। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে বললেনঃ মাথার বেণী খুলে ফেল, চুল আঁচড়াও আর উমরা থেকে বিরত থাক। আমি তা-ই করলাম। হাজ্জ (হজ্জ) সমাধা করার পর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ‘আবদুর রহমান (রাঃ)-কে ‘হাসবায়’ অবস্থানের রাতে (আমাকে উমরা করানোর) নির্দেশ দিলেন। তিনি তান’ঈম থেকে আমাকে উমরা করালেন, যেখান থেকে আমি উমরার ইহরাম বেঁধেছিলাম।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২১৮। ',
        name: ' হায়যের গোসলে চুল খোলা ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৩১১। ',
            name:
                ' উবায়দ ইবনু ইসমাঈল (রহঃ) .... আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমরা যিলহাজ্জ মাসের চাঁদ দেখার সময় নিকটবর্তী হলে বেরিয়ে পড়লাম। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ যে উমরার ইহরাম বাঁধতে চায় সে তা করতে পারে। কারণ, আমি সাথে কুরবানীর পশু না আনলে উমরার ইহরামই বাঁধতাম। তারপর কেউ উমরার ইহরাম বাঁধলেন, আর কেউ হাজ্জের ইহরাম বাঁধলেন। আমি ছিলাম উমরার ইহরামকারীদের মধ্যে। আরাফার দিনে আমি ঋতুবতী ছিলাম। আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে আমার অসুবিধার কথা বললাম। তিনি বললেনঃ তোমার উমরা ছেড়ে দাও, মাথার বেণী খুলে চুল আঁচড়াও, আর হাজ্জের ইহরাম বাঁধ। আমি তাই করলাম। ‘হাসবা’ নামক স্থানে অবস্থানের রাতে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার সাথে আমার ভাই আবদুর রহমান ইবনু আবূ বকর (রাঃ)-কে পাঠালেন। আমি তান’ঈমের দিকে বের হলাম। সেখানে পূর্বের উমরার পরিবর্তে ইহরাম বাঁধলাম। হিশাম (রহঃ) বলেনঃ এসব কারণে কোন দম (কুরবানী) সাওম (রোযা/রোজা/সিয়াম/ছিয়াম) বা সা’দকা দিতে হয় নি। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২১৯।  ',
        name:
            ' আল্লাহর বাণী "পূর্ণাকৃতি ও অপূর্ণাকৃতি গোশত পিণ্ড” (২২ঃ:৫) প্রসঙ্গে',
        hadisNumberList: [
          HadisNumberModel(
            id: '৩১২। ',
            name:
                '  মুসাদ্দাদ (রহঃ) .... আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আল্লাহ তা’আলা মাতৃগর্ভের জন্য একজন ফিরিশতা নির্ধারণ করেছেন। তিনি (পর্যায়ক্রমে) বলতে থাকেন, হে রব! এখন বীর্য-আকৃতিতে আছে। হে রব! এখন জমাট রক্তে পরিণত হয়েছে। হে রব! এখন গোশতপিণ্ডে পরিণত হয়েছে। এরপর আল্লাহ তা’আলা যখন সৃষ্টি পূর্ণ করতে চান, তখন জিজ্ঞাসা করেনঃ পুরুষ, না স্ত্রী? সৌভাগ্যবান, না দুর্ভাগা রিযক ও বয়স কত? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তার মাতৃগর্ভে থাকতেই তা লিখে দেওয়া হয়।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২২০। ',
        name: ' ঋতুবতী কিভাবে হজ্জ ও উমরার ইহরাম বাঁধবে? ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৩১৩। ',
            name:
                ' ইয়াহইয়া ইবনু বুকাইর (রহঃ) .... আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে বিদায় হাজ্জের সময় বের হয়েছিলাম। আমাদের কেউ ইররাম বেঁধেছিল উমরার আর কেউ ইহরাম বেঁধেছিল হাজ্জের। আমরা মক্কায় এসে পৌঁছালে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ যারা উমরার ইহরাম বেঁধেছে কিন্তু কুরবানীর পশু সাথে আনেনি, তারা যেন ইহরাম খুলে ফেলে। আর যারা উমরার ইহরাম বেঁধেছে ও কুরবানীর পশু সাথে এনেছে, তারা যেন কুরবানী করা পর্যন্ত ইহরাম না খোলে। আর যারা হাজ্জের ইহরাম বেঁধেছে, তারা যেন হাজ্জ (হজ্জ) পূর্ণ করে। আয়িশা (রাঃ) বলেনঃ এরপর আমার হায়য শুরু হয় এবং আরাফার দিনেও তা বহাল থাকে। আমি শুধু উমরার ইহরাম বেঁধেছিলাম। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে মাথার বেণী খোলার চুল আঁচড়িয়ে নেওয়ার এবং উমরার ইহরাম ছেড়ে হাজ্জের ইহরাম বাঁধার নির্দেশ দিলেন। আমি তাই করলাম। পরে হাজ্জ (হজ্জ) সমাধা করলাম। এরপর ‘আবদুর রহমান ইবনু আবূ বকর (রাঃ)-কে আমার সাথে পাঠালেন। তিনি আমকে তান’ঈম থেকে আমার আগের পরিত্যক্ত উমরার পরিবর্তে উমরা করতে নির্দেশ দিলেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২২১। ',
        name: '  হায়য শুরু ও শেষ হওয়া।',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'وَكُنَّ نِسَاءٌ يَبْعَثْنَ إِلَى عَائِشَةَ بِالدُّرْجَةِ فِيهَا الْكُرْسُفُ فِيهِ الصُّفْرَةُ فَتَقُولُ لاَ تَعْجَلْنَ حَتَّى تَرَيْنَ الْقَصَّةَ الْبَيْضَاءَ. تُرِيدُ بِذَلِكَ الطُّهْرَ مِنَ الْحَيْضَةِ. وَبَلَغَ ابْنَةَ زَيْدِ بْنِ ثَابِتٍ أَنَّ نِسَاءً يَدْعُونَ بِالْمَصَابِيحِ مِنْ جَوْفِ اللَّيْلِ يَنْظُرْنَ إِلَى الطُّهْرِ فَقَالَتْ مَا كَانَ النِّسَاءُ يَصْنَعْنَ هَذَا. وَعَابَتْ عَلَيْهِنَّ স্ত্রীলোকেরা ‘আয়িশা (রাঃ) এর কাছে কৌটায় করে তুলা পাঠাতো। তাতে হলুদ রং দেখলে ‘আয়িশা (রাঃ) বলতেনঃ তাড়াহুড়া করো না, সাদা পরিস্কার দেখা পর্যন্ত অপেক্ষা কর। এ দ্বারা তিনি হায়য থেকে পবিত্রতা বোঝাতেন। যায়দ ইবন সাবিত (রাঃ) এর কন্যার কাছে সংবাদ এলো যে, স্ত্রীলোকেরা রাতের অন্ধকারে প্রদীপ চেয়ে নিয়ে হায়য থেকে পাক হলো কিনা তা দেখতেন। তিনি বললেনঃ স্ত্রীলোকেরা (পূর্বে) এমনটি করতেন না। তিনি তাদের দোষারোপ করেন। ৩১৪। আবদুল্লাহ ইবনু মুহাম্মদ (রহঃ) .... আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ ফাতিমা বিনতে আবূ হূরাইশ (রাঃ)-এর ইস্তিহাযা হতো। তিনি এ বিষয়ে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে জিজ্ঞাসা করলেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ এ হচ্ছে রগের রক্ত, হায়যের রক্ত নয়। সুতরাং হায়য শুরু হলে সালাত (নামায/নামাজ) ছেড়ে দেবে। আর হায়য শেষ হলে গোসল করে সালাত আদায় করবে। باب إِقْبَالِ الْمَحِيضِ وَإِدْبَارِهِ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ فَاطِمَةَ بِنْتَ أَبِي حُبَيْشٍ، كَانَتْ تُسْتَحَاضُ فَسَأَلَتِ النَّبِيَّ صلى الله عليه وسلم فَقَالَ ‏ "‏ ذَلِكِ عِرْقٌ، وَلَيْسَتْ بِالْحَيْضَةِ، فَإِذَا أَقْبَلَتِ الْحَيْضَةُ فَدَعِي الصَّلاَةَ، وَإِذَا أَدْبَرَتْ فَاغْتَسِلِي وَصَلِّي ‏"‏‏.‏ ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২২২। ',
        name: '  হায়যকালীন সালাতের কাযা নেই।',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                ' وَقَالَ جَابِرٌ وَأَبُو سَعِيدٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَدَعُ الصَّلاَةَ জাবির ইবন ‘আবদুল্লাহ ও আবূ সা’ঈদ খুদরী (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণনা করেন যে, (স্ত্রীলোক হায়যকালীন সময়) সালাত ছেড়ে দেবে ৩১৫। মূসা ইবনু ইসমা’ঈল (রহঃ) .... মু’আযা (রহঃ) থেকে বর্ণিত, এক মহিলা আয়িশা (রাঃ)–কে বললেনঃ আমাদের জন্য হায়যকালীন কাযা সালাত (নামায/নামাজ) পবিত্র হওয়ার পর আদায় করলে চলবে কি না? ‘আয়িশা (রাঃ) বললেনঃ তুমি কি হারুরইয়্যা? (খারেজীদের একটি দল ঋতুবতীর জন্য সালাতের ক্বাযা ওয়াজিব মনে করত) আমরা রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সময়ে ঋতুবতী হতাম কিন্তু আমাদের সালাত কাযার নির্দেশ দিতেন না। অথবা তিনি [‘আয়িশা (রাঃ)] বলেনঃ আমরা তা কাযা করতাম না।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২২৩।',
        name: '  ঋতুবতী মহিলার সঙ্গে হায়যের কাপড় পরিহিত অবস্থায় একত্রে শয়ন',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ৩১৬।',
            name:
                '  সা’দ ইবনু হাফস (রহঃ) .... উম্মে সালমা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে একই চাঁদরের নীচে শায়িত অবস্থায় আমার হায়য দেখা দিল। তখন আমি চুপিসারে বেরিয়ে এসে হায়যের কাপড় পরে নিলাম। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে বললেনঃ তোমার কি হায়য শুরু হয়েছে? আমি বললামঃ হ্যাঁ। তখন তিনি আমকে ডেকে নিয়ে তাঁর চাঁদরের নিচে স্থান দিলেন। বর্ণনাকারী যায়নাব (রহঃ) বলেনঃ আমাকে উম্মে সালমা (রাঃ) এও বলেছেন যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রোযা রাখা অবস্থায় তাকে চুমু খেতেন। [উম্মে সালমা (রাঃ) আরও বলেন] আমি ও রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একই পাত্র থেকে পানি নিয়ে জানবাতের গোসল করতাম।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২২৪।',
        name: ' হায়যের জন্য সতন্ত্র কাপড় পরিধান করা ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৩১৭। ',
            name:
                ' মু\'আয ইবনু ফাযালা (রহঃ) .... উম্মে সালমা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ এক সময় আমি ও নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একই চাঁদরের নীচে শুয়েছিলাম। আমার হায়য শুরু হল। তখন আমি চুপিসারে বেরিয়ে এসে হায়যের কাপড় পরে নিলাম। তিনি জিজ্ঞাসা করলেনঃ তোমার কি হায়য আরম্ভ হয়েছে? আমি বললামঃ হ্যাঁ। তিনি আমকে ডেকে নিলেন এবং আমি তাঁর সঙ্গে একই চাঁদরের নীচে শুয়ে পড়লাম। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২২৫। ',
        name:
            ' ঋতুবতী মহিলাদের উভয় ঈদ ও মুসলিমদের দু’আর সমাবেশে উপস্থিত হওয়া এবং ঈদগাহ থেকে দূরে অবস্থান করা ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৩১৮। ',
            name:
                ' মুহাম্মদ ইবনু সালামা (রহঃ) .... হাফসা (রহঃ) থেকে বর্ণিত, তিনি বলেনঃ আমরা আমাদের যুবতীদের ঈদের সালাতে (নামাযে) বের হতে নিষেদ করতাম। এক মহিলা বনূ খালাফের মহলে এসে পৌঁছালেন এবং তিনি তাঁর বোন থেকে বর্ণনা করলেন। তাঁর ভগ্নীপতি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে বারটি গাযওয়ায় অংশ গ্রহন করেছিলেন। তিনি বলেনঃ আমার বোনও তাঁর ছয়টি গাযওয়ায় শরীক ছিল। সেই বোন বলেনঃ আমাদের কারো ওড়না না থাকার কারণে বের না হলে কোন অসুবিধা আছে কি? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তাঁর সাথীর ওড়না তাকে পরিয়ে দেবে, যাতে সে ভালো মজলিস ও মুমিনদের শরীক হতে পারে। যখন উম্মে আতিয়্যা (রাঃ) আসলেন, আমি তাকে জিজ্ঞাসা করলামঃ আপনি কি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে এরুপ শুনেছেন? উত্তরে তিনি বললেঃ আমার পিতা তাঁর জন্য কুরবান হোক। হ্যাঁ, তিনি এরুপ বলেছিলেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কথা আলোচিত হলেই তিনি বলতেন “আমার পিতা তাঁর জন্য কুরবান হোক”। আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি যে। যুবতী, পর্দানশীল ঋতুবতী মহিলারা বের হবে এবং ভাল স্থানে ও মু\'মিনদের দু\'আয় অংশ গ্রহন করবে। অবশ্য ঋতুবতী মহিলা ঈদগাহ থেকে দূরে থাকবে। হাফসা (রহঃ) বলেনঃ আমি জিজ্ঞাসা করলামঃ ঋতুবতীও কি বেরুবে? তিনি বলেনঃ সে কি আরাফাতের ও অমুক অমুক স্থানে উপস্থিত হবে না? ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২২৬।',
        name:
            ' একই মাসে তিন হায়য হলে সম্ভাব্য হায়য ও গর্ভধারণের ব্যাপারে স্ত্রীলিকোর কথা গ্রহণযোগ্য। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                ' للَّهِ تَعَالَى: (وَلاَ يَحِلُّ لَهُنَّ أَنْ يَكْتُمْنَ مَا خَلَقَ اللَّهُ فِي أَرْحَامِهِنَّ). وَيُذْكَرُ عَنْ عَلِيٍّ وَشُرَيْحٍ إِنِ امْرَأَةٌ جَاءَتْ بِبَيِّنَةٍ مِنْ بِطَانَةِ أَهْلِهَا مِمَّنْ يُرْضَى دِينُهُ، أَنَّهَا حَاضَتْ ثَلاَثًا فِي شَهْرٍ. صُدِّقَتْ. وَقَالَ عَطَاءٌ أَقْرَاؤُهَا مَا كَانَتْ، وَبِهِ قَالَ إِبْرَاهِيمُ. وَقَالَ عَطَاءٌ الْحَيْضُ يَوْمٌ إِلَى خَمْسَ عَشْرَةَ. وَقَالَ مُعْتَمِرٌ عَنْ أَبِيهِ سَأَلْتُ ابْنَ سِيرِينَ عَنِ الْمَرْأَةِ تَرَى الدَّمَ بَعْدَ قَرْئِهَا بِخَمْسَةِ أَيَّامٍ قَالَ النِّسَاءُ أَعْلَمُ بِذَلِكَ কারণ আল্লাহর ঘোষণা রয়েছেঃ وَلاَ يَحِلُّ لَهُنَّ أَنْ يَكْتُمْنَ مَا خَلَقَ اللَّهُ فِي أَرْحَامِهِنَّ মহিলাদের গর্ভে আল্লাহ যা সৃষ্টি করেছেন সে বিষয়টি গোপন করা তাদের পক্ষে বৈধ নয়। (২ঃ ২২৮) ‘আলী (রাঃ) ও শুরায়হ (রাঃ) থেকে বর্ণিত, যদি মহিলার নিজ পরিবারের দিনদার কেউ সাক্ষ্য দেয় যে, এ মহিলা মাসে তিনবার ঋতুবতী হয়েছে, তবে তাঁর কথা গ্রহণযোগ্য হবে। ‘আতা (রহঃ) বলেনঃ মহিলার হায়যের দিন গণনা করা হবে তাঁর পূর্ব অভ্যাস অনুযায়ী। ইবরাহীম (রহঃ)-ও অনুরূপ বলেন। ‘আতা (রহঃ) আরো বলেনঃ হায়য একদিন থেকে পনের দিন পর্যন্ত হতে পারে। মু’তামির তাঁর পিতা থেকে বর্ণনা করেন, তিনি বলেছেনঃ আমি ইবন সীরীন (রহঃ)-কে এমন মহিলা সম্পর্কে জিজ্ঞাসা করলাম যে তার পূর্ব অভ্যাস অনুযায়ী হায়যের পাঁচ দিন পূর্ণ হওয়ার পরও রক্ত দেখে? তিনি জবাবে বললেনঃ এ ব্যাপারে মহিলারা ভালো জানে। ৩১৯। আহমদ ইবনু আবূ রাজা’ (রহঃ) .... আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ ফাতিমা বিনত আবূ হুবায়শ (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে জিজ্ঞাসা করলেন, আমার ইস্তিহাযা হয়েছে এবং পবিত্র হচ্ছি না। আমি কি সালাত (নামায/নামাজ) ছেড়ে দেব? নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ না, এ হল রগ-নির্গত রক্ত। তবে এরূপ হওয়ার আগে যতদিন হায়য হতো সে কয়দিন সালাত অবশ্যই ছেড়ে দাও। তারপর গোসল করে নিবে ও সালাত আদায় করবে।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২২৭। ',
        name: ' পরিচ্ছেদঃ ২২৭। হায়াযের দিনগুলো ছাড়া হলুদ এবংমেটে রং দেখা',
        hadisNumberList: [
          HadisNumberModel(
            id: '৩২০। ',
            name:
                ' কুতাইবা ইবনু সা’ঈদ (রহঃ) ... উম্মে ‘আতিয়্যা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমরা মেটে ও হলুদ রং হায়যের মধ্যে গন্য করতাম না। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২২৮। ',
        name: ' ইস্তিহাযার শিরা ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৩২১।  ',
            name:
                ' ইবরাহীম ইবনু মুনযির আল-হিযামী (রহঃ) .... নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর পত্নী ‘আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ উম্মে হাবীবা (রাঃ) সাত বছর পর্যন্ত ইস্তিহাযাগ্রস্থা ছিলেন। তিনি এ ব্যাপারে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে জিজ্ঞাসা করলেন। তিনি তাঁকে গোসলের নির্দেশ দিলেন এবং বললেনঃ এ শিরা-নির্গত রক্ত। এরপর উম্মে হাবীবা (রাঃ) প্রতি সালাত (নামায/নামাজ)-এর জন্য গোসল করতেন।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২২৯।',
        name: ' তাওয়াফে যিয়ারতের পর স্ত্রীলোকের হায়য শুরু হলে ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ৩২২। ',
            name:
                'আবদুল্লাহ ইবনু ইউসুফ (রহঃ) ..... নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর পত্নী ‘আয়িশা (রাঃ) থেকে বর্ণিত, তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে জিজ্ঞাসা করলেনঃ ইয়া রাসুলাল্লাহ! সাফিয়্যা বিনত হুযাইয়ের হায়য শুরু হয়েছে। তিনি বললেনঃ সে তো তোমাদেরকে আটকিয়ে রাখবে। সে কি তোমাদের সঙ্গে তাওয়াফে-যিয়ারত করেনি? তাঁর জবাব দিলেন, হ্যাঁ করেছেন। তিনি বললেনঃ তা হলে বের হও। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '৩২৩। ',
            name:
                ' মুআল্লা ইবনু আসা’দ (রহঃ) .... আবদুল্লাহ ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ (তাওয়াফে যিয়ারার পর) মহিলার হায়য হলে তার চলে যাওয়ার অনুমতি রয়েছে। এর আগে ইবনু ‘উমর (রাঃ) বলতেনঃ সে যেতে পারবে না। তারপর তাঁকে বলতে শুনেছি যে, সে যেতে পারে। কারণ, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের জন্য (যাওয়ার) অনুমতি দিয়েছেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২৩০। ',
        name: ' ইস্তিহাযাগ্রস্তা নারীর পবিত্রতা দেখা।',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'قَالَ ابْنُ عَبَّاسٍ تَغْتَسِلُ وَتُصَلِّي وَلَوْ سَاعَةً، وَيَأْتِيهَا زَوْجُهَا إِذَا صَلَّتْ، الصَّلاَةُ أَعْظَمُ ইবন ‘আব্বাস (রাঃ) বলেনঃ মুস্তাহাযা দিনের কিছু সময়ের জন্য হলেও পবিত্রতা দেখলে গোসল করবে ও সালাত আদায় করবে। আর সালাত আদায় করার পর তাঁর স্বামী তাঁর সাথে মিলতে পারে। কারণ, সালাতের গুরুত্ব অত্যাধিক। ৩২৪। আহমদ ইবনু ইউনুস (রহঃ) ... আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ হায়য দেখা দিলে সালাত (নামায/নামাজ) ছেড়ে দাও আর হায়যের সময় শেষ হয়ে গেলে রক্ত ধুয়ে নাও এবং সালাত (নামায/নামাজ) আদায় কর। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২৩১।',
        name: '  নিফাস অবস্থায় মৃত স্ত্রীলকের সালাতে জানাযা ও তাঁর পদ্ধতি',
        hadisNumberList: [
          HadisNumberModel(
            id: '৩২৫।  ',
            name:
                ' আহমদ ইবনু সুরায়জ (রহঃ) .... সামুরা ইবনু জুনদুব (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ একজন প্রসূতি মহিলা মারা গেলে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর জানাযা পড়লেন। সালাতে তিনি মহিলার দেহের মাঝ বরাবর দাঁড়িয়েছিলেন।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২৩২। ',
        name: 'পরিচ্ছেদ নাই। ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৩২৬। ',
            name:
                ' হাসান ইবনু মুদরিক (রহঃ) ...... আবদুল্লাহ ইবনু শাদ্দাদ (রহঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি আমার খালা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর পত্নী মায়মূনা (রাঃ) থেকে শুনেছি যে, তিনি হায়য অবস্থায় সালাত (নামায/নামাজ) আদায় করতেন না; তখন তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সিজদার জায়গায় সোজাসুজি শুয়ে থাকতেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর চাটাইয়ে সালাত আদায় করতেন। সিজদা করার সময় তাঁর কাপড়ের অংশ আমার (মায়মূনার) গায়ে লাগতো। ',
            ref: '',
          ),
        ]),
  ];
  List<PorichedModel> chapterSeven = [
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২৩৩। ',
        name:
            '  আল্লাহ তা’আলার বাণীঃ “এবং তোমরা পানি না পেলে পাক মাটি দিয়ে তায়াম্মুম করবে এবং তা তোমরা তোমাদের মুখ ও হাতে বুলাবে” (৪ঃ৪৩)',
        hadisNumberList: [
          HadisNumberModel(
            id: '৩২৭।  ',
            name:
                'আবদুল্লাহ ইবনু ইউসুফ (রহঃ) ..... নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর স্ত্রী ‘আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে কোন এক সফরে বেরিয়েছিলাম। যখন আমরা ‘বায়যা’ অথবা ‘যাতুল জায়শ’ নামক স্থানে পৌছালাম তখন আমার একখানা হার হারিয়ে গেল। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সেখানে হারের খোঁজে থেমে গেলেন আর লোকেরাও তাঁর সঙ্গে থেমে গেলেন, অথচ তাঁরা পানির নিকটে ছিলেন না। তখন লোকেরা আবূ বকর (রাঃ) এর কাছে এসে বললেনঃ ‘আয়িশা কি করেছে আপনি কি দেখেন নি? তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও লোকদের আটকিয়ে ফেলেছেন, অথচ তাঁরা পানির নিকটে নেই এবং তাদের সাথেও পানি নেই। আবূ বকর (রাঃ) আমার নিকট আসলেন, তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার উরুর উপরে মাথা রেখে ঘুমিয়েছিলেন। আবূ বকর (রাঃ) বললেনঃ তুমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর লোকদের আটকিয়ে ফেলেছো! অথচ আশেপাশে কোথাও পানি নেই। ‘আয়িশা (রাঃ) বললেন আবূ বকর আমাকে খুব তিরস্কার করলেন আর, আল্লাহর ইচ্ছা, তিনি যা খুশি তাই বললেন। তিনি আমার কোমরে আঘাত দিতে লাগলেন। আমার উরুর উপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর মাথা থাকায় আমি নড়তে পারছিলাম না। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ভোরে উঠলেন, কিন্তু পানি ছিল না। তখন আল্লাহ তা’আলা তায়াম্মুমের আয়াত নাযিল করলেন। তারপর সবাই তায়াম্মুম করে নিলেন। উসায়দ ইবনু হুযায়র (রাঃ) বলেছেনঃ হে আবূ বকরের পরিবার বর্গ! এটাই আপনাদের প্রথম বরকত নয়। ‘আয়িশা (রাঃ) বলেনঃ তারপর আমি যে উটে ছিলাম তাকে দাঁড় করালে দেখি আমার হার খানা তার নীচে পড়ে আছে। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২৪১। ',
        name: ' পরিচ্ছেদ নাই। ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৩২৮। ',
            name:
                '  মুহাম্মদ ইবনু সিনান ও সা’ঈদ ইবনু নাযর (রহঃ) .... জাবির ইবনু ‘আবদুল্লাহ (রাঃ) থেকে বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আমাকে এমন পাঁচটি বিষয় দান করা হয়েছে, যা আমার পূর্বে কাউকে দেওয়া হয়নি। (১) আমাকে এমন প্রভাব দিয়ে সাহায্য করা হয়েছে যে, একমাস দূরত্বেও তা প্রতিফলিত হয়; (২) সমস্ত যমীন আমার জন্য প্রবিত্র ও সালাত (নামায/নামাজ) আদায়ের উপযোগি করা হয়েছে। কাজেই আমার উম্মাতের যে কোন লোক ওয়াক্ত হলেই সালাত আদায় করতে পারবে; (৩) আমার জন্য গনীমতের মাল হালাল করে দেওয়া হয়েছে, যা আমার আগে আর কারো জন্য হালাল করা হয়নি; (৪) আমাকে (ব্যাপক) শাফা’আতের অধিকার দেওয়া হয়েছে; (৫) সমস্ত নবী প্রেরিত হতেন কেবল তাদের সম্প্রদায়ের জন্য, আর আমাকে প্রেরণ করা হয়েছে সমগ্র মানব জাতির জন্য।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২৩৪। ',
        name: ' পরিচ্ছেদঃ মাটি ও পানি পাওয়া না গেলে ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৩২৯।  ',
            name:
                'যাকারিয়্যা ইবনু ইয়াহইয়া (রহঃ) .... আয়িশা (রাঃ) থেকে বর্ণিত, তিনি এক সময়ে (তাঁর বোন) আসমা (রাঃ)-এর হার ধার করে নিয়ে গিয়েছিলেন। (পথিমধ্যে) হারখানা হারিয়ে গেল। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সেটির খোঁজে লোক পাঠালেন। তিনি এমন সময় হারটি পেলেন, যখন তাদের সালাতের ওয়াক্ত হয়ে গিয়েছিল অথচ তাদের কাছে পানি ছিল না। তাঁরা সালাত (নামায/নামাজ) আদায় করলেন। তারপর বিষয়টি তাঁরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে বর্ণনা করেন। তখন আল্লাহ তা’আলা তায়াম্মুমের আয়াত নাযিল করেন। সেজন্য উসায়দ ইবনু হুযায়র (রাঃ) ‘আয়িশা (রাঃ)–কে লক্ষ্য করে বললেনঃ আল্লাহ আপনাকে উত্তম প্রতিদান দিন। আল্লাহর কসম! আপনি যে কোন অপছন্দনীয় পরিস্থিতির সম্মুখীন হয়েছেন, তাতেই আল্লাহ তা’আলা আপনার ও সমস্ত মুসলিমের জন্য কল্যাণ রেখেছেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২৩৫। ',
        name:
            ' মুকীম অবস্থায় পানি না পেলে এবং সালাত ছুটে যাওয়ার ভয় থাকলে তায়াম্মুম করা। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'وَبِهِ قَالَ عَطَاءٌ. وَقَالَ الْحَسَنُ فِي الْمَرِيضِ عِنْدَهُ الْمَاءُ وَلاَ يَجِدُ مَنْ يُنَاوِلُهُ يَتَيَمَّمُ. وَأَقْبَلَ ابْنُ عُمَرَ مِنْ أَرْضِهِ بِالْجُرُفِ، فَحَضَرَتِ الْعَصْرُ بِمَرْبَدِ النَّعَمِ فَصَلَّى، ثُمَّ دَخَلَ الْمَدِينَةَ وَالشَّمْسُ مُرْتَفِعَةٌ فَلَمْ يُعِدْ ‘আতা (রহঃ)-এর অভিমতও তাই। হাসান বসরী (রহঃ) বলেনঃ যে রোগের কাছে পানি আছে কিন্তু তাঁর কাছে তা পৌছানোর কোন লোক না থাকে, তবে সে তায়াম্মুম করবে। ইবন ‘উমর (রাঃ) জুরুফ নামক স্থানের জমি থেকে ফেরার সময় ‘মারবাদুন্না’আম’-এ পৌঁছালে আসরের সময় হয়ে যায়। তখন তিনি (তায়াম্মুম) করে সালাত আদায় করলেন। পরে তিনি মদীনা পৌছালেন। তখনো সূর্য উপরে ছিল। কিন্তু তিনি সালাত পুনরায় আদায় করলেন না ৩৩০। ইয়াহইয়া ইবনু বুকায়র (রহঃ) ..... আবূ জুহাইম (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (মদিনার নিকটস্থ) ‘বি\'রে জামাল’ থেকে আসছিলেন। পথিমধ্যে তাঁর সাথে এক ব্যাক্তির দেখা হল। লোকটি তাঁকে সালাম দিলেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জওয়াব না দিয়ে দেয়ালের কাছে অগ্রসর হয়ে তাতে (হাত মেরে) নিজ চেহারা ও হস্তদ্বয় মাসেহ করে নিলেন, তারপর সালামের জওয়াব দিলেন।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২৩৬।',
        name: '  তায়াম্মুমের জন্য মাটিতে হাত মারার পর হস্তদ্বয়ে ফুঁ দেওয়া',
        hadisNumberList: [
          HadisNumberModel(
            id: '৩৩১। ',
            name:
                ' আদম (রহঃ) ..... সা\'ঈদ ইবনু আবদুর রহমান ইবনু আবযা তাঁর পিতা [আবদুর রহমান (রাঃ)] থেকে বর্ণিত, এক ব্যাক্তি ইবনুল খাত্তাব (রাঃ)-এর নিকট এসে জানতে চাইলঃ একবার আমার গোসলের প্রয়োজন হল অথচ আমি পানি পেলাম না। তখন আম্মার ইবনু ইয়াসির (রাঃ) উমর ইবনুল খাত্তাব (রাঃ)-কে বললেনঃ আপনার কি সেই ঘটনা স্মরণ আছে যে, এক সময় আমরা দু\'জন সফরে ছিলাম এবং দু\'জনেরই গোসলের প্রয়োজনীয়তা দেখা দিল। আপনি তো সালাত (নামায/নামাজ) আদায় করলেন না। আর আমি মাটিতে গড়াগড়ি দিয়ে সালাত আদায় করলাম। তারপর আমি ঘটনাটি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে বর্ণনা করলাম। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তোমার জন্য তো এতটুকুই যথেষ্ট ছিল। এ বলে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দু\'হাত মাটিতে মারলেন এবং দু\'হাতে ফুঁ দিয়ে তাঁর চেহারা ও উভয় হাত মাসেহ করলেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২৩৭। ',
        name: '  মুখমণ্ডল ও হস্তদ্বয়ে তায়াম্মুম করা',
        hadisNumberList: [
          HadisNumberModel(
            id: '৩৩২। ',
            name:
                ' হাজ্জাজ (রহঃ) .... আবদুর রহমান ইবনু আবযা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ ‘আম্মার (রাঃ)-ও এ কথা (যা পূর্বের হাদিসে বর্ণনা করা হয়েছে তা) বর্ণনা করেছেন। শু’বা (রহঃ) নিজের হস্তদ্বয় মাটিতে মেরে মুখের কাছে নিলেন (ফুঁ দিলেন)। তারপর নিজের চেহারা ও হস্তদ্বয় মাসেহ করলেন। নাযর (রহঃ) শু’বা (রহঃ) সুত্রে অনুরূপ বর্ণনা করেন। ',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ৩৩৩।',
            name:
                '  সুলায়মান ইবনু হারব (রহঃ) .... ইবনু ‘আবদুর রহমান ইবনু আবযা (রহঃ) তাঁর পিতা থকে বর্ণনা করেন যে, তিনি (‘আবদুর রহমান) ‘উমর (রাঃ) এর কাছে উপস্থিত ছিলেন, আর ‘আম্মার (রাঃ) তাঁকে বলেছিলেনঃ আমরা এক অভিযানে গিয়েছিলাম, আমরা উভয়ই জুনুবী হয়ে পড়লাম। উক্ত রেওয়ায়েতে হাত দু’টোতে ‘نَفَخَ فِيهِمَا’ এর স্থলে ‘تَفَلَ فِيهِمَا’ বলেছেন। উভয়েই সমার্থক।',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ৩৩৪।',
            name:
                '  মুহাম্মদ ইবনু কাসীর (রহঃ) ... আবদুর রহমান (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ ‘আম্মার (রাঃ) ‘উমর (রাঃ) কে বলেছিলেনঃ (আমি তায়াম্মুমের উদ্দেশ্যে) মাটিতে গড়াগড়ি দিলাম। পরে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে গেলাম। তখন তিনি বলেছিলেনঃ চেহারা ও হাত দু’টো মাসেহ করাই তোমার জন্য যথেষ্ট।',
            ref: '',
          ),
          HadisNumberModel(
            id: '৩৩৫।  ',
            name:
                'মুসলিম (ইবনু ইবরাহীম) (রহঃ) ... আবদুর রহমান (রাঃ) থেকে বর্ণিত, তিনি বলেন, আমি ‘উমর (রাঃ) –এর কাছে উপস্থিত ছিলাম, ‘আম্মার (রাঃ) তাঁকে বললেন, এর পর রাবী পূর্বের হাদিসটি বর্ণনা করেন। ',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ৩৩৬।',
            name:
                '  মুহাম্মদ ইবনু বাশশার (রহঃ) .... ইবনু ‘আবদুর রহমান ইবনু আবযা তাঁর পিতা (‘আবদুর রহমান) থেকে বর্ণনা করেন যে, ‘আম্মার (রাঃ) বলেছেনঃ রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মাটিতে হাত মারলেন এবং তাঁর চেহারা ও হস্তদ্বয় মাসেহ করলেন।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২৩৮।  ',
        name:
            'পাক মাটি মুসলিমদের উযূর পানির স্থলবর্তী। পবিত্রতার জন্য পানির পরিবর্তে এটাই যথেষ্ট। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                ' وَقَالَ الْحَسَنُ يُجْزِئُهُ التَّيَمُّمُ مَا لَمْ يُحْدِثْ. وَأَمَّ ابْنُ عَبَّاسٍ وَهُوَ مُتَيَمِّمٌ. وَقَالَ يَحْيَى بْنُ سَعِيدٍ لاَ بَأْسَ بِالصَّلاَةِ عَلَى السَّبَخَةِ وَالتَّيَمُّمِ بِهَا হাসান (রহঃ) বলেনঃ হাদস না হওয়া পর্যন্ত তাঁর জন্য তায়াম্মুমই যথেষ্ট। ইবন ‘আব্বাস (রাঃ) তায়াম্মুম করে ইমামতি করেছেন। ইয়াহইয়া ইবন সা’ঈদ (র) বলেনঃ লোনা ভূমিতে সালাত আদায় করা বা তাতে তায়াম্মুম করার কোন বাধা নেই। ৩৩৭। মুসাদ্দাদ (রহঃ) .... ইমরান (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে এক সফরে ছিলাম। আমরা রাতে চলতে চলতে শেষরাতে এক স্থনে ঘুমিয়ে পড়লাম। মুসাফিরের জন্য এর চাইতে মধুর ঘুম আর হতে পারে না। (আমরা এমন ঘোর নিদ্রায় নিমগ্ন ছিলাম যে,) সূর্যের তাপ ছাড়া অন্য কিছু আমাদের জাগাতে পারেনি। সর্বপ্রথম জাগলেন অমুক, তারপর অমুক, তারপর অমুক। (রাবী) আবূ রাজা’ (রহঃ) তাঁদের সবারই নাম নিয়েছিলেন কিন্তু ‘আওফ (রহঃ) তাঁদের নাম মনে রাখতে পারেন নি। চতুর্থবারে জেগে ওঠা ব্যাক্তি ছিলেন ‘উমর ইবনুল খাত্তাব (রাঃ)। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঘুমালে আমরা কেউ তাঁকে জাগাতাম না, যতক্ষণ তা তিনি নিজেই জেগে উঠতেন। কারণ নিদ্রাবস্থায় তাঁর উপর কি অবতীর্ণ হচ্ছে তা তো আমাদের জানানেই। ‘উমর (রাঃ) জেগে যখন মানুষের অবস্থা দেখলেন, আর তিনি ছিলেন দৃঢ়চিত্ত ব্যাক্তি—উচ্চস্বরে তাকবীর বলতে শুরু করলেন। তিনি ক্রমাগত উচ্চস্বরে তাকবীর বলতে লাগলেন। এমন কি তাঁর শব্দে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জেগে উঠলেন। তখন লোকেরা তাঁর কাছে ওজর পেশ করলো। তিনি বললেনঃ কোন ক্ষতি নেই বা বললেনঃ কোন ক্ষতি হবে না। এখান থেকে চল। তিনি চলতে লাগলেন। কিছু দূর গিয়ে থামলেন। উযূর পানি আনলেন এবং উযূ (ওজু/অজু/অযু) করলেন। সালাত (নামায/নামাজ)-এর আযান দেওয়া হল। তিনি লোকদের নিয়ে সালাত আদায় করলেন। সালাত শেষ করে দেখলেন, এক ব্যাক্তি পৃথক দাড়িয়ে আছেন। তিনি লোকদের সাথে সালাত আদায় করেন নি। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁকে জিজ্ঞাসা করলেনঃ হে অমুক! তোমাকে লোকদের সাথে সালাত আদায় করতে কিসে বাধা দিল? তিনি বললেনঃ আমার উপর গোসল ফরয হয়েছে। আথচ পানি নেই। তিনি বললেনঃ পবিত্র মাটি নাও (তায়াম্মুম কর), এটাই তোমার জন্য যথেষ্ট। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পুনরায় সফর শুরু করলেন। লোকেরা তাঁকে পিপাসার কষ্ট জানালো। তিনি অবতরণ করলেন, তারপর অমুক ব্যাক্তিকে ডাকলেন। (রাবী) আবূ রাজা’ (রহঃ) তাঁর নাম উল্লেখ করেছিলেন কিন্তু ‘আওফ (রহঃ) তা ভুলে গিয়েছেন। তিনি ‘আলী (রাঃ)-কেও ডাকলেন। তারপর উভয়কেই পানি খুজে আনতে বললেন। তাঁরা পানির খোজে বের হলেন। তাঁরা পথে এক মহিলাকে দুই মশক পানি উটের উপর করে নিতে দেখলেন। তাঁরা জিজ্ঞাসা করলেনঃ পানি কোথায়? সে বললোঃ গতকাল এ সময়ে আমি পানির নিকটে ছিলাম। আমার পাত্র পেছনে রয়ে গেছে। তাঁরা বললেনঃ এখন আমাদের সঙ্গে চলো। সে বললোঃ কোথায়? তাঁরা বললেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট। সে বললঃ সেই লোকটির কাছে যাকে সাবি’ (ধর্ম পরিবর্তনকারী) বলা হয়? তাঁরা বললেনঃ হ্যাঁ, তোমরা যাকে এই বলে থাক। আচ্ছা এখন চল। তাঁরা তাকে নিয়ে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এলেন এবং সমস্ত ঘটনা খুলে বললেন। ‘ইমরান (রাঃ) বলেনঃ লোকেরা স্ত্রীলোকটিকে তাঁর উট থেকে নামালেন। তারপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একটি পাত্র আনতে বললেন এবং উভয় মশকের মুখ খুলে তাতে পানি ঢাললেন এবং সেগুলোর মুখ বন্ধ করে দিলেন। তারপর সে মশকের নীচের মুখ খুলে দিয়ে লোকদের মধ্যে পানি পান করার ও জন্তু-জানোয়ারকে পানি পান করানোর ঘোষণা দিলেন। তাঁদের মধ্যে যার ইচ্ছা পানি পান করলেন ও জন্তুকে পান করালেন। অবশেষে যে ব্যাক্তির গোসলের দরকার ছিল, তাকেও এক পাত্র পানি দিয়ে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ এ পানি নিয়ে যাও এবং গোসল সার। ঐ মহিলা দাড়িয়ে দেখছিল যে তাঁর পানি নিয়ে কি করা হচ্ছে। আল্লাহর কসম! যখন তাঁর থেকে পানি নেয়া শেষ হল তখন আমাদের মনে হল, মশকগুলো পুর্বাপেক্ষা অধিক ভর্তি। তারপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ মহিলার জন্য কিছু একত্র কর। লোকেরা মহিলার জন্য আজওয়া (বিশেষ খেজুর), আটা ও ছাতু এনে একত্র করলেন। যখন তাঁরা উল্লেখযোগ্য পরিমাণ খাদ্যসামগ্রী জমা করলেন, তখন তা একটা কাপড়ে বেধে মহিলাকে উটের উপর সওয়ার করালেন এবং তাঁর সামনে কাপড়ে বাঁধা গাঁটরিটি রেখে দিলেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তুমি জান যে, আমার তোমার পানি মোটেই কম করিনি; বরং আল্লাহ তা’লাই আমাদের পানি পান করিয়েছেন। এরপর সে তাঁর পরিজনের কাছে ফিরে গেল। তাঁর বেশ দেরি হয়েছিল। পরিবারের লোকজন তাঁকে জিজ্ঞেসা করল, হে অমুক! তোমার এত দেরি হল কেন? উত্তরে সে বললো একটা আশ্চার্যজনক ঘটনা! দু’জন লোকের সাথে আমার দেখা হয়েছিল। তাঁরা আমাকে সেই লোকটির কাছে নিয়ে গিয়েছিল, যকে সাবি’ বলা হয়। আর সেখানে সে এসব করল। এ বলে সে মধ্যমা ও তর্যনী আঙ্গুল দিয়ে আসমান ও যমীনের দিকে ইশারা করে বলল, আল্লাহর কসম! সে এ দু’টির সবচাইতে বড় জাদুকর, নয় তো সে বাস্তবিকই আল্লাহর রাসূল। এ ঘটনার পর মুসলিমরা ওই মহিলার গোত্রের আশেপাশের মুশরিকদের উপর হামলা করতেন কিন্তু মহিলার সাথে সম্পর্কযুক্ত গোত্রের কোন ক্ষতি করতেন না। একদিন মহিলা নিজের গোত্রকে বললঃ আমার মনে হয় তারা ইচ্ছা করে তোমাদের নিষ্কৃতি দিচ্ছে। এ সব দেখে কি তোমরা ইসলামের প্রতি আকৃষ্ট হবে না? তাঁরা সবাই মহিলাটির কথা মেনে নিল এবং ইসলাম দাখিল হয়ে গেল। আবূ ‘আবদুল্লাহ (ইমাম বুখারি) (রহঃ) বলেনঃ صنباء শব্দের অর্থ নিজের দিন ছেড়ে অন্যের দিন গ্রহন করা। আবুল ‘আলিয়া (রহঃ) বলেনঃ صابئين হচ্ছে আহলে কিতাবের একটা দল, যারা যবূর কিতাব পড়ে থাকে। أصب শব্দের অর্থ ঝুকে পড়া।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২৩৯।',
        name:
            ' জুনুবী ব্যক্তির রোগ বৃদ্ধির, মৃত্যুর বা তৃষ্ণার্ত থেকে যাওয়ার আশঙ্কা বোধ হলে তায়াম্মুম করা। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                ' وَيُذْكَرُ أَنَّ عَمْرَو بْنَ الْعَاصِ أَجْنَبَ فِي لَيْلَةٍ بَارِدَةٍ فَتَيَمَّمَ وَتَلاَ: (وَلاَ تَقْتُلُوا أَنْفُسَكُمْ إِنَّ اللَّهَ كَانَ بِكُمْ رَحِيمًا) فَذَكَرَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمْ يُعَنِّفْ বর্ণিত আছে যে, এক শীতের রাতে আমর ইবনু’ল ‘আস (রাঃ) জুনুবী হয়ে পড়লে তায়াম্মুম করলেন। আর (এ প্রসঙ্গে) তিনি এই আয়াত তিলাওয়াত করলেনঃ তোমরা নিজেদের হত্যা করো না, নিশ্চই আল্লাহ তোমাদের প্রতি পরম দয়ালু। (৮ : ২৯) এরপর নবী সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম এর কাছে বিষয়টি উল্লেখ করা হলে তিনি তাকে দোষারোপ করেন নি। ৩৩৮। বিশর ইবনু খালিদ (রহঃ) ..... আবূ ওয়াইল (রহঃ) থেকে বর্ণিত, তিনি বলেনঃ আবূ মূসা (রাঃ) ‘আবদুল্লাহ ইবনু মাস’ঊদ (রাঃ)-কে জিজ্ঞেস করলেনঃ (জুনুবী) পানি না পেলে কি সালাত (নামায/নামাজ) আদায় করবে না? ‘আবদুল্লাহ (রাঃ) বললেনঃ হ্যাঁ’ আমি এক মাসও যদি পানি না পাই তবে সালাত আদায় করব না। এ ব্যাপারে লোকদের যদি অনুমতি দেই তা হলে তাঁরা একটু শীত বোধ করলেই এরূপ করতে থাকবে। অর্থাৎ তায়াম্মুম করে সালাত আদায় করবে। আবূ মূসা (রাঃ) বললেনঃ তাহলে উমর (রাঃ)-এর সামনে ‘আম্মার (রাঃ)-এর কথার তাৎপর্য কি হবে? তিনি উত্তরে বললেনঃ উমর (রাঃ) আম্মার (রাঃ)-এর কথায় সন্তুষ্ট হয়েছেন বলে আমি মনে করি না।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২৩৯।',
        name:
            '  জুনুবী ব্যক্তির রোগ বৃদ্ধির, মৃত্যুর বা তৃষ্ণার্ত থেকে যাওয়ার আশঙ্কা বোধ হলে তায়াম্মুম করা।',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ৩৩৯।',
            name:
                ' উমর ইবনু হাফস (রহঃ) .... শাকীক ইবনু সালামা (রহঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি ‘আবদুল্লাহ ইবনু মাস’ঊদ ও আবূ মূসা (রাঃ)-এর কাছে ছিলাম। তাঁকে আবূ মূসা (রাঃ) বললেনঃ হে আবূ ‘আবদুর রহমান। কেউ জুনুবী হলে যদি পানি না পায় তবে কি করবে? তখন ‘আবদুল্লাহ (রাঃ) বললেনঃ পানি না পাওয়া পর্যন্ত সালাত (নামায/নামাজ) আদায় করবে না। আবূ মূসা (রাঃ) বললেনঃ তাহলে ‘আম্মার (রাঃ) এর কথার উত্তরে আপনি কি বলবেন? তাঁকে যে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছিলেন (তায়াম্মুম করে নেওয়া) তোমার জন্য যথেষ্ট ছিল। ‘আবদুল্লাহ ইবনু মাস’ঊদ (রাঃ) বললেনঃ তুমি দেখ না উমর (রাঃ) ‘আম্মারের এই কথায় সন্তুষ্ট ছিলেন না? আবূ মূসা (রাঃ) পুনরায় বললেনঃ ‘আম্মারের কথা বাদ দিলেও তায়াম্মুমের আয়াতের কি ব্যাখ্যা করবেন? ‘আবদুল্লাহ (রাঃ) এর কোন উত্তর দিতে পারলেন না। তিনি তবুও বললেনঃ আমরা যদি লোকদের তার অনুমতি দিয়ে দেই তাহলে আশঙ্কা হয়, কারো কাছে পানি ঠাণ্ডা মনে হলেই তায়াম্মুম করবে। রাবী আ’মাশ (রহঃ) বলেনঃ আমি শাকীক (রহঃ)-কে প্রশ্ন করলাম, আবদুল্লাহ (রাঃ) এ কারণে কি তায়াম্মুম অপছন্দ করেছিলেন? তিনি বললেনঃ হ্যাঁ। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২৪০। ',
        name: ' তায়াম্মুমের জন্য মাটিতে একবার হাত মারা ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ৩৪০।',
            name:
                ' মুহাম্মদ ইবনু সালাম (রহঃ) .... শাকীক (রহঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি ‘আবদুল্লাহ (ইবনু মাস’ঊদ) ও আবূ মূসা আশ’আরী (রাঃ)-এর সঙ্গে বসা ছিলাম। আবূ মূসা (রাঃ) ‘আবদুল্লাহ (রাঃ)-কে বললেনঃ কোন ব্যাক্তির জুনুবী হলে সে যদি এক মাস পর্যন্ত পানি না পায়, তাহলে কি সে তায়াম্মুম করে সালাত (নামায/নামাজ) আদায় করবে না? শাকীক (রহঃ) বলেন, আবদুল্লাহ (রাঃ) বলেছেনঃ একমাস পানি না পেলেও সে তায়াম্মুম করবে না। তখন তাঁকে আবূ মূসা (রাঃ) বললেনঃ তাহলে সূরা মায়িদার এ আয়াত সম্পর্কে কি করবেন যে "পানি না পেলে পাক মাটি দিয়ে তায়াম্মুম করবে" (৫ : ৬)। ‘আবদুল্লাহ (রাঃ) জওয়াব দিলেনঃ মানুষকে সেই অনুমতি দিলে অবস্থা এমন পর্যায়ে পৌঁছার সম্ভবনা রয়েছে যে, সামান্য ঠাণ্ডা লাগলেই লোকেরে মাটি দ্বারা তায়াম্মুম করবে। আমি বললামঃ আপনারা এ জন্যই কি তা অপছন্দ করেন? তিনি জওয়াব দিলেন, হ্যাঁ। আবূ মূসা (রাঃ) বললেনঃ আপনি কি উমর ইবনু খাত্তব (রাঃ)-এর সম্মুখে ‘আম্মার (রাঃ)-এর এ কথা শোনেন নি যে, আমাকে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একটা প্রয়জনে বাইরে পাঠিয়েছিলেন। সফরে আমি জুনুবী হয়ে পড়লাম এবং পানি পেলাম না। এজন্য আমি জন্তুর মত মাটিতে গড়াগড়ি দিলাম। পরে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে ঘটনাটি বিবৃত করলাম। তখন তিনি বললেনঃ তোমার জন্য তো এতুকুই যথেষ্ট ছিল—এই বলে তিনি দু’হাত মাটিতে মারলেন। তারপর তা ঝেড়ে নিলেন এবং তা দিয়ে তিনি বাম হাতে ডান হাতের পিঠ মাসেহ করলেন কিংবা রাবী বলেছেন, বাম হাতের পিঠ ডান হাতে মাসেহ করলেন। তারপর হাত দুটো দিয়ে তাঁর মুখমণ্ডল মাসেহ করলেন। ‘আবদুল্লাহ (রাঃ) বললেনঃ আপনি দেখেন নি যে দেখ না উমর (রাঃ) ‘আম্মার (রাঃ)-এর কথায় সন্তুষ্ট হন নি? ইয়া’লা (রহঃ) আ’মাশ (রহঃ) থেকে এবং তিনি শাকীক (রহঃ) থেকে আরো বলেছেন যে , তিনি বললেনঃ আমি ‘আবদুল্লাহ (রাঃ) ও আবূ মূসা (রাঃ)-এর কাছে হাযির ছিলাম; আবূ মূসা (রাঃ) বলেছিলেনঃ আপনি ‘উমর (রাঃ) থেকে ‘আম্মারের এ কথা শোনেন নি যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে ও আপনাকে বাইরে পাঠিয়েছিলেন। তখন আমি জুনুবী হয়ে গিয়ে মাটিতে গড়াগড়ি দিয়েছিলাম। তারপর আমরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এসে এ বিষয় তাঁকে জানালাম। তখন তিনি বললেনঃ তোমার জন্য এই যথেষ্ট ছিল—এ বলে তিনি তাঁর মুখমণ্ডল এবং দু’হাত একবার মাসেহ করলেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২৪১।',
        name: ' পরিচ্ছেদ নাই। ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৩৪১। ',
            name:
                '  আবদান (রহঃ) .... আবূ রাজা’ (রহঃ) থেকে বর্ণিত, তিনি বলেনঃ ‘ইমরান ইবনু হুসায়ন আল-খুযা’ঈ (রাঃ) বলেছেন যে। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক ব্যাক্তিকে জামা’আতে সালাত (নামায/নামাজ) আদায় না করে পৃথক দাড়িয়ে থাকতে দেখলেন। তিনি লোকটিকে ডেকে বললেনঃ হে অমুক! তুমি জামা’আতে সালাত আদায় করলে না কেন? লোকটি বললোঃ ইয়া রাসূলাল্লাহ! আমার গোসলের প্রয়োজন হয়েছিল, কিন্তু পানি নেই। তিনি বললেনঃ তুমি পবিত্র মাটির ব্যবহার (তায়াম্মুম) করবে। তা-ই তোমার জন্য যথেষ্ট।',
            ref: '',
          ),
        ]),
  ];
  List<PorichedModel> chapterEight = [
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২৪২।',
        name: ' মি’রাজে কিভাবে সালাত ফরজ হল? ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'وَقَالَ ابْنُ عَبَّاسٍ حَدَّثَنِي أَبُو سُفْيَانَ فِي حَدِيثِ هِرَقْلَ فَقَالَ يَأْمُرُنَا- يَعْنِي النَّبِيَّ- صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالصَّلاَةِ وَالصِّدْقِ وَالْعَفَافِ ইবন ‘আব্বাস (রাঃ) বলেনঃ আমার কাছে আবূ সুফিয়ান ইবন হারব (রাঃ) হিরাকল-এর হাদীসে বর্ণনা করেছেন। তাতে তিনি এ কথাও বলেছেন যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমদেরকে সালাত, সত্যবাদিতা ও চারিত্রিক পবিত্রতার নির্দেশ দিয়েছেন। ৩৪২। ইয়াহইয়া ইবনু বুকায়র (রহঃ) ... আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আবূ যার (রাঃ) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণনা করেন যে, তিনি বলেছেনঃ আমার ঘরের ছাদ খুলে দেয়া হল। তখন আমি মক্কায় ছিলাম। তারপর জিবরীল (আঃ) এসে আমার বক্ষ বিদীর্ণ করলেন। আর তা যমযমের পানি দিয়ে ধুইলেন। এরপর হিকমত ও ঈমানে পরিপূর্ণ একটি সোনার পাত্র নিয়ে আসলেন এবং তা আমার বক্ষে ঢেলে দিয়ে বন্ধ করে দিলেন। তারপর হাত ধরে আমাকে দুনিয়ার আসমানের দিকে নিয়ে চললেন। যখন দুনিয়ার আসমানে পৌঁছালাম, তখন জিবরীল (আঃ) আসমানের রক্ষককে বললেনঃ দরযা খোল। তিনি বললেনঃ কে? উত্তর দিলেনঃ আমি জিবরীল, আবার জিজ্ঞাসা করলেনঃ আপনার সঙ্গে আর কেউ আছে কি? তিনি বললেনঃ হ্যাঁ, আমার সঙ্গে মুহাম্মদ। তিনি আবার বললেনঃ তাঁকে কি আহবান করা হয়েছে? তিনি উত্তরে বললেনঃ হাঁ। তারপর আসমান খোলা হলে আমরা প্রথম আসমানে উঠলাম। সেখানে দেখলাম, এক লোক বসে আছেন এবং অনেকগুলো মানুষের আকৃতি তাঁর ডান পাশে রয়েছে এবং অনেকগুলো মানুষের আকৃতি বাম পাশেও রয়েছে। যখন তিনি ডান দিকে তাকাচ্ছেন, হাসছেন আর যখন তিনি বাম দিকে তাকাচ্ছেন, কাঁদছেন। তিনি বললেনঃ খোশ আমদেদ, হে পুণ্যবান নবী! হে নেক সন্তান! আমি জিবরীল (আঃ) কে জিজ্ঞাসা করলামঃ ইনি কে? তিনি বললেনঃ ইনি আদম (আঃ)। আর তাঁর ডানে ও বায়ে তাঁর সন্তানদের রুহ। ডান দিকের লোকেরা জান্নাতী আর বা দিকের লোকেরা জাহান্নামী। এজন্য তিনি ডান দিকে তাকালে হাসেন আর বাঁ দিকে তাকালে কাঁদেন। তারপর জিবরীল (আঃ) আমাকে সঙ্গে নিয়ে দ্বিতীয় আকাশে উঠলেন। সেখানে উঠে রক্ষক কে বললেনঃ দরযা খোল। তখন রক্ষক প্রথম আসমানের রক্ষকের অনুরুপ প্রশ্ন করলেন। তারপর দরযা খুলে দিলেন। আনাস (রাঃ) বলেনঃ এরপর আবূ যার বলেনঃ তিনি (নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) আসমানসমূহে আদম (আঃ), ঈদরীস (আঃ), মূসা (আঃ), ‘ঈসা (আঃ), ও ইবরাহীম (আঃ)-কে পেলেন। আবূ যার (রাঃ) তাঁদের অবস্থান নির্দিষ্ট ভাবে বলেন নি। কেবল এতটুকু বলেছেন যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আদম (আঃ)-কে প্রথম আসমানে এবং ইবরাহীম (আঃ)-কে ষষ্ট আসমানে পেয়েছেন। আনাস (রাঃ) বলেনঃ যখন জিবরীল (আঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে ইদরীস (আঃ) এর পাশ দিয়ে নিয়ে যাচ্ছিলেন, তখন ঈদরীস (আঃ) বললেনঃ খোশ আমদেদ! পুণ্যবান নবী ও নেক ভাই! আমি জিজ্ঞাসা করলাম ইনি কে? জিবরীল (আঃ) বললেনঃ ইনি ঈদরীস (আঃ)। তারপর আমি মূসা (আঃ) এর নিকট দিয়ে যাচ্ছিলাম। তিনি বললেনঃ খোশ আমদেদ! পূণ্যবান রাসূল ও নেক ভাই। আমি বললাম ইনি কে? জিবরীল (আঃ) বললেনঃ মূসা (আঃ)। তারপর আমি ঈসা (আঃ) এর নিকট দিয়ে যাচ্ছিলাম। তিনি বললেনঃ খোশ আমদেদ! পুণ্যবান রাসূল ও নেক ভাই। আমি জিজ্ঞাসা করলাম ইনি কে? জিবরীল (আঃ) বললেনঃ ইনি ঈসা (আঃ)। তারপর ইবরাহীম (আঃ) এর নিকট দিয়ে যাচ্ছিলাম। তিনি বললেনঃ খোশ আমদেদ! পুণ্যবান নবী ও নেক সন্তান। আমি জিজ্ঞাসা করলাম ইনি কে? জিবরীল (আঃ) বললেনঃ ইনি ইবরাহীম (আঃ)। ইবনু শিহাব (রহঃ) বলেন যে, ইবনু হাযম আমাকে খবর দিয়েছেন ইবনু আব্বাস ও আবূ হাব্বা আনসারী (রাঃ) উভয়ে বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তারপর আমাকে আরো উপরে উঠানো হল, আমি এমন এক সমতল স্থানে উপনীত হলাম, যেখান থেকে কলমের লেখার শব্দ শুনতে পেলাম। ইবনু হাযম (রহঃ) ও আনাস ইবনু মালিক (রাঃ) বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তারপর আল্লাহ তা’আলা আমার উম্মতের উপর পঞ্চাশ ওয়াক্ত সালাত (নামায/নামাজ) ফরয করে দিলেন। আমি এ নিয়ে প্রত্যাবর্তনকালে যখন মূসা (আঃ) এর নিকট দিয়ে যাচ্ছিলাম, তখন মূসা (আঃ) বললেনঃ আপনার উম্মতের উপর আল্লাহ কি ফরয করেছেন? আমি বললামঃ পঞ্চাশ ওয়াক্ত সালাত ফরয করেছেন। তিনি বললেনঃ আপনি আপনার রবের কাছে ফিরে যান। কারণ আপনার উম্মত তা আদায় করতে সক্ষম হবে না। আমি ফিরে গেলাম। আল্লাহ পাক কিছু অংশ কমিয়ে দিলেন। আমি মূসা (আঃ) এর কাছে আবার গেলাম আর বললামঃ কিছু অংশ কমিয়ে দিয়েছেন। তিনি বললেনঃ আপনি আবার আপনার রবের কাছে যান। কারণ আপনার উম্মত এও আদায় করতে সক্ষম হবে না। আমি ফিরে গেলাম। তখন আরো কিছু অংশ কমিয়ে দেওয়া হল। আবার মূসা (আঃ) এর কাছে গেলাম, এবারো তিনি বললেনঃ আপনি আবার আপনার রবের কাছে যান। কারণ আপনার উম্মত এও আদায় করতে সক্ষম হবে না। তখন আমি আবার গেলাম, তখন আল্লাহ বললেনঃ এই পাঁচই (সওয়াবের দিক দিয়ে) পঞ্চাশ (গণ্য হবে)। আমার কথার কোন পরিবর্তন নেই। আমি আবার মূসা (আঃ) এর কাছে আসলে তিনি আমাকে আবারো বলললেনঃ আপনার রবের কাছে আবার যান। আমি বললামঃ আবার আমার রবের কাছে যেতে আমি লজ্জাবোধ করছি। তারপর জিবরীল(আঃ) আমাকে সিদরাতুল মুনতাহা পর্যন্ত নিয়ে গেলেন। আর তখন তা বিভিন্ন রঙে ঢাকা ছিল, যার তাৎপর্য আমার জানা ছিল না। তারপর আমাকে জান্নাতে নিয়ে যাওয়া হল। আমি দেখলাম তাতে মুক্তার হার রয়েছে আর তাঁর মাটি কস্তুরি। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '৩৪৩। ',
            name:
                ' আবদুল্লাহ ইবনু ইউসুফ (রহঃ)......... উম্মু’ল মু’মিনীন ‘আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আল্লাহ তা’আলা মুকীম অবস্থায় ও সফরে দুই রাক’আত করে সালাত (নামায/নামাজ) ফরয করেছিলেন ।পরে সফরে সালাত (নামায/নামাজ) পূর্বের মত রাখা হল আর মুকীম অবস্থায় সালাত (নামায/নামাজ) বৃদ্ধি করা হল। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২৪৩। ',
        name: ' সালাত আদায়ের সময় কাপড় পরার প্রয়জনীয়তা। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'وَقَوْلِ اللَّهِ تَعَالَى: (خُذُوا زِينَتَكُمْ عِنْدَ كُلِّ مَسْجِدٍ). وَمَنْ صَلَّى مُلْتَحِفًا فِي ثَوْبٍ وَاحِدٍ، وَيُذْكَرُ عَنْ سَلَمَةَ بْنِ الأَكْوَعِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «يَزُرُّهُ وَلَوْ بِشَوْكَةٍ». فِي إِسْنَادِهِ نَظَرٌ، وَمَنْ صَلَّى فِي الثَّوْبِ الَّذِي يُجَامِعُ فِيهِ مَا لَمْ يَرَ أَذًى، وَأَمَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ لاَ يَطُوفَ بِالْبَيْتِ عُرْيَانٌ আল্লাহ তা’আলা ইরশাদ করেন- (خُذُوا زِينَتَكُمْ عِنْدَ كُلِّ مَسْجِدٍ) "তোমরা প্রত্যেক সালাতের সময় সুন্দর পরিচ্ছদ পরিধান করবে" (৭ : ৩১)। এক বস্ত্র শরীরে জড়িয়ে সালাত আদায় করা। সালামা ইবনুল আকওয়া’ (রা) থেকে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা জামায় বোতাম লাগিয়ে নাও এমন কি কাটা দিয়ে হলেও। এই হাদীসের সনদ সম্পর্কে কথা আছে। যে কাপড় পরে স্ত্রী সহবাস করা হয়েছে তাতে কোন নাপাকি দেখা না গেলে তা পরিধান করে সালাত আদায় করা যায়। আর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নির্দেশ দিয়েছেন যে, উলঙ্গ অবস্থায় যেন কেউ বায়তুল্লাহর তাওয়াফ না করে। ৩৪৪। মূসা ইবনু ইসমাঈল (রহঃ) ..... উম্মে আতিয়্যা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঈদের দিনে ঋতুবতী এবং পর্দানশীন মহিলাদের বের করে আনার নির্দেশ দিলেন, যাতে তাঁরা মুসলিমদের জামা’আত ও দু’আয় শরীক হতে পারে। অবশ্য ঋতুবতী মহিলারা সালাত (নামায/নামাজ)-এর স্থান থেকে দূরে থাকবে। এক মহিলা বললেনঃ ইয়া রাসূলাল্লাহ! আমাদের কারো কারো ওড়না নেই। তিনি বললেনঃ তাঁর সাথীর উচিত তাঁকে নিজের ওড়না থেকে পরিয়ে দেওয়া। আবদুল্লাহ ইবনু রাজা (রহঃ) সুত্রে উম্মে ‘আতিয়্যা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে এরূপ বলতে শুনেছি। باب وُجُوبِ الصَّلاَةِ فِي الثِّيَابِ حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا يَزِيدُ بْنُ إِبْرَاهِيمَ، عَنْ مُحَمَّدٍ، عَنْ أُمِّ عَطِيَّةَ، قَالَتْ أُمِرْنَا أَنْ نُخْرِجَ، الْحُيَّضَ يَوْمَ الْعِيدَيْنِ وَذَوَاتِ الْخُدُورِ، فَيَشْهَدْنَ جَمَاعَةَ الْمُسْلِمِينَ وَدَعْوَتَهُمْ، وَيَعْتَزِلُ الْحُيَّضُ عَنْ مُصَلاَّهُنَّ‏.‏ قَالَتِ امْرَأَةٌ يَا رَسُولَ اللَّهِ، إِحْدَانَا لَيْسَ لَهَا جِلْبَابٌ‏.‏ قَالَ ‏ "‏ لِتُلْبِسْهَا صَاحِبَتُهَا مِنْ جِلْبَابِهَا ‏"‏‏.‏ وَقَالَ عَبْدُ اللَّهِ بْنُ رَجَاءٍ حَدَّثَنَا عِمْرَانُ، حَدَّثَنَا مُحَمَّدُ بْنُ سِيرِينَ، حَدَّثَتْنَا أُمُّ عَطِيَّةَ، سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم بِهَذَا‏.‏ ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২৪৪।  ',
        name: 'সালাতে কাঁধে তহবন্দ বাঁধা। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'وَقَالَ أَبُو حَازِمٍ عَنْ سَهْلٍ صَلَّوْا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَاقِدِي أُزْرِهِمْ عَلَى عَوَاتِقِهِمْ আর আবূ হাযিম (রহঃ) সাহল ইবন সা’দ (রাঃ) থেকে বর্ণনা করেন যে, সাহাবায়ে কিরাম নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে তহবন্দ কাঁধে বেঁধে সালাত আদায় করেছিলেন ৩৪৫। আহমদ ইবনু ইউনুস (রহঃ) ..... মুহাম্মদ ইবনুল মুনকাদির (রহঃ) থেকে বর্ণিত, তিনি বলেনঃ একদা জাবির (রাঃ) কাঁধে তহবন্দ বেঁধে সালাত (নামায/নামাজ) আদায় করেন। আর তাঁর কাপড় (জামা) আলনায় রক্ষিত ছিল। তখন তাঁকে এক ব্যাক্তি বললঃ আপনি যে এক তহবন্দ পরে সালাত আদায় করলেন? তিনি উত্তরে বললেনঃ তোমার মত আহাম্মকদের দেখানোর জন্য আমি এরূপ করেছি। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর যুগে আমাদের মধ্যে কারই বা দু’টো কাপড় ছিল? ',
            ref: '',
          ),
          HadisNumberModel(
            id: '৩৪৬। ',
            name:
                ' মুতাররিফ আবূ মূসা’আব (রহঃ) .... মুহাম্মদ ইবনুল মুনকাদির (রহঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি জাবির (রাঃ)-কে এক কাপড়ে সালাত (নামায/নামাজ) আদায় করতে দেখেছি। আর তিনি বলেছেনঃ আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে এক কাপড়ে সালাত (নামায/নামাজ) আদায় করতে দেখেছি। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২৪৫। ',
        name: '  এক কাপড় গায়ে জড়িয়ে সালাত আদায় করা করা।',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'قَالَ الزُّهْرِيُّ فِي حَدِيثِهِ الْمُلْتَحِفُ الْمُتَوَشِّحُ، وَهْوَ الْمُخَالِفُ بَيْنَ طَرَفَيْهِ عَلَى عَاتِقَيْهِ، وَهْوَ الاِشْتِمَالُ عَلَى مَنْكِبَيْهِ. قَالَ وَقَالَتْ أُمُّ هَانِئٍ الْتَحَفَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِثَوْبٍ، وَخَالَفَ بَيْنَ طَرَفَيْهِ عَلَى عَاتِقَيْهِ যুহরী (রহঃ) তাঁর হাদীসে বর্ণনা করেছেন যে, ملٔتحف এর অর্থ متوشح -অর্থাৎ যে চাদরের উভয় অংশ বিপরীত কাঁধে রাখে। এভাবে কাঁধের উপর চাদর রাখাকে ইশতিমাল বলে। উম্মে হানী (রাঃ) বলেন যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক চাদর গায়ে দিলেন এবং তিনি চাদরের উভয় প্রান্ত বিপরীত কাঁধে রাখলেন। ৩৪৭। উবায়দুল্লাহ ইবনু মূসা (রহঃ) .... উমর ইবনু আবূ সালামা (রাঃ) থেকে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক কাপড় পরে সালাত (নামায/নামাজ) আদায় করলেন, আর তাঁর উভয় প্রান্ত বিপরীত দিকে রাখলেন। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '৩৪৮। ',
            name:
                '  মুহাম্মদ ইবনুল মূসান্না (রহঃ)......... উমর ইবনু আবূ সালামা (রাঃ) থেকে বর্ণিত যে, তিনি রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে উম্মে সালামা (রাঃ)-এর ঘরে এক কাপড়ে সালাত (নামায/নামাজ) আদায় করতে দেখেছেন। তিনি [রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম] সে কাপড়ের উভয় প্রান্ত নিজের উভয় কাঁধে রেখেছিলেন।',
            ref: '',
          ),
          HadisNumberModel(
            id: '৩৪৯।  ',
            name:
                'উবায়দ ইবনু ইসমা’ঈল (রহঃ) ..... উমর ইবনু আবূ সালামা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে এক কাপড় জড়িয়ে উম্মে সালামা (রাঃ)-এর ঘরে এক কাপড়ে সালাত (নামায/নামাজ) আদায় করতে দেখেছি, যার উভয় প্রান্ত তাঁর উভয় কাঁধের উপর রেখেছিলেন। ',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ৩৫০।',
            name:
                ' ইসমা’ঈল ইবনু আবূ উওয়ায়স (রহঃ) .... উম্মে হানী বিনত আবূ তালিব (রাঃ) বলেনঃ আমি বিজয়ের বছর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে গিয়ে দেখলাম যে, তিনি গোসল করছেন আর তাঁর মেয়ে ফাতিমা (রাঃ) তাঁকে পর্দা করে রখেছেন। তিনি বলেনঃ আমি তাঁকে সালাম দিলাম। তিনি জিজ্ঞাসা করলেনঃ এ কে? আমি উত্তর দিলামঃ আমি উম্মে হানী বিনত আবূ তালিব। তিনি বললেনঃ মারহাবা, হে উম্মে হানী! গোসল করার পরে তিনি এক কাপড় জড়িয়ে আট রাক’আত সালাত (নামায/নামাজ) আদায় করলেন। সালাত শেষ করলে তাঁকে আমি বললামঃ ইয়া রাসূলাল্লাহ! আমার সহোদর ভাই [‘আলী ইবনু আবূ তালিব (রাঃ)] এক লোককে হত্যা করতে চায়, অথচ আমি সে লোকটিকে আশ্রয় দিয়েছি। সে লোকটি হুবায়রার ছেলে অমুক। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ হে উম্মে হানী! তুমি যাকে আশ্রয় দিয়েছ, আমিও তাঁকে আশ্রয় দিলাম। উম্মে হানী (রাঃ) বলেনঃ তখন ছিল চাশতের সময়। ',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ৩৫১।',
            name:
                ' আবদুল্লাহ ইবনু ইউসুফ (রহঃ) ..... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত যে, এক ব্যাক্তি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে এক কাপড়ে সালাত (নামায/নামাজ) আদায়ের হুকুম জিজ্ঞাসা করল। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উত্তরে বললেনঃ তোমাদের প্রত্যেকের কি দু’টি করে কাপড় আছে? ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২৪৬।',
        name:
            ' কেউ এক কাপড়ে সালাত আদায় করলে সে যেন উভয় কাঁধের উপর (কিছু অংশ) রাখে ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৩৫২। ',
            name:
                ' আবূ ‘আসিম (রহঃ) ..... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তোমাদের কেউ এক কাপড়ে পরে এমনভাবে যেন সালাত (নামায/নামাজ) আদায় না করে যে, তার উভয় কাঁধে এর কোন অংশ নেই। ',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ৩৫৩।',
            name:
                ' আবূ নু’আয়ম (রহঃ) ... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি সাক্ষ্য দিচ্ছি যে আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছিঃ যে ব্যাক্তি এক কাপড়ে সালাত (নামায/নামাজ) আদায় করে, সে যেন কাপড়ের দু’প্রান্ত বিপরীত পার্শ্বে রাখে। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২৪৭।  ',
        name: ' কাপড় যদি সংকীর্ণ হয়',
        hadisNumberList: [
          HadisNumberModel(
            id: '৩৫৪।  ',
            name:
                'ইয়াহইয়া ইবনু সালিহ (রহঃ)...... সা’ঈদ ইবনু হারিস (রহঃ) থেকে বর্ণিত, তিনি বলেনঃ আমরা জাবির ইবনু ‘আবদুল্লাহ (রাঃ)-কে এক কাপড়ে সালাত (নামায/নামাজ) আদায় করা সম্পর্কে জিজ্ঞাসা করেছিলাম। তিনি বললেনঃ আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সঙ্গে কোন সফরে বের হয়েছিলাম। এক রাতে আমি কোন প্রয়োজনে তাঁর কাছে গেলাম। দেখলাম, তিনি সালাত (নামায/নামাজ) রত আছেন। তখন আমার শরীরে মাত্র একখানা কাপড় ছিল। আমি কাপড় দিয়ে শরীর জড়িয়ে নিলাম আর তাঁর পার্শ্বে সালাত (নামায/নামাজ) দাঁড়ালাম। তিনি সালাত (নামায/নামাজ) শেষ করে জিজ্ঞাসা করলেনঃ জাবির! রাতের বেলা আসার কারণ কি? তখন আমি তাঁকে আমার প্রয়োজনের কথা জানালাম। আমার কাজ শেষ হলে তিনি বললেনঃ এ কিরূপ জড়ানো অবস্থায় তোমকে দেখলাম? আমি বললামঃ কাপড় একটই ছিল (তাই এভাবে করেছি)। তিনি বললেনঃ কাপড় যদি বড় হয়, তাহলে শরীরে জড়িয়ে পরবে। আর যদি ছোট হয়, তাহলে তহবন্দরূপে ব্যাবহার করবে। ',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ৩৫৫।',
            name:
                '  মূসা’দ্দাদ (রহঃ) .... সাহল (রাঃ) থেকে বর্ণিত যে, লোকেরা বাচ্চাদের মত নিজেদের তহবন্দ কাঁধে বেঁধে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে সালাত (নামায/নামাজ) আদায় করতেন। আর মহিলাদের প্রতি নির্দেশ ছিল যে, তাঁরা যেন পুরুষদের ঠিকমত বসে যাওয়ার পূর্বে সিজদা থেকে মাথা না উঠায়।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২৪৮। ',
        name: ' শামী জুব্বা পরে সালাত আদায় করা। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'وَقَالَ الْحَسَنُ فِي الثِّيَابِ يَنْسُجُهَا الْمَجُوسِيُّ لَمْ يَرَ بِهَا بَأْسًا. وَقَالَ مَعْمَرٌ رَأَيْتُ الزُّهْرِيَّ يَلْبَسُ مِنْ ثِيَابِ الْيَمَنِ مَا صُبِغَ بِالْبَوْلِ. وَصَلَّى عَلِيٌّ فِي ثَوْبٍ غَيْرِ مَقْصُورٍ হাসান (রহঃ) বলেনঃ মাজূসী (অগ্নিপূজক)-দের তৈরি কাপড়ে সালাত আদায় করার কোন ক্ষতি নেই। আর মা’মার (রহ") বলেনঃ আমি যুহরী (রহঃ)-কে ইয়ামানের তৈরি কাপড়ে সালাত আদায় করতে দেখেছি, যা পেশাবের (কাপড় ধৌত করার পরও পেশাবের দাগ যায়নি এমন কাপড়) দ্বারা রঞ্জিত ছিল। ‘আলী ইবন আবূ তালিব (রাঃ) অধোয়া নতুন কাপড়ে সালাত আদায় করতেন। ৩৫৬। ইয়াহইয়া (রহঃ) .... মুগীর ইবনু শু’বা থেকে বর্ণিত, তিনি বলেনঃ আমি কোন এক সফরে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে ছিলাম। তিনি বললেনঃ হে মুগীরা! লোটাটি লও। আমি তা নিলাম। তিনি আমার দৃষ্টির বাইরে গিয়ে প্রয়োজন সমাধা করলেন। তখন তাঁর দেহে ছিল শামী জুব্বা। তিনি জুব্বার আস্তিন থেকে হাত বের করতে চাইলেন। কিন্তু আস্তিন সংকীর্ণ হওয়ায় তিনি নিচের দিক দিয়ে হাত বের করলেন। আমি পানি ঢেলে দিলাম এবং তিনি সালাতের উযূর ন্যায় উযূ (ওজু/অজু/অযু) করলেন। আর তাঁর উভয় মোজার উপর মাসেহ করলেন ও পরে সালাত (নামায/নামাজ) আদায় করলেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২৪৯। ',
        name: ' সালাতে ও তার বাইরে বিবস্ত্র হওয়া অপছন্দনীয় ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৩৫৭।  ',
            name:
                'মাতার ইবনু ফযল (রহঃ) ... জাবির ইবনু ‘আবদুল্লাহ (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (নবুওয়াতের পূর্বে) কুরাইশদের সাথে কাবার (মেরামতের) জন্য পাথর তুলে দিচ্ছিলেন। তাঁর পরনে ছিল লুঙ্গী। তাঁর চাচা ‘আব্বাস (রাঃ) তাঁকে বললেন; ভাতিজা! তুমি লুঙ্গী খুলে কাঁধে পাথরের নীচে রাখলে ভাল হত। জাবির (রাঃ) বলেনঃ তিনি লুঙ্গী খুলে কাঁধে রাখলেন এবং তৎক্ষণাত বেহুশ হয়ে পড়লেন। এরপর তাঁকে আর কখনও বিবস্ত্র অবস্থাই দেখা যায়নি। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২৫০।',
        name: '  জামা, পায়জামা, জাঙ্গিয়া কাবা পরে সালাত আদায় করা',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ৩৫৮। ',
            name:
                'সুলায়মান ইবনু হারব (রহঃ) .... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ এক ব্যাক্তি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে দাঁড়িয়ে এক কাপড়ে সালাত (নামায/নামাজ) আদায়ের হুকুম জিজ্ঞাসা করল। তিনি বললেনঃ তোমাদের প্রত্যেকের কাছে কি দু’খানা করে কাপড় আছে? এরপর এক ব্যাক্তি ‘উমর (রাঃ)-কে জিজ্ঞাসা করল। তিনি বললেনঃ আল্লাহ যখন তোমাদের সামর্থ্য দিয়েছেন তখন তোমরাও নিজেদের সামর্থ্য প্রকাশ কর। লোকেরা যেন পুরো পোশাক একত্রে পরিধান করে অর্থাৎ মানুষ তহবন্দ ও চাঁদর, তহবন্দ ও জামা, তহবন্দ ও কাবা*, পায়জামা ও চাঁদর, পায়জামা ও জামা, পায়জামা ও কাবা, জাঙ্গিয়া ও কাবা, জাঙ্গিয়া ও জামা পরে সালাত আদায় করে। আবূ হুরায়রা (রাঃ) বলেন যে, আমার মনে হয় ‘উমর (রাঃ) জাঙ্গিয়া ও চাঁদরের কথাও বলেছিলেন। * কাবাঃ সাধারণত জামার উপরিভাগে যে ঢিলেঢালা জুব্বা/আচকান পরা হয়। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '৩৫৯। ',
            name:
                ' আসিম ইবনু ‘আলী (রহঃ) ... ইবনু ‘উমর (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ এক ব্যাক্তি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে জিজ্ঞাসা করলো, ইহরামকারী কি পরিধান করবে? তিনি বললেনঃ সে জামা পরবে না, পায়জামা পরবে না, টুপি পরবে না, যাফরান বা ওয়ারস* রঙে রঞ্জিত কাপড় পরবে না। আর জুতা না পেলে মোজা পরবে। তবে তা পায়ের গিরার নীচে পর্যন্ত কেটে নেবে। নাফি’ (রহঃ) ইবনু ‘উমর (রাঃ) সুত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে অনুরূপ বর্ণনা করেছেন। *ওয়ারসঃ এক প্রকার হলুদ রঙের তৃণ জাতীয় সুগন্ধি। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২৫১।',
        name: '  লজ্জাস্থান ঢাকা',
        hadisNumberList: [
          HadisNumberModel(
            id: '৩৬০। ',
            name:
                ' কুতায়বা (রহঃ) .... আবূ সা’ঈদ খুদরী (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইশতিমালে সাম্মা* এবং কাপড়ে ইহতিবা* করতে নিষেধ করেছেন যাতে তাঁর লজ্জাস্থানে কাপড়ের কোন অংশ না থাকে। *সাম্মাঃ একই কাপড়ে সমস্ত শরীর এমনভাবে জড়ানো যাতে হাত-পা নাড়াচাড়া করতে অসুবিধা হয়। *ইহতিবাঃ পা ও হাঁটু দাড় করিয়ে বাহু বা কাপড় দিয়ে তা এমন ভাবে বেষ্টন করে নিতম্বের উপর বসা যাতে লজ্জাস্থান খুলে যাওয়ার আশংকা থাকে। ',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ৩৬১। ',
            name:
                'কাবীসা ইবনু ‘উকবা (রহঃ) ... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দু’ধরনের ক্রয়-বিক্রয় নিষেধ করেছেন। তা হল লিমাস ও নিবায* আর ইশ্তিমালে সাম্মা এবং এক কাপড়ে ইহতিবা করতে নিষেধ করেছেন। *জাহিলী যুগের ক্রয়-বিক্রয়ের দু’টি পদ্ধতি। লিমাস বলতে ক্রেতা কতৃক কোন বস্তুকে স্পর্শ করামত্র অনিচ্ছা সত্ত্বেও ক্রয় করতে বাধ্য হওয়া বুঝায়। আর নিবায বলতে ক্রেতা বা বিক্রেতা কতৃক কোন বস্তুর উপর পাথর ছুড়ে মারামাত্র অনিচ্ছা সত্ত্বেও ক্রয় করতে বাধ্য হওয়া বুঝায় (বুখারী ১ম খণ্ড, হাশিয়া নং৪ পৃ ৫৬)। বিস্তারিত জানার জন্য ক্রয়-বিক্রয় (بيع) অধ্যায় দেখুন। ',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ৩৬২। ',
            name:
                'ইসহাক (রহঃ) .... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমাকে আবূ বকর (রাঃ) [যখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর পক্ষ থেকে তাঁকে হাজ্জের আমীর বানানো হয়েছিল] কুরবানীর দিন ঘোষকদের সাথে মিনায় এ ঘোষণা করার জন্য পাঠালেন যে, এ বছরের পরে কোন মুশরিক বায়তুল্লাহর হাজ্জ (হজ্জ) করতে পারবে না। আর কোন উলঙ্গ লোকও বায়তুল্লাহ তাওয়াফ করতে পারবে না। হুমায়দ ইবনু ‘আবদুর রহমান (রহঃ) বলেনঃ এরপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আলী (রাঃ)-কে আবূ বকর (রাঃ) এর পেছনে প্রেরণ করেন আর তাঁকে সুরা বারাআতের (প্রথম অংশের) ঘোষণা করার নির্দেশ দেন। আবূ হুরায়রা (রাঃ) বলেনঃ তখন আমাদের সঙ্গে ‘আলী (রাঃ) কুরবানীর দিন মিনায় ঘোষণা দেন যে, এ বছরের পর থেকে আর কোন মুশরিক হাজ্জ (হজ্জ) করতে পারবে না এবং কোন উলঙ্গ ব্যাক্তিও তাওয়াফ করতে পারবে না। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২৫২। ',
        name: '  চাদর গায়ে না দিয়ে সালাত আদায় করা',
        hadisNumberList: [
          HadisNumberModel(
            id: '৩৬৩।  ',
            name:
                'আবদুল ‘আযীয ইবনু ‘আবদুল্লাহ (রহঃ) ..... মুহাম্মদ ইবনুল মুনকাদির (রহঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি জাবির ইবনু ‘আবদুল্লাহ (রহঃ)-এর কাছে গিয়ে দেখি তিনি একটি মাত্র কাপড় নিজের শরীরে জড়িয়ে সালাত (নামায/নামাজ) আদায় করছেন অথচ তাঁর একটা চাঁদর সেখানে রাখা ছিল। সালাতের পর আমার বললামঃ হে আবূ আবদুল্লাহ! আপনি সালাত আদায় করছেন, অথচ আপনার চাঁদর তুলে রেখেছেন? তিনি বললেন, হ্যাঁ, তোমাদের মত নির্বোধদের দেখানোর জন্য আমি এরূপ করেছি। আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে এভাবে সালাত আদায় করতে দেখেছি। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২৫৩।',
        name: ' ঊরু সম্পর্কে বর্ণনা। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                ' وَيُرْوَى عَنِ ابْنِ عَبَّاسٍ وَجَرْهَدٍ وَمُحَمَّدِ بْنِ جَحْشٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْفَخِذُ عَوْرَةٌ». وَقَالَ أَنَسٌ حَسَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ فَخِذِهِ. وَحَدِيثُ أَنَسٍ أَسْنَدُ، وَحَدِيثُ جَرْهَدٍ أَحْوَطُ حَتَّى يُخْرَجَ مِنِ اخْتِلاَفِهِمْ. وَقَالَ أَبُو مُوسَى غَطَّى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رُكْبَتَيْهِ حِينَ دَخَلَ عُثْمَانُ. وَقَالَ زَيْدُ بْنُ ثَابِتٍ أَنْزَلَ اللَّهُ عَلَى رَسُولِهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَفَخِذُهُ عَلَى فَخِذِي فَثَقُلَتْ عَلَيَّ حَتَّى خِفْتُ أَنْ تُرَضَّ فَخِذِي আবূ ‘আবদুল্লাহ (রহঃ) বলেন, বর্ণিত আছে যে, ইবন ‘আব্বাস, জারহাদ ও মুহাম্মদ ইবন জাহশ (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণনা করেছেন যে, ঊরু সতরের অন্তর্ভুক্ত। আর আনাস (রাঃ) বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর ঊরু থেকে কাপড় সরিয়েছিলেন [আবূ ‘আবদুল্লাহ বুখারী (রহঃ)] সনদের দিক থেকে আনাস (রাঃ)-এর হাদীস অধিক সহীহ আর জারহাদ (রাঃ)-এর হাদীস অধিকতর সতর্কতামূলক। এভাবেই আমরা (উম্মতের মধ্যে) মতবিরোধ এড়াতে পারি। আর আবূ মূসা (রাঃ) বলেছেনঃ ‘উসমান (রাঃ)-এর আগমনে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর হাঁটু ঢেকে নেন। যায়িদ ইবন সাবিত (রাঃ) বলেনঃ আল্লাহ তা’আলা রাসূলসাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর উপর ওহী নাযিল করেছেন এমন অবস্থায় যখন তাঁর ঊরু ছিল আমার উরুর উপর। আমার কাছে তাঁর ঊরু এত ভারি বোধ হচ্ছিল যে, আমি আশংকা করছিলাম, হয়ত আমার ঊরুর হাড় ভেঙ্গে যাবে ৩৬৪। ইয়াকূব ইবনু ইবরাহীম (রহঃ) .... আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম খায়রব যুদ্ধে বের হয়েছিলেন। সেখানে আমরা ফজরের সালাত (নামায/নামাজ) খুব ভোরে আদায় করলাম। তারপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সওয়ার হলেন। আবূ তালহা (রাঃ)-ও সওয়ার হলেন, আর আমি আবূ তালহার পেছনে বসা ছিলাম। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর সওয়ারীকে খায়বরের পথে চালিত করলেন। আমার হাঁটু নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর ঊরুতে লাগছিল। এরপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর ঊরু থেকে ইযার সরে গেল। এমনকি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর ঊরুর উজ্জলতা এখনও আমি দেখছি। তিনি যখন নগরে প্রবেশ করলেন তখন বললেনঃ আল্লাহ আকবার। খায়বর ধ্বংস হউক। আমরা যখন কোন কওমের প্রাঙ্গনে অবতরণ করি তখন সতর্কীকৃতদের ভোর হবে কতই না মন্দ! এ কথা তিনি তিনবার উচ্চারন করলেন। আনাস (রাঃ) বলেনঃ খায়বরের অধিবাসীরা নিজেদের কাজে বেরিয়েছিল। তারা বলে উঠলঃ মুহাম্মদ! ‘আবদুল ‘আযীয (রহঃ) বলেনঃ আমাদের কোন কোন সাথী “পূর্ণ বাহিনীসহ” (ওয়াল খামীস) শব্দও যোগ করেছেন। পরে যুদ্ধের মাধ্যমে আমরা খায়বর জয় করলাম। তখন যুদ্ধবন্দীদের সমবেত করা হল। দিহরা (রাঃ) এসে বললেনঃ হে আল্লাহর নবী! বন্দীদের থেকে আমাকে একটি দাসী দিন। তিনি বললেনঃ যাও তুমি একটি দাসী নিয়ে যাও। তিনি সাফিয়্যা বিনত হুয়াই (রাঃ)-কে নিলেন। তখন এক ব্যাক্তি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এসে বললঃ ইয়া নাবিয়াল্লাহ! বনূ কুরাইযা ও বনূ নাযীরের অন্যতম নেত্রী সাফিয়্যা বিনত হুয়াইকে আপনি দিহয়াকে দিচ্ছেন? তিনি তো একমাত্র আপনার এ যোগ্য। তিনি বললেনঃ দিহয়াকে সাফিয়্যাসহ ডেকে আন। তিনি সাফিয়্যাসহ উপস্থিত হলেন। যখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সাফিয়্যা (রাঃ)-কে দেখলেন তখন (দিহয়াকে) বললেনঃ তুমি বন্দীদের থেকে অন্য একটি দাসী দেখে নাও। রাবী বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সাফিয়্যা (রাঃ)-কে আযাদ করে দিলেন এবং তাঁকে বিয়ে করলেন। রাবী সাবিত (রহঃ) আবূ হামযা (আনাস) (রাঃ)-কে জিজ্ঞেসা করলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁকে কি মাহর দিলেন? আনাস (রাঃ) জওয়াব দিলেন তাঁকে আযাদ করাই তাঁর মাহর। এর বিনিময়ে তিনি তাঁকে বিয়ে করেছেন। এরপর পথে উম্মে সুলায়ম (রাঃ) সাফিয়্যা (রাঃ)-কে সাজিয়ে রাতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর খিদমতে পেশ করলেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বাসর রাত যাপন করে ভোরে উঠলেন। তিনি ঘোষণা দিলেনঃ যার কাছে খানার কিছু আছে সে যেন তা নিয়ে আসে। এ বলে তিনি একটা চামড়ার দস্তরখান বিছালেন। কেউ খেজুর নিয়ে আসলো, কেউ ঘি আনলো। ‘আবদুল ‘আযীয (রহঃ) বলেনঃ আমার মনে হয় আনাস (রাঃ) ছাতুর কথাও উল্লেখ করেছেন। তারপর তাঁরা এসব মিশিয়ে খাবার তৈরি করলেন। এ-ই ছিল রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর ওয়ালীমা।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২৫৪। ',
        name: ' মহিলারা সালাত আদায় করতে কয়টি কাপড় পরবে। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'وَقَالَ عِكْرِمَةُ لَوْ وَارَتْ جَسَدَهَا فِي ثَوْبٍ لأَجَزْتُهُ ইকরিমা (রহঃ) বলেনঃ যদি একটি কাপড়ে মহিলার সমস্ত শরীর ঢেকে যায় তবে তাতেই সালাত জায়েয হবে। ৩৬৫। আবূল ইয়ামান (রহঃ) .... আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফযরের সালাত (নামায/নামাজ) আদায় করতেন আর তাঁর সঙ্গে অনেক মু’মিন মহিলা চাদর দিয়ে গা ঢেকে শরীক হতো। তারপর তাঁরা নিজ নিজ ঘরে ফিরে যেতো। আর তাঁদের কেউ চিনতে পারত না। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২৫৫।',
        name:
            ' কারুকার্য খচিত কাপড়ে সালাত আদায় করা এবং ঐ কারুকার্যে দৃষ্টি পড়া ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ৩৬৬।',
            name:
                ' আহমদ ইবনু ইউনুস (রহঃ) .... আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একদা একটি কারুকার্য খচিত চাদর গায়ে দিয়ে সালাত (নামায/নামাজ) আদায় করলেন। আর সালাতে সে চাদরের কারুকার্যের প্রতি তাঁর দৃষ্টি পড়ল। সালাত শেষে তিনি বললেনঃ এ চাদরখানা আবূ জাহমের কাছে নিয়ে যাও, আর তার কাছ থেকে আমবিজানিয়্যা (কারুকার্য ছাড়া মোটা চাঁদর) নিয়ে আস। এটা তো আমাকে সালাত থেকে অমনোযোগী করে দিচ্ছিল। হিশাম ইবনু ‘উরওয়া (রহঃ) তাঁর পিতা থেকে এবং তিনি ’আয়িশা (রাঃ) থেকে বর্ণনা করেন যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমি সালাত আদায়ের সময় এর কারুকার্যের প্রতি আমার দৃষ্টি পড়ে। তখন আমি আশংকা করছিলাম যে, এটা আমাকে ফিতনায় ফেলে দিতে পারে। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২৫৬।',
        name:
            ' ক্রুশ চিহ্ন অথবা ছবিযুক্ত কাপড়ে সালাত ফাসিদ হবে কিনা এবং এ সম্মন্ধে নিষেধাজ্ঞা ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৩৬৭। ',
            name:
                ' আবূ মা’মার ‘আবদুল্লাহ ইবনু আমর (রহঃ) .... আনাস (রাঃ) থেকে বর্ণিত, ‘আয়িশা (রাঃ)-এর কাছে একটা বিচিত্র রঙের পাতলা পর্দার একটা কাপড় ছিল। তিনি তা ঘরের একদিকে পর্দা হিসাবে ব্যাবহার করছিলেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ আমার সম্মুখ থেকে এই পর্দা সরিয়ে নাও। কারণ সালাত (নামায/নামাজ) আদায় করার সময় এর ছবিগুল আমার সামনে ভেসে ওঠে। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২৫৭। ',
        name: '  রেশমী জুব্বা পরে সালাত আদায় করা ও পরে তা খুলে ফেলা',
        hadisNumberList: [
          HadisNumberModel(
            id: '৩৬৮। ',
            name:
                ' আবদুল্লাহ ইবনু ইউসুফ (রহঃ) .... উকবা ইবনু ‘আমির (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে একটা রেশমি জুব্বা হাদিয়া হিসাবে দেওয়া হয়েছিল। তিনি তা পরিধান করে সালাত (নামায/নামাজ) আদায় করলেন। কিন্তু সালাত শেষ হওয়ার সাথে সাথে দ্রুত তা খুলে ফেললেন, যেন তিনি তা পরা অপছন্দ করছিলেন। তারপর তিনি বললেনঃ মুত্তাকীদের জন্য এই পোশাক সমীচীন নয়। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২৫৮। ',
        name: ' লাল কাপড় পরে সালাত আদায় করা ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৩৬৯।  ',
            name:
                'মুহাম্মদ ইবনু ‘আর’আর (রহঃ) .... আবূ জুহায়ফা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে চামড়ার একটা লাল তাঁবুতে দেখলাম এবং তাঁর জন্য উযূর পানি নিয়ে বিলাল (রাঃ)-কে উপস্থিত দেখলাম। আর লোকেরা তাঁর উযূর পানির জন্য প্রতিযোগিতা করছে। কেউ সামান্য পানি পাওয়া মাত্র তা দিয়ে শরীর মুছে নিচ্ছে। আর যে পায়নি সে তাঁর সাথীর ভেজা হাত থেকে নিয়ে নিচ্ছে। তারপর বিলাল (রাঃ) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর একটি লৌহফলকযুক্ত ছড়ি নিয়ে এসে তা মাটিতে পুতে দিলেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একটা লাল ডোরাযুক্ত পোশাক পরে বের হলেন, তাঁর তহবন্দ কিঞ্চিত উঁচু করে পরা ছিল। সে ছড়িটি সামনে রেখে লোকদের নিয়ে সালাত (নামায/নামাজ) আদায় করলেন। আর মানুষ ও জন্তু -জানোয়ার ঐ ছড়িটির বাইরে চলাফেরা করছিল। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২৫৯। ',
        name: ' ছাদ, মিম্বর ও কাঠের উপর সালাত আদায় করা। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'قَالَ أَبُو عَبْدِ اللَّهِ وَلَمْ يَرَ الْحَسَنُ بَأْسًا أَنْ يُصَلَّى عَلَى الْجَمْدِ وَالْقَنَاطِرِ، وَإِنْ جَرَى تَحْتَهَا بَوْلٌ أَوْ فَوْقَهَا أَوْ أَمَامَهَا، إِذَا كَانَ بَيْنَهُمَا سُتْرَةٌ. وَصَلَّى أَبُو هُرَيْرَةَ عَلَى ظَهْرِ الْمَسْجِدِ بِصَلاَةِ الإِمَامِ. وَصَلَّى ابْنُ عُمَرَ عَلَى الثَّلْجِ আবূ ‘আবদুল্লাহ (ইমাম বুখারী) (রহঃ) বলেনঃ হাসান বসরী (রহঃ) বরফ ও পুলের উপর সালাত আদায় করা দূষণীয় মনে করতেন না–যদিও তার নীচ দিয়ে, উপর দিয়ে অথবা সামনের দিক দিয়ে পেশাব প্রবাহিত হয়; যদি উভয় মাঝে কোন ব্যবধান থাকে। আবূ হুরায়ারা (রাঃ) মসজিদের ছাদে ইমামের সাথে সালাত আদায় করেছিলেন। ইবন ‘উমর (রাঃ) বরফের উপর সালাত আদায় করেছেন। ৩৭০। আলী ইবনু ‘আবদুল্লাহ (রহঃ) ..... আবূ হাযিম (রহঃ) থেকে বর্ণিত যে, লোকেরা সাহল ইবনু সা’দ (রাঃ)-কে জিজ্ঞাসা করলঃ (নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর) মিম্বর কিসের তৈরি ছিল? তিনি বললেনঃ এ বিষয়ে আমার চাইতে জ্ঞাত আর কেউ নেই। তা ছিল গাবা নামক স্থানের ঝাউগাছের কাঠ দিয়ে তৈরী। অমুক মহিলার আযাদকৃত দাস অমুক ব্যাক্তি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর জন্য তা তৈরী করেছিলেন। তা পুরোপুরি তৈরী ও স্থাপিত হওয়ার পর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর উপর দাড়িয়ে কিবলার দিকে মুখ করে তাকবীর বললেন। লোকেরা তাঁর পেছনে দাঁড়িয়ে গেলেন। তারপর তিনি কিরাআত পড়লেন ও রুকূতে গেলেন। সকলেই তাঁর পেছনে রুকূতে গেলেন। তারপর তিনি মাথা তুলে পেছনে সরে গিয়ে মাটিতে সিজদা করলেন। এ হল মিম্বরের ইতিহাস। আবূ ‘আবদুল্লাহ (ইমাম বুখারী) (রহঃ) বলেনঃ ‘আলী ইবনু ‘আবদুল্লাহ (রহঃ) বলেছেন যে, আমাকে আহমদ ইবনু হাম্বল (রহঃ) এ হাদীস সম্পর্কে জিজ্ঞাসা করেছিলেন এবং বলেছিলেনঃ আমার ধারনা, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সবচাইতে উঁচু স্থানে ছিলেন। সুতরাং ইমামের মুক্তাদীরের চাইতে উঁচু স্থানে দাঁড়ানোতে কোন দোষ নেই। ‘আলী ইবনু ‘আবদুল্লাহ (রহঃ) বলেনঃ আমি আহমদ ইবনু হাম্বল (রহঃ)-কে বললামঃ সুফিয়ান ইবনু ‘উয়ায়না (রহঃ)-কে এ বিষয়ে বহুবার প্রশ্ন করা হয়েছে, আপনি তাঁর কাছে এ বিষয়ে কিছু শোনেন নি? তিনি জবাব দিলেনঃ না। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '৩৭১। ',
            name:
                ' মুহাম্মদ ইবনু ‘আবদুর রহীম (রহঃ) .... আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একবার ঘোড়া থেকে পড়ে গেলেন, এতে তাঁর পায়ের ‘গোছায়’ অথবা (রাবী বলেছেন) ‘কাঁধে’ আঘাত পান। তিনি তাঁর স্ত্রীদের থেকে এক মাসের জন্য পৃথক হয়ে থাকেন। তখন তিনি ঘরের উপরের কক্ষে অবস্থান করেন যার সিড়ি ছিল খেজুর গাছের কান্ডের তৈরী। সাহাবীগণ তাঁকে দেখতে এলেন, তিনি তাঁদের নিয়ে বসে সালাত (নামায/নামাজ) আদায় করলেন, আর তাঁরা ছিল দাঁড়ানো। সালাম ফিরিয়ে তিনি বললেনঃ ইমাম এজন্য যে মুক্তাদীরা তার অনুসরণ করবে। সুতরাং ইমাম তাকবীর বললে তোমরাও তাকবীর বলবে, তিনি রুকু করলে তোমরাও রুকু করবে। তিনি সিজদা দিলে তোমরাও করবে। ইমাম দাঁড়িয়ে সালাত আদায় করলে তোমরাও দাঁড়িয়ে সালাত আদায় করবে। তারপর ঊনত্রিশ দিন পূর্ণ হলে তিনি নেমে আসলেন। তখন লোকেরা বললেন, ইয়া রাসুলাল্লাহ! আপনি তো এক মাসের শপথ করেছিলেন। তিনি বললেনঃ এ মাস ঊনত্রিশ দিনের। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২৬০।  ',
        name: ' মুসল্লীর কাপড় সিজদা করার সময় স্ত্রীর গায়ে লাগা ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৩৭২। ',
            name:
                ' মূসা’দ্দাদ (রহঃ) ..... মায়মূনা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন সালাত (নামায/নামাজ) আদায় করতেন তখন হায়েয অবস্থায় থাকা সত্ত্বেও আমি তাঁর বরাবর বসে থাকতাম। কখনো কখনো তিনি সিজদা করার সময় তাঁর কাপড় আমার গায়ে লাগতো। আর তিনি ছোট চাটায়ের উপর সালাত (নামায/নামাজ) আদায় করতেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২৬১।',
        name: ' চাটায়ের উপর সালাত আদায় করা। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'وَصَلَّى جَابِرٌ وَأَبُو سَعِيدٍ فِي السَّفِينَةِ قَائِمًا. وَقَالَ الْحَسَنُ تُصَلِّي قَائِمًا مَا لَمْ تَشُقَّ عَلَى أَصْحَابِكَ، تَدُورُ مَعَهَا وَإِلاَّ فَقَاعِدًا জাবির ইবন ‘আবদুল্লাহ ও আবূ সাঈদ (রাঃ) নৌকায় দাঁড়িয়ে সালাত আদায় করেছেন। হাসান (রহঃ) বলেন, যতক্ষণ পর্যন্ত সাথীদের জন্য কষ্টকর না হয়, ততক্ষণ পর্যন্ত দাঁড়িয়ে সালাত আদায় করবে। আর নৌকার দিক পরিবর্তনের সাথে সাথে ঘুরে যাবে। অন্যথায় বসে সালাত আদায় করবে। ৩৭৩। আবদুল্লাহ ইবনু ইউসুফ (রহঃ) ..... আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত যে, তাঁর দাদী মুলায়কাহ (রাঃ) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে খাওয়ার দাওয়াত দিলেন, যা তাঁর জন্যই তৈরী করেছিলেন। তিনি তা থেকে খেলেন, এরপর বললেনঃ উঠ, তোমাদের নিয়ে আমি সালাত (নামায/নামাজ) আদায় করি। আনাস (রাঃ) বলেনঃ আমি আমাদের একটি চাটাই আনার জন্য উঠলাম, তা অধিক ব্যাবহারে কাল হয়ে গিয়েছিল। তাই আমি সেটি পানি দিয়ে পরিষ্কার করে নিলাম। তারপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সালাতের জন্য দাঁড়ালেন। আমি ও একজন ইয়াতীম বালক (যুমায়রা) তাঁর পেছনে দাঁড়ালাম আর বৃদ্ধা দাদী আমার পেছনে ছিলেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের নিয়ে দু’রাক’আত সালাত আদায় করলেন। তারপর তিনি চলে গেলেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২৬২। ',
        name: ' ছোট চাটায়ের উপর সালাত আদায় করা ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ৩৭৪।',
            name:
                ' আবূল ওলীদ (রহঃ) ... মায়মূনা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ছোট চাটায়ের উপর সালাত (নামায/নামাজ) আদায় করতেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২৬৩।',
        name: ' বিছানায় সালাত আদায় করা। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'وَصَلَّى أَنَسٌ عَلَى فِرَاشِهِ. وَقَالَ أَنَسٌ كُنَّا نُصَلِّي مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَيَسْجُدُ أَحَدُنَا عَلَى ثَوْبِهِ আনাস ইবন মালিক (রাঃ) নিজের বিছানায় সালাত আদায় করতেন। আনাস (রাঃ) বলেনঃ আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে সালাত আদায় করতাম। আমাদের কেউ কেউ নিজ কাপড়ের উপর সিজদা করতো ৩৭৫। ইসমা’ঈল (রহঃ) .... নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর স্ত্রী ‘আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সামনে ঘুমাতাম, আমার পা দু’খানা তাঁর কিবলার দিকে ছিল। তিনি সিজদায় গেলে আমার পায়ে মৃদু চাপ দিতেন, তখন আমি পা দু’খানা সঙ্কুচিত করতাম। আর তিনি দাঁড়িয়ে গেলে আমি পা দু’খানা সপ্রসারিত করতাম। তিনি বলেনঃ সে সময় ঘরগুলোতে বাতি ছিল না। ',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ৩৭৬। ',
            name:
                ' ইয়াহইয়া ইবনু বুকায়র (রহঃ) ..... আয়িশা (রাঃ) ‘উরওয়া (রহঃ)-কে বলেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সালাত (নামায/নামাজ) আদায় করতেন আর তিনি [আয়িশা (রাঃ)] রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও তাঁর কিবলার মধ্যে পারিবারিক বিছানায় জানাযার মত আড়াআড়িভাবে শুয়ে থাকতেন।',
            ref: '',
          ),
          HadisNumberModel(
            id: '৩৭৭।  ',
            name:
                'আবদুল্লাহ ইবনু ইউসুফ (রহঃ) .... উরওয়া (রহঃ) থেকে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সালাত (নামায/নামাজ) আদায় করতেন, আর আয়িশা (রাঃ) তাঁর ও তাঁর কিবলার মাঝাখানে তাঁদের বিছানায় শুয়ে থাকতেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২৬৪। ',
        name: '  প্রচণ্ড গরমের সময় কাপড়ের উপর সিজদা করা।',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'وَقَالَ الْحَسَنُ كَانَ الْقَوْمُ يَسْجُدُونَ عَلَى الْعِمَامَةِ وَالْقَلَنْسُوَةِ وَيَدَاهُ فِي كُمِّهِ হাসান বসরী (রহঃ) বলেন, লোকেরা পাগড়ী ও টুপির উপর সিজদা করতো আর তাঁদের হাত থাকতো আস্তিনের ভিতর ৩৭৮। আবূল ওলীদ হিশাম ইবনু ‘আবদুল মালিক (রহঃ) ..... আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত, তিনি বলেন যে, আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে সালাত (নামায/নামাজ) আদায় করতাম। আমাদের কেউ কেউ সিজদার সময় অধিক গরমের কারণে কাপড়ের প্রান্ত সিজদার স্থানে রাখতো। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২৬৫। ',
        name: '  জুতা পরে সালাত আদায় করা',
        hadisNumberList: [
          HadisNumberModel(
            id: '৩৭৯। ',
            name:
                '  আদম ইবনু আবূ ইয়াস (রহঃ) .... আবূ মাসলামা সা\'ঈদ ইবনু ইয়াজীদ আল-আযদী (রহঃ) বলেনঃ আমি আনাস ইবনু মালিক (রাঃ) কে জিজ্ঞাসা করেছিলাম, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কি তাঁর না\'লাইন (চপ্পল) পরে সালাত আদায় করতেন? তিনি বললেন, হ্যাঁ।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২৬৬।',
        name: ' মোজা পরে সালাত আদায় করা ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৩৮০। ',
            name:
                '  আদম (রহঃ) ..... হাম্মাম ইবনু হারিস (রহঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি জারীর ইবনু ‘আবদুল্লাহ (রাঃ)-কে দেখলাম যে, তিনি পেশাব করলেন। তারপর উযূ (ওজু/অজু/অযু) করলেন আর উভয় মোজার উপরে মাসেহ করলেন। তারপর তিনি দাঁড়িয়ে সালাত (নামায/নামাজ) আদায় করলেন। তাঁকে জিজ্ঞাসা করা হলে তিনি বললেনঃ আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কেও এরূপ করতে দেখেছি। ইবরাহীম (রহঃ) বলেনঃ এই হাদীস মুহাদ্দিসীনের কাছে অত্যন্ত পছন্দনীয়। কারণ জারীর (রাঃ) ছিলেন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর শেষ যুগের ইসলাম গ্রহণকারীদের একজন।',
            ref: '',
          ),
          HadisNumberModel(
            id: '৩৮১। ',
            name:
                '  ইসহাক ইবনু নাসর (রহঃ) .... মুগীর ইবনু শু’বা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম–কে উযূ (ওজু/অজু/অযু) করিয়েছি। তিনি উযূর সময় মোজা দু’টির উপর মাসেহ করলেন ও সালাত (নামায/নামাজ) আদায় করলেন।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২৬৭। ',
        name: ' সিজদা পূর্ণভাবে না করলে ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৩৮২। ',
            name:
                '  সালত ইবনু মুহাম্মদ (রহঃ) ..... হুযায়ফা (রাঃ) থেকে বর্ণিত যে, এক ব্যাক্তি তাঁর রুকু-সিজদা পুরোপুরি আদায় করছিল না। সে যখন সালাত (নামায/নামাজ) শেষ করলো তখন তাকে হুযায়ফা (রাঃ) বললেনঃ তোমার সালাত (নামায/নামাজ) ঠিক হয়নি। রাবী বলেনঃ আমার মনে হয় তিনি (হুযায়ফা) এ কথাও বলেছেন, (এ অবস্থায়) তোমার মৃত্যু হলে তা মুহাম্মদসাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর তরীকা অনুযায়ী হবে না।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২৬৮। ',
        name: ' সিজদায় বাহুমূল খোলা রাখা এবং দু’পাশ আলগা রাখা ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৩৮৩। ',
            name:
                ' ইয়াহইয়া ইবনু বুকায়র (রহঃ) ..... আবদুল্লাহ ইবনু মালিক (রাঃ) থেকে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সালাত (নামায/নামাজ)-এর সময় উভয় বাহু পৃথক রাখতেন। এমনকি তাঁর বগলের শুভ্রতা প্রকাশ পেতো। লাইস (রহঃ) বলেনঃ জা’ফর ইবনু রবী’আহ (রহঃ) আমার কাছে অনুরুপ বর্ণনা করেছেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২৬৯।',
        name: '  কিবলামূখী হওয়ার ফযীলত।',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'يَسْتَقْبِلُ بِأَطْرَافِ رِجْلَيْهِ. قَالَ أَبُو حُمَيْدٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ পায়ের আঙ্গুলকেও কিবলামূখী রাখবে। আবূ হুমায়দ (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে এরূপ বর্ণনা করেছেন। ৩৮৪। আমর ইবনু ‘আব্বাস (রহঃ) ..... আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ যে ব্যাক্তি আমাদের ন্যায় সালাত (নামায/নামাজ) আদায় করে, আমাদের কিবলামুখী আর আমাদের যবেহ করা প্রাণী খায়, সে-ই মুসলিম, যার জন্য আল্লাহ ও তাঁর রাসূল যিম্মাদার। সুতরাং তোমরা আল্লাহর যিম্মাদারীতে খিয়ানত করো না। ',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ৩৮৫।',
            name:
                ' নু’আইম (রহঃ) ..... আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আমাকে লোকের বিরুদ্ধে জিহাদ করার নির্দেশ দেওয়া হয়েছে, যতক্ষণ না তারা \'লা ইলাহা ইল্লাল্লাহ\' স্বীকার করবে। যখন তারা তা স্বীকার করে নেয়, আমাদের মত সালাত (নামায/নামাজ) আদায় করে, আমাদের কিবলামুখী হয় এবং আমাদের যবেহ করা প্রাণী খায়, তখন তাদের জান ও মালসমূহ আমাদের জন্য হারাম হয়ে যায়। অবশ্য রক্তের বা সম্পদের দাবীর কথা ভিন্ন। আর তাদের হিসাব আল্লাহর কাছে। ‘আলী ইবনু ‘আবদুল্লাহ (রহঃ) হুমায়দ (রহঃ) সুত্রে বর্ণিত, তিনি বলেনঃ মায়মূন ইবনু সিয়াহ আনাস ইবনু মালিক (রাঃ)-কে জিজ্ঞাসা করলেনঃ হে আবূ হামযাহ, কিসে কিসে মানুষের জান ও মাল হারাম হয়? তিনি জবাব দিলেন, যে ব্যাক্তি লা ইলাহা ইল্লাল্লাহ-এর সাক্ষ্য দেয়, আমাদের কেবলামূখী হয়, আমাদের সালাত আদায় করে, আমাদের যবেহ করা প্রাণী খায়, সে-ই মুসলিম। অন্য মুসলিমদের মতই তার অধিকার রয়েছে। আর অন্য মুসলিমদের মতই তার দায়িত্ব ও কর্তব্য রয়েছে। ইবনু আবূ মারয়াম, ইয়াহইয়া ইবনু আয়্যূব (রহঃ) ... আনাস ইবনু মালিক (রাঃ) সুত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে (অনুরূপ) বর্ণনা করেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২৭০। ',
        name:
            ' মদীনা, সিরিয়া ও (মদীনার) পূর্ব দিকের অধিবাসীদের কিবলা পূর্বে বা পশ্চিমে নয়। কারণ নবী (ﷺ) বলেছেনঃ তোমরা পায়খানা বা পেশাব করতে কিবলামুখী হবে না, বরং তোমরা (উত্তর অঞ্চলের অধিবাসীরা) পূর্বদিকে কিংবা পশ্চিম দিকে মুখ ফিরাবে',
        hadisNumberList: [
          HadisNumberModel(
            id: '৩৮৬। ',
            name:
                '  আলী ইবনু ‘আবদুল্লাহ (রহঃ) .... আবূ আয়্যূব আনসারী (রাঃ) থেকে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যখন তোমরা পায়খানা করতে যাও, তখন কিবলার দিকে মুখ করবে না কিংবা পিঠও দিবে না, বরং তোমরা পূর্বদিকে অথবা পশ্চিম দিকে ফিরে বসবে। আবূ আয়্যূব আনসারী (রাঃ) বলেনঃ আমরা যখন সিরিয়ায় এলাম তখন পায়খানাগুলো কিবলামুখী বানানো পেলাম। আমরা কিছুটা ঘুরে বসতাম এবং আল্লাহ তা’লার কাছে ক্ষমা প্রার্থনা করতাম। যুহরী (রহঃ) ‘আতা (রহঃ) সুত্রে বর্ণনা করেছেন যে, আমি আবূ আয়্যূব (রাঃ)-কে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট থেকে অনুরূপ বর্ণনা করতে শুনেছি।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২৭১।',
        name:
            ' মহান আল্লাহর বাণীঃ মাকামে ইবরাহীমকে সালাতের স্থান রূপে গ্রহন কর (২:১২৫) ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৩৮৭। ',
            name:
                '  হুমায়দী (রহঃ) ..... আমর ইবনু দ্বীনার (রহঃ) বলেনঃ আমরা ইবনু ‘উমর (রাঃ)-কে এক ব্যাক্তি সম্পর্কে জিজ্ঞাসা করলাম—যে ব্যাক্তি উমরার জন্য বায়তুল্লাহর তাওয়াফ করেছেন কিন্তু সাফা-মারওয়া সা’ঈ করে নি, সে কি তাঁর স্ত্রীর সাথে সঙ্গত হতে পারবে? তিনি জবাব দিলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এসে সাতবার বায়তুল্লাহর তাওয়াফ করেছেন, মাকামে ইবরাহীমের কাছে দু’রাক’আত সালাত (নামায/নামাজ) আদায় করেছেন আর সাফা-মারওয়া সা’ঈ করেছেন। তোমাদের জন্য আল্লাহর রাসুলের মধ্যে রয়েছে উত্তম আদর্শ। আমরা জাবির ইবনু ‘আবদুল্লাহ (রাঃ)-কে এ ব্যাপারে জিজ্ঞাসা করেছি, তিনি বলেছেনঃ সাফা-মারওয়ায় সা’ঈ করার আগ পর্যন্ত স্ত্রীর কাছে যাবে না।',
            ref: '',
          ),
          HadisNumberModel(
            id: '৩৮৮। ',
            name:
                '  মুসাদ্দাদ (রহঃ) .... মুজাহিদ (রহঃ) থেকে বর্ণিত যে, এক ব্যাক্তি উমর (রাঃ)-এর নিকট এলেন, এবং বললেনঃ ইনি হলেন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম, তিনি কাবা ঘরে প্রবেশ করেছেন। ইবনু ‘উমর (রাঃ) বলেনঃ আমি সেদিকে এগিয়ে গেলাম এবং দেখলাম যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কা’বা থেকে বেরিয়ে পড়েছেন। আমি বিলাল (রাঃ)-কে উভয় কপাটের মাঝখানে দাঁড়ানো দেখে জিজ্ঞাসা করলাম, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কি কা’বা ঘরের অভ্যন্তরে সালাত আদায় করেছেন? তিনি জবাব দিলেন, হ্যাঁ, কা’বায় প্রবেশ করার সময় তোমার বাঁ দিকের দুই স্তম্ভের মধ্যখানে দুই রাক’আত সালাত (নামায/নামাজ) আদায় করেছেন। তারপর তিনি বের হলেন এবং কাবার সামনে দুই রাক’আত সালাত আদায় করলেন।',
            ref: '',
          ),
          HadisNumberModel(
            id: '৩৮৯। ',
            name:
                ' ইসহাক ইবনু নসর (রহঃ) ..... ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ যখন রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কা’বায় প্রবেশ করেন, তখন তাঁর সকল দিকে দুয়া করেছেন, সালাত (নামায/নামাজ) আদায় না করেই বেরিয়ে এসেছেন এবং বের হওয়ার পর কাবার সামনে দু’রাক’আত সালাত আদায় করেছেন, আর বলেছেন, এই কিবলা। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২৭২।  ',
        name: ' যেখানেই হোক (সালাতে) কিবলামুখী হওয়া।',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'وَقَالَ أَبُو هُرَيْرَةَ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: اسْتَقْبِلِ الْقِبْلَةَ وَكَبِّرْ আবূ হুরায়রা (রাঃ) বলেন যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কিবলামুখী হও তাকবীর বল। ৩৯০। আবদুল্লাহ ইবনু রাজা’ (রহঃ) .... বারা’ ইবনু ‘আযিব (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বায়তুল মুকাদ্দাসমুখী হয়ে ষোল বা সতের মাস সালাত (নামায/নামাজ) আদায় করেছেন। আর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কাবার দিকে কিবলা করা পছন্দ করতেন। মহান আল্লাহ নাযিল করেনঃ “আকাশের দিকে আপনার বারবার তাকানোকে আমি অবশ্য লক্ষ্য করেছি। (২ : ১৪৪) তারপর তিনি কাবার দিকে মুখ করেন। আর নির্বোধ লোকেরা–তারা ইয়াহুদী, বলতো, "তারা এ যাবত যে কিবলা অনুসরণ করে আসছিলো, তা থেকে কিসে তাঁদের কে ফিরিয়ে দিল"? বলুনঃ (হে রাসূল) পূর্ব ও পশ্চিম আল্লাহরই। তিনি যাকে ইচ্ছা সঠিক পথে পরিচালিত করেন। (২ : ১৪২) তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে এক ব্যাক্তি সালাত (নামায/নামাজ) আদায় করলেন এবং বেরিয়ে গেলেন। তিনি আসরের সালাতের সময় আনসারগনের এক গোত্রের পাশ দিয়ে যাচ্ছিলেন। তাঁরা বায়তুল মুকাদ্দাসের দিকে মুখ করে সালাত আদায় করেছিলেন। তখন তিনি বললেনঃ (তিনি নিজেই) সাক্ষী যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে তিনি সালাত আদায় করেছেন, আর তিনি (রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) কাবার দিকে মুখ করেছেন। তখন সে গোত্রের লোকজন ঘুরে কাবার দিকে মুখ করলেন। ',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ৩৯১।',
            name:
                ' মুসলিম ইবনু ইবরাহীম (রহঃ) ..... জাবির ইবনু ‘আবদুল্লাহ (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিজের সাওয়ারীর উপর (নফল) সালাত (নামায/নামাজ) আদায় করতেন—সওয়ারী তাঁকে নিয়ে যে দিকেই মুখ করত না কেন। কিন্তু যখন ফরয সালাত আদায়ের ইচ্ছা করতেন, তখন নেমে পড়তেন এবং কিবলার দিকে মুখ করতেন। ',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ৩৯২।',
            name:
                '  উসমান (রহঃ) .... আবদুল্লাহ (রাঃ) থেকে বর্ণিত, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সালাত (নামায/নামাজ) আদায় করলেন। রাবী ইবরাহীম (রহঃ) বলেনঃ আমার জানা নেই, তিনি বেশী করেছেন বা কম করেছেন। সালাম ফিরানোর পর তাঁকে বলা হল, ইয়া রাসুলাল্লাহ! সালাতের মধ্যে নতুন কিছু হয়েছে কি? তিনি বললেনঃ তা কী? তাঁরা বললেনঃ আপনি তো এরূপ এরূপ সালাত আদায় করলেন। তিনি তখন তাঁর দু’পা ঘুরিয়ে কিবলামুখী হলেন। আর দু’টি সিজদা আদায় করলেন। এরপর সালাম ফিরালেন। পরে তিনি আমাদের দিকে ফিরে বললেনঃ যদি সালাত সম্পর্কে নতুন কিছু হতো, তবে অবশ্যই তোমাদের তা জানিয়ে দিতাম। কিন্তু আমি তো তোমাদের মত একজন মানুষ। তোমরা যেমন ভুল করে থাক, আমিও তোমাদের মত ভুলে যাই। আমি কোন সময় ভুলে গেলে তোমরা আমাকে স্মরণ করিয়ে দেবে। তোমাদের কেউ সালাত সম্বন্ধে সন্দেহে পতিত হলে সে যেন নিঃসন্দেহ হওয়ার চেষ্টা করে এবং সে অনুযায়ী সালাত পূর্ণ করে। তারপর সে সালাম ফিরিয়ে দু\'টি সিজদা আদায় করে।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২৭৩।  ',
        name: ' কিবলা সম্পর্কে বর্ণনা।',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'وَمَنْ لاَ يَرَى الإِعَادَةَ عَلَى مَنْ سَهَا فَصَلَّى إِلَى غَيْرِ الْقِبْلَةِ - وَقَدْ سَلَّمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي رَكْعَتَيِ الظُّهْرِ، وَأَقْبَلَ عَلَى النَّاسِ بِوَجْهِهِ، ثُمَّ أَتَمَّ مَا بَقِيَ ভুলবশত কিবলার পরিবর্তে অন্যদিকে মুখ করে সালাত আদায় করলে তা পুনরায় আদায় করা যাদের মতে আবশ্যকীয় নয়। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যুহরের দু’রাক’আত সালাত আদায় করে সালাম ফিরিয়ে মুসল্লিগণের দিকে মুখ করলেন। তারপরে বাকী সালাত পূর্ণ করলেন। ৩৯৩। আমার ইবনু ‘আওন (রহঃ) .... আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত, তিনি বলেন, ‘উমর (রাঃ) বলেছেনঃ তিনটি বিষয়ে আমার অভিমত আল্লাহর অহির সাথে সামঞ্জস্যপূর্ণ হয়েছে। আমি বলেছিলাম, ইয়া রাসুলাল্লাহ! আমরা যদি মাকামে ইবরাহীম কে সালাতের স্থান বানাতে পারতাম! তখন এ আয়াত নাযিল হয়ঃ (وَاتَّخِذُوا مِنْ مَقَامِ إِبْرَاهِيمَ مُصَلًّى‏) “তোমরা মাকামে ইবরাহীমকে সালাতের স্থান বানাও” (২ : ১২৫) (দ্বিতীয়) পর্দার আয়াত, আমি বললামঃ ইয়া রাসুলাল্লাহ! আপনি যদি আপনার সহধর্মিনীগনকে পর্দার আদেশ করতেন! কেননা, সৎ ও অসৎ সবাই তাদের সাথে কথা বলে। তখন পর্দার আয়াত নাযিল হয়। আর একবার নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহধর্মিণীগণ অভিমান সহকারে তাঁর নিকট উপস্থিত হন। তখন আমি তাদেরকে বললামঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যদি তোমাদের তালাক দেয়, তাহলে তাঁর রব তাঁকে তোমাদের পরিবর্তে তোমাদের চাইতে উত্তম স্ত্রী দান করবেন। (৬৬ : ৫) তখন এ আয়াত নাযিল হয়। [অপর সনদে ইবন আবু মারয়াম (রহঃ) .... আনাস (রাঃ) থেকে অনুরূপ বর্ণিত আছে।] ',
            ref: '',
          ),
          HadisNumberModel(
            id: '৩৯৪।  ',
            name:
                ' আবদুল্লাহ ইবনু ইউসুফ (রহঃ) .... আবদুল্লাহ ইবনু ‘উমর (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ এক সময় লোকেরা কুবা নামক স্থানে ফযরের সালাত (নামায/নামাজ) আদায় করছিলেন। এমন সময় তাঁদের নিকট এক ব্যাক্তি এসে বললেন যে, এ রাতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর প্রতি ওহী নাযিল হয়েছে। আর তাঁকে কাবামুখী হওয়ার নির্দেশ দেওয়া হয়েছে। তাই তোমরা কাবার দিকে মুখ কর। তখন তাঁদের চেহারা ছিল বায়তুল মুকাদ্দাসের দিকে। একথা শুনে তাঁরা কাবার দিকে মুখ করে নিলেন।',
            ref: '',
          ),
          HadisNumberModel(
            id: '৩৯৫।  ',
            name:
                'মূসা’দ্দাদ (রহঃ) .... আবদুল্লাহ [ইবনু মাস’উদ (রাঃ)] থেকে বর্ণিত, তিনি বলেনঃ একবার নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যুহরেরে সালাত (নামায/নামাজ) পাঁচ রাক’আত আদায় করেন। তখন মুসল্লীগন জিজ্ঞাসা করলেনঃ সালাতে কি কিছু বৃদ্ধি করা হয়েছে? তিনি বললেনঃ তা কি? তাঁরা বললেনঃ আপনি যে পাঁচ রাক’আত সালাত আদায় করেছেন। রাবী বলেন, তিনি নিজের পা ঘুরিয়ে (কিবলামুখী হয়ে) দুই সিজদা (সিজদা সাহু) করে নিলেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২৭৪। ',
        name: ' মসজিদে থুথু হাতের সাহায্যে পরিষ্কার করা ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ৩৯৬। ',
            name:
                ' কুতায়বা (রহঃ) .... আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কিবলার দিকে (দেয়ালে) ‘কফ’ দেখলেন। এটা তাঁর কাছে কষ্টদায়ক মনে হল। এমনকি তাঁর চেহারায় তা ফুটে উঠলো। তিনি উঠে দিয়ে তা হাত দিয়ে পরিষ্কার করলেন। তারপর তিনি বললেনঃ তোমাদের কেউ যখন সালাতে দাঁড়ায় তখন সে তাঁর রবের সাথে একান্তে কথা বলে। অথবা বলেছেন, তাঁর ও কিবলার মাঝখানে তাঁর রব আছেন। কাজেই, তোমাদের কেউ যখন কিবলার দিকে থুথু না ফেলে। বরং সে যেন তাঁর বাম দিকে বা পায়ের নীচে তা ফেলে। তারপর চাঁদরের আঁচল দিয়ে তিনি তাতে থুথু ফেললেন এবং তাঁর এক অংশকে অন্য অংশের উপর ভাঁজ করলেন এবং বললেনঃ অথবা সে এরূপ করবে।',
            ref: '',
          ),
          HadisNumberModel(
            id: '৩৯৭। ',
            name:
                ' আবদুল্লাহ ইবনু ইউসুফ (রহঃ) .... আবদুল্লাহ ইবনু ‘উমর (রাঃ) থেকে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কিবলার দিকে দেওয়ালে থুথু দেখে তা পরিষ্কার করে দিলেন। তারপর লোকদের দিকে ফিরে বললেনঃ যখন তোমাদের কেউ সালাত (নামায/নামাজ) আদায় করে সে যেন তাঁর সামনের দিকে থুথু না ফেলে। কেননা, সে যখন সালাত আদায় করে তখন তাঁর সামনের দিকে আল্লাহ তা’আলা থাকেন। ',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ৩৯৮।',
            name:
                '  আবদুল্লাহ ইবনু ইউসুফ (রহঃ) ..... উম্মুল মু’মিনীন ‘আয়িশা (রাঃ) থেকে বর্ণিত যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কিবলার দিকের দেয়ালের শ্লেষ্মা, থুথু কিংবা কফ দেখলেন এবং তা পরিষ্কার করলেন।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২৭৫। ',
        name: '  কাঁকর দিয়ে মসজিদ থেকে নাকের শ্লেস্মা পরিষ্কার করা।',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                ' وَقَالَ ابْنُ عَبَّاسٍ إِنْ وَطِئْتَ عَلَى قَذَرٍ رَطْبٍ فَاغْسِلْهُ، وَإِنْ كَانَ يَابِسًا فَلاَ ইবন ‘আব্বাস (রাঃ) বলেছেনঃ যদি আর্দ্র আবর্জনায় তোমার পা ফেল, তখন তা ধুইয়ে ফেলবে, আর শুকনো হলে ধোয়ার প্রয়োজন নেই। ৩৯৯। মূসা ইবনু ইসমাঈল (রহঃ) .... আবূ হুরায়রা ও আবূ সা’ইদ (খুদরী) (রাঃ) থেকে বর্ণিত যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মসজিদের দেওয়ালে কফ দেখে কাঁকর দিয়ে তা মুছে ফেললেন। তারপর তিনি বললেনঃ তোমাদের কেউ যেন সামনের দিকে অথবা ডান দিকে কফ না ফেলে, বরং সে যেন তাঁর বাম দিকে অথবা তাঁর পায়ের নীচে ফেলে।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' রিচ্ছেদঃ ২৭৬।',
        name: ' সালাতে ডান দিকে থুথু ফেলবে না ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ৪০০।',
            name:
                ' ইয়াহইয়া ইবনু বুকায়র (রহঃ) ..... আবূ হুরায়রা (রাঃ) ও আবূ সা’ঈদ (খুদরী) (রাঃ) থেকে বর্ণিত যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মসজিদের দেয়ালে কফ দেখলেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কিছু কাঁকর নিলেন এবং তা মুছে ফেললেন। তারপর তিনি বললেনঃ তোমাদের কেউ কফ ফেললে তা যেন সামনে অথবা ডানে না ফেলে বরং (প্রয়োজনে) সে বাঁ দিকে অথবা বাঁ পায়ের নিচে ফেলবে। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '৪০১। ',
            name:
                '  হাফসা ইবনু উমর (রহঃ) ..... আনাস (রাঃ) থেকে বর্ণিত, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তোমাদের কেউ যেন তার সামনে বা ডানে থুথু না ফেলে; বরং তার বাঁয়ে বা পায়ের নীচে ফেলে।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২৭৭। ',
        name: ' থুথু যেন বাঁ দিকে অথবা পায়ের নীচে ফেলে ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৪০২। ',
            name:
                ' আদম (রহঃ) ..... আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, মু\'মিন যখন সালাতে থাকে, তখন সে তার রবের সঙ্গে একান্তে কথা বলে। কাজেই সে যেন তার সামনে, ডানে থুথু না ফেলে। বরং তার বাঁ দিকে অথবা পায়ের নীচে ফেলে। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '৪০৩। ',
            name:
                ' আলী (রহঃ) .... আবূ সা\'ঈদ খুদরী (রাঃ) থেকে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একবার মসজিদের কিবলার দিকের দেয়ালে কফ দেখলেন, তখন তিনি কাঁকর দিয়ে তা মুছে দিলেন। তারপর সামনের দিকে অথবা ডান দিকে থুথু ফেলতে নিষেধ করলেন। কিন্তু (প্রয়োজনে) বাঁ দিকে অথবা পায়ের নীচে ফেলতে বললেন। যুহরী (রহঃ) হুমাইদ (রহঃ) এর মাধ্যমে আবূ সা\'ঈদ খুদরী (রাঃ) থেকে অনুরূপ বর্ণিত আছে। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২৭৮। ',
        name: ' মসজিদে থুথু ফেলার কাফফারা ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৪০৪। ',
            name:
                '  আদম (রহঃ) .... আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, মসজিদে থুথু ফেলা গুনাহ, আর তার কাফফারা (প্রতিকার) হল তা পুঁতে ফেলা।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২৭৯।',
        name: ' মসজিদে কফ পুঁতে ফেলা  ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৪০৫। ',
            name:
                '  ইসহাক ইবনু নাসর (রহঃ) ... আবূ হুরায়রা (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণিত, তিনি বলেন, তোমাদের কেউ সালাতে দাঁড়ালে সে তার সামনের দিকে থুথু ফেলবে না। সে যতক্ষণ তার মুসাল্লায় থাকে, ততক্ষণ মহান আল্লাহর সঙ্গে চুপে চুপে কথা বলে। আর ডান দিকেও ফেলবে না। কেননা তার ডান দিকে থাকেন ফিরিশতা। সে যেন তার বাঁ দিকে অথবা পায়ের নীচে থুথু ফেলে এবং পরে তা পুঁতে ফেলে।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২৮০।',
        name: ' থুথু ফেলতে বাধ্য হলে তা কাপড়ের কিনারে ফেলবে। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ৪০৬।',
            name:
                ' মালিক ইবনু ইসমা’ঈল (রহঃ) ..... আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কিবলার দিকে (দেয়ালে) কফ দেখে তা নিজ হাতে মুছে ফেললেন আর তাঁর চেহারায় অসন্তোষ প্রকাশ পেল বা সে কারণে তাঁর চেহারায় অসন্তোষ প্রকাশ পেল এবং এর প্রতি তাঁর ক্ষোভ প্রকাশ পেল। তিনি বললেন যখন তোমাদের কেউ সালাতে দাঁড়ায়, তখন তার রবের সঙ্গে চুপে চুপে কথা বলে। অথবা (বলেছেন) তখন তার রব কিবলা ও তার মাঝখানে থাকেন। কাজেই সে যেন কিবলার দিকে থুথু না ফেলে, বরং (প্রয়োজনে) বাঁ দিকে বা পায়ের নীচে ফেলবে। তারপর তিনি চাঁদরের কোণ ধরে তাতে থুথু ফেলে এক অংশের উপর অপর অংশ ভাঁজ করে দিলেন এবং বললেনঃ অথবা এরূপ করবে। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২৮১। ',
        name: ' সালাত পূর্ণ করার ও কিবলার ব্যাপারে লোকদেরকে ইমামের উপদেশ দান। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ৪০৭।',
            name:
                ' আবদুল্লাহ ইবনু ইউসুফ (রহঃ) ..... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তোমরা কি মনে কর যে, আমার দৃষ্টি (কেবল) কিবলার দিকে? আল্লাহর কসম! আমার কাছে তোমাদের খুশূ (বিনয়) ও রুকু কিছুই গোপন থাকে না। অবশ্যই আমি আমার পেছন থেকেও তোমাদের দেখি। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '৪০৮। ',
            name:
                ' ইয়াহইয়া ইবনু সালিহ (রহঃ) ..... আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদেরকে নিয়ে সালাত (নামায/নামাজ) আদায় করলেন। তারপর তিনি মিম্বরে উঠলেন এবং ইরশাদ করলেন, তোমাদের সালাতে রুকুতে আমি অবশ্যই তোমাদের আমার পেছন থেকে দেখি, যেমন এখন তোমাদের দেখছি। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২৮২। ',
        name: ' অমুক গোত্রের মসজিদ বলা যায় কি? ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৪০৯। ',
            name:
                ' আবদুল্লাহ ইবনু ইউসুফ (রহঃ) .... আবদুল্লাহ ইবনু উমর (রাঃ) থেকে বর্ণিত যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যুদ্ধের জন্য তৈরী ঘোড়াকে ‘হাফয়া’ (নামক স্থান) থেকে ‘সানিয়াতুল ওয়াদা’ পর্যন্ত দৌড় প্রতিযোগিতা করিয়েছিলেন। আর যে ঘোড়া যুদ্ধের জন্য তৈরী নয়, সে ঘোড়াকে ‘সানিয়া’ থেকে যুরাইক গোত্রের মসজিদ পর্যন্ত দৌড় প্রতিযোগিতা করিয়েছিলেন। আর এই প্রতিযোগিতায় আবদুল্লাহ ইবনু উমর (রাঃ) অগ্রগামী ছিলেন। পরিচ্ছেদ:২৮৩। মসজিদে কোন কিছু ভাগ করা (খেজুরের) ছড়া ঝুলানো। আবূ ‘আবদুল্লাহ বুখারী (রহঃ) বলেন,الْعِذْقُ - الْقِنْوُ একই জিনিসের নাম। এর দ্বিবচনقِنْوَانِ এবং বহুবচনেও قِنْوَانٌ যেমন صِنْوٍ ও وَصِنْوَانٍ। ইব্রাহীম (রহঃ) ... আনাস (রাঃ) থেকে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে বাহরাইন থেকে কিছু মাল এলো। তিনি বললেনঃ এগুলো মসজিদে রেখে দাও। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এ যাবত যত মাল আনা হয়েছে তার মধ্যে এ মালই ছিল পরিমাণে সবচে বেশী। তারপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সালাতে চলে গেলেন এবং এর দিকে ভ্রুক্ষেপও করলেন না। সালাত (নামায/নামাজ) শেষ করে তিনি এসে মালের কাছে গিয়ে বসলেন। তিনি যাকেই দেখলেন, কিছু মাল তাকে দিয়ে দিলেন। ইতিমধ্যে আব্বাস (রাঃ) এসে বললেন, ইয়া রাসূলাল্লাহ! আমাকেও কিছু দিন। কারণ আমি নিজে ও আকিলের (এ দু’জন বদরের যুদ্ধে মুসলিমদের কয়েদি ছিলেন) পক্ষ থেকে মুক্তিপণ দিয়েছি। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে বললেনঃ নিয়ে যান। তিনি তা কাপড়ে ভরে নিলেন। তারপর তা উঠাতে চেষ্টা করলেন, কিন্তু পারলেন না। তিনি বললেন, ইয়া রাসূলাল্লাহ! কাউকে বলুন, যেন আমাকে এটি উঠিয়ে দেয়। তিনি বললেনঃ না। আব্বাস (রাঃ) বললেনঃ তাহলে আপনি নিজেই তুলে দিন। তিনি বললেনঃ না। তারপর আব্বাস (রাঃ) তা থেকে কিছু মাল রেখে দিলেন। তারপর আবার তা তুলতে চেষ্টা করলেন। (এবারও তুলতে না পেরে) তিনি বললেনঃ ইয়া রাসূলাল্লাহ! কাউকে আদেশ করুন যেন আমাকে তুলে দেয়। তিনি বললেনঃ না। তাহলে আপনিই আমাকে তুলে দিন। তিনি বললেনঃ না। তারপর আব্বাস (রাঃ) আরো কিছু মাল নামিয়ে রাখলেন। এবার তিনি উঠাতে পারলেন এবং তা নিজের কাঁধে তুলে নিয়ে বেরিয়ে গেলেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার লোভ দেখে এতই অবাক হয়েছিলেন যে, তিনি চোখের আড়াল না হওয়া পর্যন্ত আব্বাসের দিকে তাকিয়ে থাকলেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একটি দিরহাম বাকী থাকা পর্যন্ত উঠলেন না। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২৮৪। ',
        name: 'মসজিদে যাকে খয়ার দাওয়াত দেয়া হয়, আর যিনি তা কবুল করেন। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ৪১০। ',
            name:
                ' আবদুল্লাহ ইবনু ইউসুফ (রহঃ) .... আনাস (রাঃ) থেকে বর্ণিত, তিনি বলেন: আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে মসজিদে পেলাম আর তার সঙ্গে ছিলেন কয়েকজন সাহাবী। আমি দাঁড়িয়ে গেলাম। তিনি আমাকে বললেনঃ তোমাকে কি আবূ তালহা পাঠিয়েছেন? আমি বললামঃ জী হ্যাঁ। তিনি বললেনঃ খাবারের জন্য? আমি বললামঃ জী হ্যাঁ তখন তার আশেপাশে যারা ছিলেন, তাঁদেরকে বললেনঃ উঠ। তারপর তিনি চলতে শুরু করলেন। (রাবী বলেন) আমি তাঁদের সামনে সামনে চললাম।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২৮৫। ',
        name: '  মসজিদে বিচার করা ও নারী-পুরুষের মধ্যে লি’য়ান করা।',
        hadisNumberList: [
          HadisNumberModel(
            id: '৪১১। ',
            name:
                '  ইয়াহইয়া (রহঃ) .... সাহল ইবনু সা’দ (রাঃ) থেকে বর্ণিত যে, এক ব্যাক্তি বলল: ইয়া রাসুলাল্লাহ! কেউ তার স্ত্রীর সাথে অন্য ব্যাক্তিকে দেখতে পেলে কি সে তাকে হত্যা করবে? পরে মসজিদে সে ও তার স্ত্রী একে অন্যকে লি’আন করল। তখন আমি উপস্থিত ছিলাম।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২৮৬। ',
        name:
            ' কারো ঘরে প্রবেশ করলে যেখানে ইচ্ছা বা যেখানে নির্দেশ করা হয় সেখানেই সালাত আদায় করবে। এ ব্যাপারে বেশী খোঁজাখুঁজি করবে না। ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৪১২। ',
            name:
                ' আবদুল্লাহ ইবনু মাসলামা (রহঃ) ..... ইতবান ইবনু মালিক (রাঃ) থেকে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার ঘরে এলেন এবং বললেনঃ তোমার ঘরের কোন স্থানে সালাত (নামায/নামাজ) আদায় করা পছন্দ কর? তিনি বলেন, তখন আমি তাঁকে একটি স্থানের দিকে ইশারা করলাম। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকবীর বললেন। আমরা তাঁর পেছনে কাতার করে দাঁড়ালাম তিনি দু’রাকাত সালাত আদায় করলেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২৮৭। ',
        name: ' ঘরে মসজিদ তৈরী করা। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'وَصَلَّى الْبَرَاءُ بْنُ عَازِبٍ فِي مَسْجِدِهِ فِي دَارِهِ جَمَاعَةً বারা ইবন আযিব (রাঃ) নিজের মসজিদে জামা\'আত করে সালাত আদায় করেছিলেন ৪১৩। সা’ঈদ ইবনু উফায়র (রহঃ) ..... মাহমুদ ইবনু রাবী আনসারী (রাঃ) থেকে বর্ণিত যে, ইতবান ইবনু মালিক (রাঃ), যিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে বদরের যুদ্ধে অংশ গ্রহণকারী আনসারগণের অন্যতম, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে হাযির হয়ে আরজ করলেন: ইয়া রাসুলাল্লাহ! আমার দৃষ্টিশক্তি হ্রাস পেয়েছে। আমি আমার গোত্রের লোকদের নিয়ে সালাত (নামায/নামাজ) আদায় করি। কিন্তু বৃষ্টি হলে আমার ও তাদের বাসস্থানের মধ্যবর্তী নিম্নভূমিতে পানি জমে যাওয়াতে তা আর পার হয়ে তাদের মসজিদে পৌঁছতে এবং তাদেরকে নিয়ে সালাত আদায় করতে সমর্থ হই না। আর ইয়া রাসুলাল্লাহ! আমার একান্ত ইচ্ছা যে, আপনি আমার ঘরে তাশরিফ নিয়ে কোন এক স্থানে সালাত আদায় করেন এবং আমি সেই স্থানকে সালাতের জন্য নির্দিষ্ট করে নিই। রাবি বলেন, তাকে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ ইনশাআল্লাহ অচিরেই আমি তা করব। ইতবান (রাঃ) বলেন: পরদিন সূর্যোদয়ের পর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও আবূ বকর (রাঃ) আমার ঘরে তাশরিফ আনেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঘরে প্রবেশ করতে চাইলে আমি তাঁকে অনুমতি দিলাম। ঘরে প্রবেশ করে তিনি না বসেই জিজ্ঞাসা করলেন: তোমার ঘরের কোন স্থানে সালাত আদায় করা পছন্দ কর? তিনি বলেন: আমি তাঁকে ঘরের এক প্রান্তের দিকে ইংগিত করলাম। তারপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দাঁড়ালেন এবং তাকবীর বললেন। তখন আমরাও দাঁড়ালাম এবং কাতারবন্দী হলাম। তিনি দু’রাকাত সালাত আদায় করলেন। তারপর সালাম ফিরালেন। তিনি (ইতবান) বলেন, আমরা তাঁকে কিছুক্ষণের জন্য বসালাম এবং তাঁর তৈরী ‘খাযীরাহ’ নামক খাবার তাঁর সামনে পেশ করলাম। রাবী বলেন, এ সময় মহল্লার কিছু লোক ঘরে ভীড় জমালেন। তখন তিনি উপস্থিত লোকদের মধ্য থেকে এক ব্যাক্তি বলে উঠলেন, ‘মালিক ইবনু দুখাইশিন কোথায়? অথবা বললেন ‘ইবনু দুখশুন’ কোথায়? তখন একজন জওয়াব দিলেন, সে মুনাফিক। সে মহান আল্লাহ ও আল্লাহর রাসূলকে ভালবাসে না। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ এরূপ বলো না। তুমি কি দেখছ না যে, সে আল্লাহর সন্তোষ লাভের আশায় ‘লা ইলাহা ইল্লাল্লাহ’ বলেছে? তখন সে ব্যাক্তি বললেনঃ আল্লাহ এবং তাঁর রাসূলই ভাল জানেন। আমরা তো তাঁর সম্পর্ক ও হিত কামনা মুনাফিকদের সাথেই দেখি। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ আল্লাহ তা’আলা তো এমন ব্যাক্তির প্রতি জাহান্নাম হারাম করে দিয়েছেন, যে আল্লাহর সন্তুষ্টি লাভের আশায় ‘লা ইলাহা ইল্লাল্লাহ’ বলে। রাবী ইবনু শিহাব বলেনঃ তারপর আমি মাহমুদ ইবনু রাবী (রাঃ) এর হদীস সম্পর্কে হোসাইন ইবনু মুহম্মদ আনসারী (রহঃ) কে জিজ্ঞাসা করলাম, যিনি বানূ সালিম গোত্রের একজন নেতৃস্থানীয় ব্যাক্তি ছিলেন। তিনি এ হদীস সমর্থন করলেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২৮৮',
        name: '। মসজিদে প্রবেশ ও অন্যান্য কাজ ডান দিক থেকে আরম্ভ করা। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                ' وَكَانَ ابْنُ عُمَرَ يَبْدَأُ بِرِجْلِهِ الْيُمْنَى، فَإِذَا خَرَجَ بَدَأَ بِرِجْلِهِ الْيُسْرَى ইবন উমর (রাঃ) প্রবেশের সময় ডান পা দিয়ে শুরু করতেন এবং বের হওয়ার সময় বাম পা দিয়ে শুরু করতেন। ৪১৪। সুলায়মান ইবনু হারব (রহঃ) ..... আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিজের সমস্ত কাজে যথাসম্ভব ডানদিক থেকে আরম্ভ করা পছন্দ করতেন। পবিত্রতা হাসিলের সময়, মাথা আঁচড়ানোর সময় এবং জুতা পরিধানের সময়ও।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২৮৯।',
        name: ' জাহিলি যুগের মুশরিকদের কবর খুড়ে ফেলে মসজিদ নির্মাণ করা। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'لِقَوْلِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَعَنَ اللَّهُ الْيَهُودَ، اتَّخَذُوا قُبُورَ أَنْبِيَائِهِمْ مَسَاجِدَ». وَمَا يُكْرَهُ مِنَ الصَّلاَةِ فِي الْقُبُورِ. وَرَأَى عُمَرُ أَنَسَ بْنَ مَالِكٍ يُصَلِّي عِنْدَ قَبْرٍ فَقَالَ الْقَبْرَ الْقَبْرَ. وَلَمْ يَأْمُرْهُ بِالإِعَادَةِ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ইয়াহূদীদের উপর আল্লাহর অভিশাপ, তারা নবীগণের কবরকে মসজিদ বানিয়েছে। আর কবরের উপর সালাত আদায় করা মাকরূহ হওয়া প্রসঙ্গে ‘উমর ইবনে খাত্তাব (রাঃ) আনাস ইবনে মালিক (রাঃ)-কে একটি কবরের কাছে সালাত আদায় করতে দেখে বললেন: কবর! কবর! কিন্তু তিনি তাঁকে সালাত পুনরায় আদায় করতে বলেন নি। ৪১৫। মুহম্মদ ইবনু মূসান্না (রহঃ) ..... আয়িশা (রাঃ) থেকে বর্ণিত যে, উম্মে হাবীবা ও উম্মে সালমা (রাঃ) হাবশায় তাঁদের দেখা একটি গির্জার কথা বলেছিলেন, যাতে বেশ কিছু মূর্তি ছিল। তাঁরা উভয়ে বিষয়টি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট বর্ণনা করলেন। তিনি ইরশাদ করলেনঃ তাদের অবস্থা ছিল এমন যে, কোন সৎ লোক মারা গেলে তারা তার কবরের উপর মসজিদ বানাতো। আর তার ভিতরে ঐ লোকের মূর্তি তৈরী করে রাখতো। কিয়ামতের দিন তারাই আল্লাহর কাছে সবচাইতে নিকৃষ্ট সৃষ্টি বলে গণ্য হবে।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২৮৯।',
        name: ' জাহিলি যুগের মুশরিকদের কবর খুড়ে ফেলে মসজিদ নির্মাণ করা। ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৪১৬। ',
            name:
                '  মুসাদ্দাদ (রহঃ) ...... আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মদিনায় পৌঁছে প্রথমে মদিনার উচ্চ এলাকায় অবস্থিত বানূ ‘আমর ইবনু আউফ’ নামক গোত্রে উপনীত হন। তাদের সঙ্গে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম চৌদ্দ দিন (অপর বর্ণনায় চব্বিশ দিন) অবস্থান করেন। তারপর তিনি বানূ নাজ্জারকে ডেকে পাঠালেন। তারা কাঁধে তলোয়ার ঝুলিয়ে উপস্থিত হল। আমি যেন এখনো সে দৃশ্য দেখতে পাচ্ছি যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ছিলেন তার বাহনের উপর, আবূ বকর (রাঃ) সে বাহনেই তাঁর পেছনে আর বানূ নাজ্জারের দল তাঁর আশেপাশে। অবশেষে তিনি আবূ আইয়্যুব আনসারী (রাঃ) এর ঘরে সামনে অবতরণ করলেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যেখানেই সালাতের ওয়াক্ত হয় সেখানেই সালাত (নামায/নামাজ) আদায় করতে পছন্দ করতেন এবং তিনি ছাগল-ভেড়ার খোয়াড়েও সালাত আদায় করতেন। এখন তিনি মসজিদ তৈরী করার নির্দেশ দেন। তিনি বানূ নাজ্জারকে ডেকে বললেনঃ হে বানূ নাজ্জার! তোমরা আমার কাছ থেকে তোমাদের এই বাগিচার মূল্য নির্ধারণ কর। তারা বললোঃ না, আল্লাহর কসম, আমরা এর দাম নেব না। এর দাম আমরা একমাত্র আল্লাহর কাছেই আশা করি। আনাস (রাঃ) বলেনঃ আমি তোমাদের বলছি, এখানে মুশরিকদের কবর এবং ভগ্নাবশেষ ছিল। আর ছিল খেজুরের গাছ। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নির্দেশে মুশরিকদের কবর খুড়ে ফেলা হল। তারপর ভগ্নাবশেষ সমতল করে দেয়া হল, খেজুরের গাছ গুলো কেটে ফেলা হল এবং এর দুই পাশে পাথর বসানো হল। সাহাবীগণ পাথর তুলতে তুলতে ছন্দোবদ্ধ কবিতা আবৃত্তি করছিলেন। আর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-ও তাঁদের সাথে ছিলেন। তিনি তখন বলছিলেনঃ اللَّهُمَّ لاَ خَيْرَ إِلاَّ خَيْرُ الآخِرَهْ فَاغْفِرْ لِلأَنْصَارِ وَالْمُهَاجِرَهْ হে আল্লাহ! আখিরাতের কল্যাণ ছাড়া (প্রকৃতপক্ষে) আর কোন কল্যাণ নেই। আপনি আনসার ও মুহাজিরগণকে ক্ষমা করে দিন।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২৯০।  ',
        name: 'ছাগল থাকার স্থানে সালাত আদায় করা। ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৪১৭।  ',
            name:
                'সুলায়মান ইবনু হারব (রহঃ) ..... আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ছাগল থাকার স্থানে সালাত (নামায/নামাজ) আদায় করছেন। রাবী বলেন, তারপর আমি আনাস (রাঃ)-কে বলতে শুনেছি যে, মসজিদ নির্মাণের আগে তিনি (নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) ছাগল থাকার স্থানে সালাত আদায় করেছেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২৯১। ',
        name: ' উট রাখার স্থানে সালাত আদায় করা। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ৪১৮। ',
            name:
                ' সাদাকা ইবনু ফাযল (রহঃ) ... নাফি (রহঃ) থেকে বর্ণিত, তিনি বলেন, আমি ইবনু উমর (রাঃ)-কে তাঁর উটের দিকে সালাত (নামায/নামাজ) আদায় করতে দেখছি। আর ইবনু উমর (রাঃ) বলেছেনঃ আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে তা করতে দেখেছি।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২৯২।',
        name:
            ' চুলা আগুন বা এমন কোন বস্তু যার উপাসনা করা হয়, তা সামনে রেখে কেবল আল্লাহর সন্তুষ্টি হাসিল করারই উদ্দেশ্যে সালাত আদায় করা। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                ' وَقَالَ الزُّهْرِيُّ: أَخْبَرَنِي أَنَسٌ قَالَ: قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «عُرِضَتْ عَلَيَّ النَّارُ وَأَنَا أُصَلِّي যুহরী (রহঃ) বলেনঃ আমাকে আনাস ইবনে মালিক (রাঃ) জানিয়েছেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমার সামনে আগুন (জাহান্নাম) পেশ করা হলো, তখন আমি সালাতে ছিলাম। ৪১৯। আবদুল্লাহ ইবনু মাসলামা (রহঃ) .... আবদুল্লাহ ইবনু আব্বাস (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ একবার সূর্য গ্রহণ হল। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সালাত (নামায/নামাজ) আদায় করলেন। তারপর বললেনঃ আমাকে জাহান্নাম দেখানো হয়েছে। আজকের মত ভয়াবহ দৃশ্য আমি আর কখনো দেখিনি।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২৯৩। ',
        name: '  কবরস্থানে সালাত আদায় করা মাকরূহ।',
        hadisNumberList: [
          HadisNumberModel(
            id: '৪২০।  ',
            name:
                'মুসাদ্দাদ (রহঃ) .... ইবনু উমর (রাঃ) থেকে বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের ঘরেও কিছু সালাত (নামায/নামাজ) আদায় করবে এবং ঘরকে তোমরা কবরে পরিণত করবে না। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২৯৪। ',
        name: ' আল্লাহর গযবে বিধ্বস্ত ও আযাবের স্থানে সালাত আদায় করা। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'وَيُذْكَرُ أَنَّ عَلِيًّا رَضِيَ اللَّهُ عَنْهُ كَرِهَ الصَّلاَةَ بِخَسْفِ بَابِلَ উল্লেখ রয়েছে যে, আলী (রাঃ) ব্যাবিলনের ধ্বংসস্তূপে সালাত আদায় করা মাকরূহ মনে করতেন। ৪২১। ইসমা’ঈল ইবনু আবদুল্লাহ (রহঃ) ..... আবদুল্লাহ ইবনু উমর (রাঃ) থেকে বর্ণিত যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা এসব আযাবপ্রাপ্ত সম্প্রদায়ের লোকালয়ে ক্রন্দনরত অবস্থা ব্যতীত প্রবেশ করবে না। কান্না না আসিলে সেখানে প্রবেশ করো না, যেন তোমাদের প্রতিও এমন আযাব না আসে যা তাদের উপর আপতিত হয়েছিল। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২৯৫।  ',
        name: ' গির্জায় সালাত আদায় করা।',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                ' وَقَالَ عُمَرُ رَضِيَ اللَّهُ عَنْهُ إِنَّا لاَ نَدْخُلُ كَنَائِسَكُمْ مِنْ أَجْلِ التَّمَاثِيلِ الَّتِي فِيهَا الص وَكَانَ ابْنُ عَبَّاسٍ يُصَلِّي فِي الْبِيعَةِ إِلاَّ بِيعَةً فِيهَا تَمَاثِيلُ উমর (রাঃ) বলেছেনঃ আমরা তোমাদের গির্জাসমূহে প্রবেশ করি না, কারণ তাতে মূর্তি রয়েছে। ইবনে আব্বাস (রাঃ) গির্জায় সালাত আদায় করতেন। তবে যেগুলোতে মূর্তি রয়েছে সেগুলোতে নয়। ৪২২। মুহাম্মদ ইবনু সালাম (রহঃ) ..... আয়িশা (রাঃ) থেকে বর্ণিত, উম্মে সালমা (রাঃ) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে তাঁর হাবশায় দেখা মারিয়া নামক একটা গির্জার কথা উল্লেখ করলেন। তিনি সেখানে যে সব প্রতিচ্ছবি দেখেছিলেন, সেগুলোর বর্ণনা দিলেন। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ এরা এমন সম্প্রদায় যে, এদের মধ্যে কোন সৎ বান্দা অথবা বলেছেন কোন সৎ লোক মারা গেলে তার কবরের উপর তারা মসজিদ বানিয়ে নিত। আর তাতে ঐ সব ব্যাক্তির প্রতিচ্ছবি স্থাপন করতো। এরা আল্লাহর কাছে নিকৃষ্ট সৃষ্টি।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২৯৬। ',
        name: '  পরিচ্ছেদ নাই।',
        hadisNumberList: [
          HadisNumberModel(
            id: '৪২৩। ',
            name:
                ' আবূল ইয়ামান (রহঃ) .... উবায়দুল্লাহ ইবনু আবদুল্লাহ ইবনু উতবা (রহঃ) থেকে বর্ণিত, আয়িশা ও আবদুল্লাহ ইবনু আব্বাস (রাঃ) বলেছেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর ওফাত নিকটবর্তী হলে তিনি তাঁর একটা চাঁদরে নিজ মুখমণ্ডল আবৃত করতে লাগলেন। যখন শ্বাস বন্ধ হওয়ার উপক্রম হল, তখন মুখ থেকে চাঁদর সরিয়ে দিলেন। এমতাবস্থায় তিনি বললেনঃ ইয়াহূদী ও নাসারাদের প্রতি আল্লাহর অভিশাপ, তারা তাদের নবীদের (নবীদের) কবরকে মসজিদে পরিণত করেছে। (এ বলে) তারা যে (বিদ’আতী) কার্যকলাপ করত তা থেকে তিনি সতর্ক করলেন ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২৯৬।  ',
        name: ' পরিচ্ছেদ নাই।',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ৪২৪।',
            name:
                '  আবদুল্লাহ ইবনু মাসলামা (রহঃ) ..... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আল্লাহ তা’য়ালা ইয়াহূদীদের ধ্বংস করুন। তারা তাদের নবীদের (নবীদের) কবরকে মসজিদে পরিণত করেছে।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২৯৭। ',
        name:
            ' নবী (ﷺ) এর উক্তিঃ আমার জন্য জমিনকে সালাত আদায়ের স্থান ও পবিত্র হাসিলের উপায় করা হয়েছে।',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                '৪২৫। মুহাম্মদ ইবনু সিনান (রহঃ) .... জাবির ইবনু আবদুল্লাহ (রাঃ) থেকে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আমাকে এমন পাঁচটি বিষয় প্রদান করা হয়েছে, যা আমার আগে কোন নবীকে দেয়া হয়নি। ১. আমাকে এমন প্রভাব দিয়ে সাহায্য করা হয়েছে যা একমাসের দূরত্ব পর্যন্ত অনুভূত হয়। ২. সমস্ত জমিন আমার জন্য সালাত (নামায/নামাজ) আদায়ের স্থান ও পবিত্রতা অর্জনের উপায় করা হয়েছে। কাজেই আমার উম্মতের যে কেউ যেখানে সালাতের ওয়াক্ত হয় (সেখানেই) যেন সালাত আদায় করে নেয়। ৩. আমার জন্য গণীমত হালাল করা হয়েছে। ৪. অন্যান্য নবী নিজেদের বিশেষ গোত্রের প্রতি প্রেরিত হতেন আর আমাকে সকল মানবের প্রতি প্রেরণ করা হয়েছে। ৫. আমাকে (ব্যাপক) শাফা’আতের অধিকার প্রদান করা হয়েছে। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ২৯৮।  ',
        name: 'মসজিদে মহিলাদের ঘুমানো ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ৪২৬। ',
            name:
                ' উবাইদ ইবনু ইসমা’ঈল (রহঃ) ..... আয়িশা (রাঃ) থেকে বর্ণিত, কোন আরব গোত্রের একটি কালো দাসী ছিল। তারা তাকে আযাদ করে দিল। সে তাদেরই সাথে থেকে গেল। সে বলেছে যে, তাদের একটি মেয়ে গলায় লাল চামড়ার ওপর মূল্যবান পাথর খচিত হার পরে বাইরে গেল। দাসী বলেছে, সে হারটা হয়তো নিজে কোথাও রেখে দিয়েছিল, অথবা কোথায় পড়ে গিয়েছিল। তখন চিল তা পড়ে থাকা অবস্থায় গোশতের টুকরা মনে করে ছোঁ মেরে নিয়ে গেল। দাসী বলেছেঃ তারপর গোত্রের লোকেরা বেশ খোঁজাখুঁজি করতে লাগলো। কিন্তু তারা তা পেল না। তখন তারা আমার উপর এর দোষ চাপাল। সে বলেছেঃ তারা আমার উপর তল্লাশী শুরু করলো, এমনকি আমার লজ্জা-স্থানেও তল্লাশী চালাল। দাসীটি বলেছেঃ আল্লাহর কসম! আমি তাদের সাথে সে অবস্থায় দাঁড়ানো ছিলাম, এমন সময় চিলটি উড়ে যেতে যেতে হারটি ফেলে দিল। সে বলেছে তাদের সামনেই তা পড়লো। তখন আমি বললামঃ তোমরা তো এর জন্যই আমার উপর দোষ চাপিয়ে ছিলে! তোমরা আমার উপর সন্দেহ করেছিলে অথচ আমি এ ব্যাপারে সম্পূর্ণ নির্দোষ। এই তো সেই হার! সে বলেছেঃ তারপর সে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এসে ইসলাম গ্রহণ করলো। আয়িশা (রাঃ) বলেনঃ তাঁর জন্য মসজিদে (নববীতে) একটা তাঁবু অথবা ছাপড়া করে দেয়া হয়েছিল। আয়িশা (রাঃ) বলেন (দাসীটি) আমার কাছে আসতো আর আমার সঙ্গে কথাবার্তা বলতো। সে আমার কাছে যখনই বসত তখনই বলতোঃ وَيَوْمَ الْوِشَاحِ مِنْ أَعَاجِيبِ رَبِّنَا * أَلاَ إِنَّهُ مِنْ بَلْدَةِ الْكُفْرِ أَنْجَانِي “সেই হারের দিনটি আমার রবের আশ্চর্য ঘটনা বিশেষ। জেনে রাখুন সে ঘটনাটি আমাকে কুফরের শহর থেকে মুক্তি দিয়েছে”। আয়িশা (রাঃ) বলেন, আমি তাকে বললামঃ কি ব্যাপার, তুমি আমার কাছে বসলেই যে এ কথাটা বলে থাক? আয়িশা (রাঃ) বলেন, সে তখন আমার কাছে উক্ত ঘটনা বর্ণনা করল।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ২৯৯।',
        name: '  মসজিদে পুরুষের ঘুমানো।',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'وَقَالَ أَبُو قِلاَبَةَ عَنْ أَنَسٍ قَدِمَ رَهْطٌ مِنْ عُكْلٍ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَانُوا فِي الصُّفَّةِ. وَقَالَ عَبْدُ الرَّحْمَنِ بْنُ أَبِي بَكْرٍ كَانَ أَصْحَابُ الصُّفَّةِ الْفُقَرَاءَ আবূ কিলাবা (রহঃ) আনাস ইবনে মালিক (রাঃ) থেকে বর্ণনা করেন, উকল গোত্রের কতিপয় ব্যক্তি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে আসলেন এবং সুফ্‌ফায় অবস্থান করলেন। আবদুর রহমান ইবনে আবূ বকর (রাঃ) বলেনঃ সুফ্‌ফাবাসিগণ ছিলেন ছিলেন দরিদ্র। ৪২৭। মুসাদ্দাদ (রহঃ) ..... আবদুল্লাহ ইবনু উমর (রাঃ) থেকে বর্ণিত, তিনি মসজিদে নববীতে ঘুমাতেন। তিনি ছিলেন অবিবাহিত। তাঁর কোন পরিবার-পরিজন ছিল না। ',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ৪২৮।',
            name:
                '  কুতায়বা ইবনু সা’ঈদ (রহঃ) .... সাহল ইবনু সা’দ (রাঃ) থেকে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফাতিমা (রাঃ) এর ঘরে এলেন, কিন্তু আলী (রাঃ)-কে ঘরে পেলেন না। তিনি ফাতিমা (রাঃ)-কে জিজ্ঞাসা করলেনঃ তোমার চাচাতো ভাই কোথায়? তিনি বললেনঃ আমার ও তাঁর মধ্যে কিছু ঘটেছে। তিনি আমার সাথে রাগ করে বাইরে চলে গেছেন। আমার কাছে দুপুরের বিশ্রামও করেন নি। তারপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক ব্যাক্তিকে বললেনঃ দেখ তো সে কোথায়? সে ব্যাক্তি খোঁজে এসে বললোঃ ইয়া রাসুলাল্লাহ! তিনি মসজিদে শুয়ে আছেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এলেন, তখন আলী (রাঃ) কাত হয়ে শুয়ে ছিলেন। তাঁর শরীরের এক পাশের চাঁদর পড়ে গিয়েছে এবং তাঁর শরীরে মাটি লেগেছে। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর শরীরের মাটি ঝেড়ে দিতে দিতে বললেনঃ উঠ, হে আবূ তুরাব! উঠ, হে আবূ তুরাব!',
            ref: '',
          ),
          HadisNumberModel(
            id: '৪২৯। ',
            name:
                ' ইউসুফ ইবনু ঈসা (রহঃ) .... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, তিনি বলেন, আমি সত্তরজন আসহাবে সুফ্‌ফাকে দেখেছি, তাঁদের কারো গায়ে বড় চাঁদর ছিল না। হয়ত ছিল কেবল তহবন্দ কিংবা ছোট চাদর, যা তাঁরা ঘাড়ে বেঁধে রাখতেন। (নীচের দিকে) কারো নিসফে সাক বা অর্ধ হাঁটু পর্যন্ত আর কারো টাখনু পর্যন্ত ছিল। তাঁরা লজ্জা-স্থান দেখা যাওয়ার ভয়ে কাপড় হাতে ধরে একত্র করে রাখতেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩০০।',
        name: '  সফর থেকে ফিরে আসার পর সালাত।',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                ' وَقَالَ كَعْبُ بْنُ مَالِكٍ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَدِمَ مِنْ سَفَرٍ بَدَأَ بِالْمَسْجِدِ فَصَلَّى فِيهِ কা‘ব ইবনু মালিক (রাঃ) বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সফর হতে ফিরে এসে প্রথমে মসজিদে প্রবেশ করে সালাত আদায় করতেন। ৪৩০। খাল্লাদ ইবনু ইয়াহইয়া (রহঃ) ...... জাবির ইবনু আবদুল্লাহ (রাঃ) থেকে বর্ণিত, তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে আসলাম। তিনি তখন মসজিদে ছিলেন। তখন মিস’আর (রহঃ) বলেনঃ আমার মনে পড়ে রাবী মুহারিব (রহঃ) চাশতের সময়ের কথা বলেছেন। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তুমি দু’রাকাত সালাত (নামায/নামাজ) আদায় কর। জাবির (রাঃ) বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে আমার কিছু পাওনা ছিল। তিনি তা দিয়ে দিলেন এবং কিছু বেশীও দিলেন।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩০১।',
        name:
            ' তোমাদের কেউ মসজিদে প্রবেশ করলে সে যেন বসার পূর্বে দু’রাকাত সালাত আদায় করে নেয়।',
        hadisNumberList: [
          HadisNumberModel(
            id: '৪৩১। ',
            name:
                '  আবদুল্লাহ ইবনু ইউসুফ (রহঃ) .... আবূ কাতাদা সালামী (রাঃ) থেকে বর্ণিত, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের কেউ মসজিদে প্রবেশ করলে সে যেন বসার পূর্বে দু’রাকাত সালাত (নামায/নামাজ) আদায় করে নেয়।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩০২। ',
        name: ' মসজিদে হাদাস হওয়া (উযূ নষ্ট হওয়া) ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ৪৩২।',
            name:
                ' আবদুল্লাহ ইবনু ইউসুফ (রহঃ) ..... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের কেউ মসজিদে সালাতের পর হাদাসের পূর্ব পর্যন্ত যেখানে সে সালাত (নামায/নামাজ) আদায় করেছ সেখানে যতক্ষণ বসে থাকে ততক্ষণ ফিরিশতারা তার জন্য দোয়া করতে থাকেন। তাঁরা বলেনঃ হে আল্লাহ! তাকে ক্ষমা করুন! হে আল্লাহ! তার প্রতি রহম করুন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩০৩। ',
        name: '  মসজিদ নির্মাণ করা।',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                ' وَقَالَ أَبُو سَعِيدٍ كَانَ سَقْفُ الْمَسْجِدِ مِنْ جَرِيدِ النَّخْلِ. وَأَمَرَ عُمَرُ بِبِنَاءِ الْمَسْجِدِ وَقَالَ أَكِنَّ النَّاسَ مِنَ الْمَطَرِ، وَإِيَّاكَ أَنْ تُحَمِّرَ أَوْ تُصَفِّرَ، فَتَفْتِنَ النَّاسَ. وَقَالَ أَنَسٌ يَتَبَاهَوْنَ بِهَا، ثُمَّ لاَ يَعْمُرُونَهَا إِلاَّ قَلِيلاً. وَقَالَ ابْنُ عَبَّاسٍ لَتُزَخْرِفُنَّهَا كَمَا زَخْرَفَتِ الْيَهُودُ وَالنَّصَارَى আবু সা’ঈদ (রাঃ) বলেন, মসজিদে নববীর ছাদ ছিল খেজুর গাছের ডালের তৈরী। উমর (রাঃ) মসজিদ নির্মাণের হুকুম দিয়ে বলেনঃ আমি লোকদেরকে বৃষ্টি থেকে রক্ষা করতে চাই। মসজিদে লাল বা হলুদ রঙ লাগানো থেকে সাবধান থাক, এতে মানুষকে তুমি ফিতনায় ফেলবে। আনাস (রাঃ) বলেনঃ লোকেরা মসজিদ নিয়ে গর্ব করবে অথচ তারা একে কমই (ইবাদতের মাধ্যমে) আবাদ রাখবে। ইবনে আব্বাস (রাঃ) বলেনঃ তোমরা তো ইয়াহূদী ও নাসারাদের মত মসজিদকে সৌন্দর্যমন্ডিত করে ফেলবে। ৪৩৩। আলী ইবনু আবদুল্লাহ (রহঃ) ..... আবদুল্লাহ ইবনু উমর (রাঃ) থেকে বর্ণিত রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সময়ে মসজিদ তৈরী হয় কাঁচা ইট দিয়ে, তার ছাদ ছিল খেজুরের ডালের, খুঁটি ছিল খেজুর গাছের। আবূ বকর (রাঃ) এতে কিছু বাড়ান নি। অবশ্য উমর (রাঃ) বাড়িয়েছেন। আর তার ভিত্তি তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর যুগে যে ভিত্তি ছিল তার উপর কাঁচা ইট ও খেজুরের ডাল দিয়ে নির্মাণ করেন এবং তিনি খুঁটিগুলো পরিবর্তন করে কাঠের (খুঁটি) লাগান। তারপর উসমান (রাঃ) তাতে পরিবর্তন সাধন করেন এবং অনেক বৃদ্ধি করেন। তিনি দেওয়াল তৈরী করেন নকশী পাথর ও চুন-সুরকি দিয়ে। খুঁটিও দেন নকশা করা পাথরের, ছাদ বানান সেগুন কাঠ দিয়ে।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩০৪। ',
        name: '  মসজিদ নির্মাণে সহযোগিতা।',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'مَا كَانَ لِلْمُشْرِكِينَ أَنْ يَعْمُرُوا مَسَاجِدَ اللَّهِ شَاهِدِينَ عَلَى أَنْفُسِهِمْ بِالْكُفْرِ أُولَئِكَ حَبِطَتْ أَعْمَالُهُمْ وَفِي النَّارِ هُمْ خَالِدُونَ إِنَّمَا يَعْمُرُ مَسَاجِدَ اللَّهِ مَنْ آمَنَ بِاللَّهِ وَالْيَوْمِ الآخِرِ وَأَقَامَ الصَّلاَةَ وَآتَى الزَّكَاةَ وَلَمْ يَخْشَ إِلاَّ اللَّهَ فَعَسَى أُولَئِكَ أَنْ يَكُونُوا مِنَ الْمُهْتَدِينَ আর আল্লাহ তা’আলার বাণীঃ এমন হতে পারে না যে, মুশরিকরা আল্লাহর মসজিদের রক্ষণাবেক্ষণ করবে ... (৯ : ১৭) ৪৩৪। মুসাদ্দাদ (রহঃ) ... ইকরিমা (রহঃ) বর্ণিত, তিনি বলেনঃ ইবনু আব্বাস (রাঃ) আমাকে ও তার ছেলে আলী (রহঃ)-কে বললেনঃ তোমরা উভয়ই আবূ সা’ঈদ (রাঃ) এর কাছে যাও এবং তাঁর থেকে হদীস শুনে আস। আমরা গেলাম। তখন তিনি এক বাগানে কাজ করছেন। তিনি আমাদেরকে দেখে চাদরে হাঁটু মুড়ি দিয়ে বসলেন এবং পরে হাদিস বর্ণনা শুরু করলেন। শেষ পর্যায়ে তিনি মসজিদে নববী নির্মাণ আলোচনায় আসলেন। তিনি বললেনঃ আমরা একটা একটা করে কাঁচা ইট বহন করছিলাম আর আম্মার (রাঃ) দুটো দুটো করে কাঁচা ইট বহন করছিলেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তা দেখে তাঁর দেহ থেকে মাটি ঝাড়তে লাগলেন এবং বলতে লাগলেনঃ আম্মারের জন্য আফসোস, তাকে বিদ্রোহী দল হত্যা করবে। সে তাদেরকে আহবান করবে জান্নাতের দিকে আর তারা আহবান করবে জাহান্নামের দিকে। আবূ সা’ঈদ (রাঃ) বলেনঃ তখন আম্মার (রাঃ) বললেনঃ আমি ফিতনা থেকে আল্লাহর কাছে পানাহ চাই। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩০৫।',
        name:
            ' কাঠের মিম্বর তৈরী ও মসজিদ নির্মাণে কাঠমিস্ত্রী ও রাজমিস্ত্রীর সাহায্য গ্রহণ করা। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ৪৩৫।',
            name:
                '  কুতায়বা ইবনু সা’ঈদ (রহঃ) .... সাহল (রাঃ) থেকে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক মহিলার নিকট লোক পাঠিয়ে বললেনঃ তুমি তোমার গোলাম কাঠমিস্ত্রীকে বল, সে যেন আমার বসার জন্য কাঠের মিম্বর তৈরী করে দেয়।',
            ref: '',
          ),
          HadisNumberModel(
            id: '৪৩৬। ',
            name:
                ' খাল্লাদ ইবনু ইয়াহইয়া (রহঃ) .... জাবির ইবনু আবদুল্লাহ (রাঃ) থেকে বর্ণিত, এক মহিলা বললেনঃ ইয়া রাসুলাল্লাহ! আমি কি আপনার বসার জন্য কিছু তৈরী করে দিব? আমার এক কাঠমিস্ত্রী গোলাম আছে। তিনি বললেনঃ যদি তোমার ইচ্ছা হয়। তারপর তিনি একটি মিম্বর তৈরী করিয়ে দিলেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩০৬।',
        name: ' যে ব্যক্তি মসজিদ নির্মাণ করে। ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৪৩৭।  ',
            name:
                ' ইয়াহইয়া ইবনু সুলায়মান (রহঃ) .... উবায়দুল্লাহ খাওলানী (রহঃ) থেকে বর্ণিত, তিনি উসমান ইবনু আফফান (রাঃ)-কে বলতে শুনেছেন, তিনি যখন মসজিদে নববী নির্মাণ করেছিলেন তখন লোকজনের মন্তব্যের প্রেক্ষিতে বলেছিলেনঃ তোমরা আমার উপর অনেক বাড়াবাড়ি করছ অথচ আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছিঃ যে ব্যাক্তি মসজিদ নির্মাণ করে, বুকায়র (রহঃ) বলেনঃ আমার মনে হয় রাবী ‘আসিম’ (রহঃ) তাঁর বর্ণনায় উল্লেখ করছেন, আল্লাহর সন্তুষ্টির উদ্দেশ্যে, আল্লাহ তা\'আলা তার জন্য জান্নাতে অনুরূপ ঘর তৈরী করবেন।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩০৭। ',
        name: ' মসজিদ অতিক্রম কালে তীরের ফলক ধরে রাখবে। ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৪৩৮।  ',
            name:
                'কুতায়বা ইবনু সা’ঈদ (রহঃ) ..... জাবির ইবনু আবদুল্লাহ (রাঃ) থেকে বর্ণিত, তিনি বলেন, এক ব্যাক্তি তীর সাথে করে মসজিদে নববী অতিক্রম করছিল। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে বললেনঃ এর ফলকগুলো হাতে ধরে রাখ। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩০৮। ',
        name: '  মসজিদ অতিক্রম করা।',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ৪৩৯।',
            name:
                ' মূসা ইবনু ইসমা’ঈল (রহঃ) .... আবূ বুরদা (রহঃ) এর পিতা আবদুল্লাহ (রাঃ) থেকে বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যাক্তি তীর নিয়ে আমাদের মসজিদ অথবা বাজার দিয়ে চলে সে যেন তার ফলক হাতে ধরে রাখে, যাতে করে তার হাতে কোন মুসলিম আঘাত না পায়।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩০৯। ',
        name: ' মসজিদে কবিতা পাঠ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৪৪০। ',
            name:
                ' আবূল ইয়ামান (রহঃ) ..... আবূ সালমা ইবনু আবদুর রহমান ইবনু আওফ (রহঃ) থেকে বর্ণিত, হাস্‌সান ইবনু সাবিত আনসারী (রাঃ) আবূ হুরায়রা (রাঃ)-কে আল্লাহর কসম দিয়ে এ কথার সাক্ষ্য চেয়ে বলেনঃ আপনি কি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে একথা বলতে শুনেছেন, হে হাস্‌সান! রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর পক্ষ থেকে (কবিতার মাধ্যমে মুশরিকদের) জওয়াব দাও। হে আল্লাহ! হাসসানকে রূহুল কুদুস (জিবরীল আলাইহিস সালাম) দ্বারা সাহায্য করুন। আবূ হুরায়রা (রাঃ) জওয়াবে বললেনঃ হ্যাঁ। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩১০।',
        name: '  বর্শা নিয়ে মসজিদে প্রবেশ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৪৪১। ',
            name:
                ' আবদুল আযীয ইবনু আবদুল্লাহ (রহঃ) ..... আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেন, একদিন আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে আমার ঘরের দরজায় দেখলাম। তখন হাবশার লোকেরা মসজিদে (বর্শা দ্বারা) অনুশীলন করছিল। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর চাঁদর দিয়ে আমাকে আড়াল করে রাখছিলেন। আমি ওদের অনুশীলন দেখছিলাম। ইবরাহীম ইবনু মুনযির (রহঃ) আয়িশা (রাঃ) থেকে অতিরিক্ত বর্ণনা করেন যে, তিনি বলেছেনঃ আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে দেখলাম এমতাবস্থায় হাবশীরাা তাদের বর্শা নিয়ে অনুশীলন করছিল। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩১১। ',
        name: ' মসজিদের মিম্বরে ক্রয়-বিক্রয়ের আলোচনা ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৪৪২। ',
            name:
                '  আলী ইবনু আবদুল্লাহ (রহঃ) ..... আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেন, বারীরা (রাঃ) তাঁর কাছে এসে কিতাবতের* দেনা শোধের জন্য সাহায্য চাইলেন। তখন তিনি বললেনঃ তুমি চাইলে আমি (তোমার মূল্য) তোমার মালিককে দিয়ে দিব এ শর্তে যে, উত্তরাধিকার-স্বত্ব থাকবে আমার। তাঁর মালিক আয়িশা (রাঃ)-কে বললোঃ আপনি চাইলে বাকী মূল্য বারীরাকে দিতে পারেন। রাবী সুফিয়ান (রহঃ) আর একবার বলেছেনঃ আপনি চাইলে তাকে আযাদ করতে পারেন, তবে উত্তরাধিকার-স্বত্ব থাকবে আমাদের। যখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আসলেন তখন আমি তাঁর কাছে ব্যাপারটি বললাম। তিনি বললেনঃ তুমি তাকে ক্রয় করে আযাদ করে দাও। কারণ উত্তরাধিকার-স্বত্ব থাকে তারই, যে আযাদ করে। তারপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মিম্বরের উপর দাঁড়ালেন। সুফিয়ান (রহঃ) আর একবার বলেনঃ এরপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মিম্বরে আরোহণ করে বললেনঃ লোকদের কি হল? তারা এমন সব শর্ত করে যা আল্লাহর কিতাবে নেই। কেউ যদি এমন শর্ত আরোপ করে যা আল্লাহর কিতাবে নেই, তাঁর সে শর্তের কোন মূল্য নেই। এমনকি এরূপ শর্ত একশবার আরোপ করলেও। মালিক (রহঃ) .... আমরা (রহঃ) থেকে রাবী’য়া (রাঃ) এর ঘটনা বর্ণনা করেছেন, তবে মিম্বরে আরোহণের কথা উল্লেখ করেন নি। আলী (রহঃ) .... আমরা (রহঃ) থেকে অনুরূপ বর্ণনা করেছেন। জাফর ইবনু আওন (রহঃ) ইয়াহইয়া (রহঃ) এর মাধ্যমে আমরা (রহঃ) থেকে বর্ণনা করেন, তিনি বলেছেন, আমি আয়িশা (রাঃ) থেকে শুনেছি। *কিতাবতঃ দাসত্ব থেকে মুক্তিলাভের উদ্দেশ্যে মনিবের সঙ্গে কিস্তি হিসেবে মুক্তিপণ পরিশোধের চুক্তি।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩১২।',
        name: ' মসজিদে ঋণ পরিশোধের তাগাদা দেওয়া ও চাপ সৃষ্টি করা ',
        hadisNumberList: [
          HadisNumberModel(
            id: '  ৪৪৩। ',
            name:
                'আবদুল্লাহ ইবনু মুহাম্মদ (রহঃ) .... কা’ব (রাঃ) থেকে বর্ণিত, তিনি মসজিদের ভিতরে ইবনু আবূ হাদরাদ (রাঃ) এর কাছে তাঁর পাওনা ঋণের তাগাদা করলেন। দু’জনের মধ্যে এ নিয়ে বেশ উচ্চস্বরে কথাবার্তা হল। এমনকি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর ঘর থেকেই তাদের কথার আওয়াজ শুনলেন এবং তিন পর্দা সরিয়ে তাদের কাছে বেরিয়ে গেলেন। আর ডাক দিয়ে বললেনঃ হে কা’ব! কা’ব (রাঃ) উত্তর দিলেন, লাব্বাইক ইয়া রাসুলাল্লাহ! রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তোমর পাওনা ঋণ থেকে এতটুকু ছেড়ে দাও। আর হাতে ইশারা করে বোঝালেন, অর্থাৎ অর্ধেক পরিমাণ। তখন কা’ব (রাঃ) বললেনঃ আমি তাই করলাম ইয়া রাসুলাল্লাহ! তখন তিনি ইবনু আবূ হাদরাদকে বললেনঃ উঠ আর বাকীটা দিয়ে দাও।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩১৩। ',
        name: 'মসজিদে ঝাড়ু দেয়া এবং ন্যাকড়া, আবর্জনা ও কাঠ খড়ি কুড়ানো ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৪৪৪।  ',
            name:
                'সুলায়মান ইবনু হারব (রহঃ) .... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, একজন কালো বর্ণের পুরুষ অথবা বলেছেন কালো বর্ণের মহিলা মসজিদ ঝাড়ু দিত। সে ইন্তেকাল করল। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর সম্পর্কে জিজ্ঞাসা করলেন। সাহাবীগণ বললেন, সে ইন্তেকাল করেছে। তিনি বললেনঃ তোমরা আমাকে খবর দিলে না কেন? আমাকে তার কবরটা দেখিয়ে দাও। তারপর তিনি তার কবরের কাছে গেলেন এবং তার জানাযার সালাত (নামায/নামাজ) আদায় করলেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩১৪।',
        name: ' মসজিদে মদের ব্যবসা হারাম ঘোষণা করা ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৪৪৫। ',
            name:
                ' আবদান (রহঃ) .... আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ মদ সম্পর্কীয় সূরা বাকারার আয়াতসমূহ নাযিল হলে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মসজিদে গিয়ে সে সব আয়াত সাহাবীগণকে পাঠ করে শোনালেন। তারপর তিনি মদের ব্যবসা হারাম ঘোষণা করলেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩১৫। ',
        name: ' মসজিদের জন্য খাদিম।',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'وَقَالَ ابْنُ عَبَّاسٍ: (نَذَرْتُ لَكَ مَا فِي بَطْنِي مُحَرَّرًا) لِلْمَسْجِدِ يَخْدُمُهُ ইবনে আব্বাস (রাঃ) (এ আয়াত) ‘আমার গর্ভে যা আছে তা একান্ত আপনার জন্য উৎসর্গ করলাম’ (৩ : ৩৫)। এর ব্যাখ্যায় বলেনঃ মসজিদের খিদমতের জন্য উৎসর্গ করলাম। ৪৪৬। আহমদ ইবনু ওয়াফিদ (রহঃ) ..... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, একজন পুরুষ অথবা বলেছেন একজন মহিলা মসজিদ ঝাড়ু দিতেন। [রাবী সাবিত (রহঃ) বলেন] আমার মনে হয় তিনি বলেছেন একজন মহিলা। তারপর তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর হদীস বর্ণনা করে বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার কবরে জানাযার সালাত (নামায/নামাজ) আদায় করেছেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩১৬।',
        name: '  কয়েদী অথবা ঋণগ্রস্ত ব্যক্তিকে মসজিদে বেঁধে রাখা',
        hadisNumberList: [
          HadisNumberModel(
            id: '৪৪৭।  ',
            name:
                'ইসহাক ইবনু ইবরাহীম (রহঃ) ..... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ গত রাতে একটা অবাধ্য জ্বীন হঠাৎ করে আমার সামনে প্রকাশ পেল। রাবী বলেন, অথবা তিনি অনুরূপ কোন কথা বলেছেন, যেন সে আমার সালাতে বাধা সৃষ্টি করে। কিন্তু আল্লাহ আমাকে তার উপর ক্ষমতা দিলেন। আমি ইচ্ছা করেছিলাম যে, তাকে মসজিদের খুঁটির সাথে বেঁধে রাখি, যাতে ভোরবেলা তোমরা সবাই তাকে দেখতে পাও। কিন্তু তখন আমার ভাই সুলায়মান (আলাইহিস সালাম) এর উক্তি আমার স্মরণ হল, “হে রব! আমাকে দান কর এমন রাজত্ব যার অধিকারী আমার পরে কেউ না হয়।” (৩৮ : ৩৫) (বর্ণনাকারী) রাওহ (রহঃ) বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সেই শয়তানটিকে অপমানিত অবস্থায় তাড়িয়ে দিলেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩১৭।',
        name: '  ইসলাম গ্রহণের সময় গোসল করা এবং এবং কয়েদীকে মসজিদে বাঁধা।',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'وَكَانَ شُرَيْحٌ يَأْمُرُ الْغَرِيمَ أَنْ يُحْبَسَ إِلَى سَارِيَةِ الْمَسْجِدِ কাযী শুরাইহ (রহঃ) দেনাদার ব্যক্তিকে মসজিদের খুঁটির সাথে বেঁধে রাখার নির্দেশ দিতেন। ৪৪৮। আবদুল্লাহ ইবনু ইউসুফ (রহঃ) .... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কয়েকজন অশ্বারোহী মুজাহিদকে নজদের দিকে পাঠালেন। তারা বানূ হানীফা গোত্রের সুমামা ইবনু উসালা নামক এক ব্যাক্তিকে নিয়ে এসে তাকে মসজিদের খুঁটির সাথে বেঁধে রাখলেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার কাছে গেলেন এবং বললেনঃ সুমামাকে ছেড়ে দাও। (ছাড়া পেয়ে) তিনি মসজিদে নববীর নিকটে এক খেজুর বাগানে গিয়ে সেখানে গোসল করলেন, এরপর মসজিদে প্রবেশ করে বললেনঃ (أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ) “আমি সাক্ষ্য দিচ্ছি যে, আল্লাহ ব্যতীত কোন ইলাহ নেই এবং মুহাম্মদ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) আল্লাহর রাসূল।” ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩১৮।  ',
        name: ' রোগী ও অন্যদের জন্য মসজিদে তাঁবু স্থাপন',
        hadisNumberList: [
          HadisNumberModel(
            id: '৪৪৯। ',
            name:
                ' যাকারিয়্যা ইবনু ইয়াহইয়া (রহঃ) .... আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ খন্দকের যুদ্ধে সা’দ (রাঃ) এর হাতের শিরা যখম হয়েছিল। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মসজিদে (তাঁর জন্য) একটা তাঁবু স্থাপন করলেন। যাতে কাছে থেকে তাঁর দেখাশোনা করতে পারেন। মসজিদে বানূ গিফারেরও একটা তাঁবু ছিল। সা’দ (রাঃ) এর প্রচুর রক্ত তাদের দিকে প্রবাহিত হওয়ায় তারা ভীত-সন্ত্রস্ত হয়ে জিজ্ঞাসা করলেনঃ হে তাঁবুর লোকেরা! তোমাদের তাঁবু থেকে আমাদের দিকে কি প্রবাহিত হচ্ছে? তখন দেখা গেল যে, সা’দের যখম থেকে প্রচুর রক্ত প্রবাহিত হচ্ছে। অবশেষে এতেই তিনি ইন্তেকাল করলেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩১৯।  ',
        name: ' প্রয়োজনে উট নিয়ে মসজিদে প্রবেশ করা।',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                ' وَقَالَ ابْنُ عَبَّاسٍ طَافَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى بَعِيرٍ ইবনে আব্বাস (রাঃ) বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিজের উটে সওয়ার হয়ে তাওয়াফ করেছেন। ৪৫০। আবদুল্লাহ ইবনু ইউসুফ (রহঃ) .... উম্মে সালমা (রাঃ) থেকে বর্ণিত, তিনি বলেন: আমি রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে (বিদায় হাজ্জে (হজ্জ) আমার অসুস্থতার কথা জানালাম। তিনি বললেনঃ সওয়ার হয়ে লোকদের হতে বাইরে থেকে তওয়াফ করে নাও। তখন আমি (সেভাবে) তাওয়াফ করলাম। আর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বায়তুল্লাহর পাশে সালাত (নামায/নামাজ) আদায় করছিলেন, তিনি “সূরা ওয়াত-তুরি ওয়া কিতাবিম-মাসতূর” তিলাওয়াত করছিলেন।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩২০। ',
        name: '  পরিচ্ছেদ নাই।',
        hadisNumberList: [
          HadisNumberModel(
            id: '৪৫১।  ',
            name:
                ' মুহাম্মদ ইবনুল মুসান্না (রহঃ) .... আনাস (রাঃ) থেকে বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর দু’জন সাহাবী নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট থেকে অন্ধকার রাতে বের হলেন। তাঁদের একজন আব্বাদ ইবনু বিশর (রাঃ) আর সাহাবী দ্বিতীয় জন সম্পর্কে আমার ধারণা যে, তিনি ছিলেন উসাইদ ইবনু হুযাইর (রাঃ), আর উভয়ের সাথে চেরাগ সদৃশ কিছু ছিল, যা তাঁদের সামনের দিকটাকে আলোকিত করছিল। তাঁরা উভয়ে যখন পৃথক হয়ে গেলেন, তখন প্রত্যেকের সাথে একটা করে রয়ে গেল। অবশেষে এভাবে তাঁরা নিজেদের বাড়ীতে পৌছলেন।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩২১। ',
        name: ' মসজিদে ছোট দরজা ও পথ বানানো ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৪৫২।  ',
            name:
                'মুহাম্মদ ইবনু সিনান (রহঃ) .... আবূ সা’ঈদ খুদরী (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক ভাষণে বললেনঃ আল্লাহ তা\'আলা তাঁর বান্দাকে দুনিয়া ও আল্লাহর কাছে যা আছে-এ দুয়ের মধ্যে একটি গ্রহণের ইখতিয়ার দিলেন। তিনি আল্লাহর কাছে যা আছে, তা গ্রহণ করলেন। তখন আবূ বকর (রাঃ) কাঁদতে লাগলেন। আমি মনে মনে ভাবলাম, এই বৃদ্ধ কাঁদছেন কেন? আল্লাহ তাঁর এক বান্দাকে দুনিয়া ও আল্লাহর কাছে রয়েছে, এ দুয়ের একটা গ্রহণ করার এখতিয়ার দিলে তিনি আল্লাহর কাছে যা আছে তা গ্রহণ করেছেন (এতে কাঁদার কি আছে?)। মূলত রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-ই ছিলেন সেই বান্দা। আবূ বকর (রাঃ) ছিলেন আমাদের মাঝে সর্বাধিক জ্ঞানী। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ হে আবূ বকর, তুমি কাঁদবে না। নিজের সাহচর্য ও সম্পদ দিয়ে আমাকে যিনি সবচাইতে বেশী ইহসান করেছেন তিনি আবূ বকর। আমার কোন উম্মতকে যদি আমি খলীল (অন্তরঙ্গ বন্ধু) রূপে গ্রহণ করতাম, তবে তিনি হতেন আবূ বকর। কিন্তু তাঁর সাথে রয়েছে ইসলামের ভ্রাতৃত্ব ও সৌহার্দ্য। আবূ বকরের দরজা ব্যতীত মসজিদের কোন দরজাই রাখা হবে না, সবই বন্ধ করা হবে। ',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ৪৫৩। ',
            name:
                'আবদুল্লাহ ইবনু মুহাম্মদ জু’ফী (রহঃ) ..... ইবনু আব্বাস (রাঃ) থেকে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অন্তিম রোগের সময় এক টুকরা কাপড় মাথায় পেঁচিয়ে বাইরে এসে মিম্বরে বসলেন। আল্লাহর প্রশংসা ও সানা সিফাত বর্ণনার পর বললেনঃ জান ও মাল দিয়ে আবূ বকর ইবনু আবূ কুহাফার চাইতে অধিক কেউ আমার প্রতি ইহসান করেনি। আমি কাউকেও অন্তরঙ্গ বন্ধুরূপে গ্রহণ করলে অবশ্যই আবূ বকরকে গ্রহণ করতাম। তবে ইসলামের বন্ধুত্বই উত্তম। আবূ বকরের দরজা ব্যতীত এই মসজিদের সকল দরজা বন্ধ করে দাও। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩২২।  ',
        name: ' বায়তুল্লাহ ও অন্যান্য মসজিদের দরজা রাখা ও তালা লাগানো।',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                ' قَالَ أَبُو عَبْدِ اللَّهِ وَقَالَ لِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ حَدَّثَنَا سُفْيَانُ عَنِ ابْنِ جُرَيْجٍ قَالَ: قَالَ لِي ابْنُ أَبِي مُلَيْكَةَ يَا عَبْدَ الْمَلِكِ، لَوْ رَأَيْتَ مَسَاجِدَ ابْنِ عَبَّاسٍ وَأَبْوَابَهَا আবূ আবদুল্লাহ [ইমাম বুখারী (রহঃ)] বলেনঃ আমাকে আবদুল্লাহ ইবনে মুহাম্মদ বলেছেন যে, আমাকে সুফিয়ান (রহঃ) ইবনে জুরাইজ (রহঃ) থেকে বর্ণনা করেছেন, তিনি বলেনঃ আমাকে ইবনে আবী মুলায়কা (রহঃ) বলেছেন, হে আবদুল মালিক! তুমি ইবনে আব্বাস (রাঃ) এর মসজিদ ও তাঁর দরজাগুলো যদি দেখতে। ৪৫৪। আবূ নু’মান ও কুতায়বা (রহঃ) ..... ইবনু উমর (রাঃ) থেকে বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন মক্কায় আসেন তখন উসমান ইবনু তালহা (রাঃ)-কে ডাকলেন। তিনি দরজা খুলে দিলে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম, বিলাল, উসামা ইবনু যায়েদ ও উসমান ইবনু তালহা (রাঃ) ভিতরে গেলেন। তারপর দরজা বন্ধ করে দেয়া হল। তিনি সেখানে কিছুক্ষণ থাকলেন। তারপর সবাই বের হলেন। ইবনু উমর (রাঃ) বলেনঃ আমি তাড়াতাড়ি গিয়ে বিলাল (রাঃ) কে (সালাতের কথা) জিজ্ঞাসা করলাম। তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ভিতরে সালাত (নামায/নামাজ) আদায় করেছেন। আমি জিজ্ঞাসা করলামঃ কোন স্থানে? তিনি বলেনঃ দুই স্তম্ভের মাঝামাঝি। ইবনু উমর (রাঃ) বলেনঃ কয় রাকা’আত আদায় করেছেন তা জিজ্ঞাসা করতে আমি ভুলে গিয়েছিলাম।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩২৩। ',
        name: '  মসজিদে মুশরিকের প্রবেশ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৪৫৫।  ',
            name:
                'কুতায়বা (রহঃ) ..... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কতিপয় অশ্বারোহী সৈন্য নজদ অভিমুখে পাঠালেন। তারা বানূ হানীফা গোত্রের সুমামা ইবনু উসাল নামক এক ব্যাক্তিকে নিয়ে এলেন। তারপর তাকে মসজিদের একটি খুঁটির সাথে বেঁধে রাখলেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩২৪। ',
        name: '  মসজিদে আওয়াজ উঁচু করা',
        hadisNumberList: [
          HadisNumberModel(
            id: '৪৫৬।  ',
            name:
                'আলী ইবনু আবদুল্লাহ (রহঃ) ..... সায়িব ইবনু ইয়াযীদ (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি মসজিদে নববীতে দাঁড়িয়েছিলাম। এমন সময় একজন লোক আমার দিকে একটা কাঁকর নিক্ষেপ করলো। আমি তাঁর দিকে তাকিয়ে দেখলাম যে, তিনি উমর ইবনুল খাত্তাব (রাঃ)। তিনি বললেনঃ যাও, এ দু’জনকে আমার কাছে নিয়ে এস। আমি তাদের নিয়ে তাঁর কাছে এলাম। তিনি বললেনঃ তোমরা কারা? অথবা তিনি বললেনঃ তোমরা কোন স্থানের লোক? তারা বললোঃ আমরা তায়েফের অধিবাসী। তিনি বললেনঃ তোমরা যদি মদিনার লোক হতে, তবে আমি অবশ্যই তোমাদের কঠোর শাস্তি দিতাম। তোমরা দু’জনে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর মসজিদে উচ্চস্বরে কথা বলছো! ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩২৪। ',
        name: '  মসজিদে আওয়াজ উঁচু করা',
        hadisNumberList: [
          HadisNumberModel(
            id: '৪৫৭। ',
            name:
                ' আহমদ ইবনু সালিহ (রহঃ) ..... কা’ব ইবনু মালিক (রাঃ) থেকে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর যুগে তিনি ইবনু আবূ হাদরাদের কাছে তাঁর প্রাপ্য সম্পর্কে মসজিদে নববীতে তাগাদা করেন। এতে উভয়ের আওয়াজ উঁচু হয়ে গেল। এমনকি সে আওয়াজ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর ঘর থেকে শুনতে পেলেন। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর ঘরের পর্দা সরিয়ে তাদের দিকে বের হয়ে এলেন এবং কা’ব ইবনু মালিককে ডেকে বললেনঃ হে কা’ব! উত্তরে কা’ব (রাঃ) বললেনঃ লাব্বায়কা ইয়া রাসুলাল্লাহ! তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হাতে ইশারা করলেন যে, তোমার প্রাপ্য থেকে অর্ধেক ছেড়ে দাও। কা’ব (রাঃ) বললেন ইয়া রাসুলাল্লাহ! আমি তাই করলাম। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইবনু আবূ হাদরাদ (রাঃ)-কে বললেনঃ উঠ এবার (বাকী) ঋণ পরিশোধ কর। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩২৫। ',
        name: '  মসজিদে হাল্কা বাঁধা ও বসা',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ৪৫৮।',
            name:
                ' মুসাদ্দাদ (রহঃ) .... ইবনু উমর (রাঃ) থেকে বর্ণিত, তিনি বলেন, একজন সাহাবী নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে প্রশ্ন করলেন, তখন তিনি মিম্বরে ছিলেন; আপনি রাতের সালাত (নামায/নামাজ) কিভাবে আদায় করতে বলেন? তিনি বললেনঃ দু-দু’রাকা’আত করে আদায় করবে। যখন তোমাদের কারো ভোর হয়ে যাওয়ার আশংকা হয় তখন সে আরো এক রাকা’আত আদায় করে নিবে। আর এইটি তার পূর্ববর্তী সালাতকে বিতর করে দেবে। [নাফি (রহঃ) বলেন] ইবনু উমর (রাঃ) বলতেনঃ তোমরা বিতরকে রাতের শেষ সালাত হিসাবে আদায় কর। কেননা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এই নির্দেশ দিয়েছেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩২৫। ',
        name: ' মসজিদে হাল্কা বাঁধা ও বসা',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ৪৫৯। ',
            name:
                'আবূ নু’মান (রহঃ) ... ইবনু উমর (রাঃ) থেকে বর্ণিত, এক সাহাবী নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এমন সময় আসলেন যখন তিনি খুতবা দিচ্ছিলেন। তিনি জিজ্ঞাসা করলেনঃ রাতের সালাত (নামায/নামাজ) কিভাবে আদায় করতে হয়? নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ দু’রাকা’আত দু’রাকা’আত করে আদায় করবে। আর যখন ভোর হওয়ার আশংকা করবে, তখন আরো এক রাকা’আত আদায় করে নিবে। সে সালাত তোমার আগের সালাতকে বিতর করে দিবে। ওয়ালীদ ইবনু কাসীর (রহঃ) বলেনঃ উবায়দুল্লাহ ইবনু আবদুল্লাহ (রহঃ) আমার কাছে বলেছেন যে, ইবনু উমর (রাঃ) তাঁদের বলেছেনঃ এক সাহাবী নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে সম্বোধন করে বললেন, তখন তিনি মসজিদে ছিলেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩২৫। ',
        name: ' মসজিদে হাল্কা বাঁধা ও বসা ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ৪৬০। ',
            name:
                'আবদুল্লাহ ইবনু ইউসুফ (রহঃ) ..... আবূ ওয়াকিদ লায়সী (রাঃ) থেকে বর্ণিত, একবার রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মসজিদে ছিলেন। এমন সময় তিনজন লোক এলেন। তাঁদের দু’জন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এগিয়ে এলেন আর একজন চলে গেলেন। এ দু’জনের একজন হালাকায় খালি স্থান পেয়ে সেখানে বসে পড়লেন। দ্বিতীয় ব্যাক্তি মজলিসের পেছনে বসলেন। আর তৃতীয় ব্যাক্তি পিঠটান দিয়ে সরে পড়লেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কথাবার্তা থেকে অবসর হয়ে বললেনঃ আমি কি তোমাদের ঐ তিন ব্যাক্তি সম্পর্কে খবর দেব? এক ব্যাক্তি তো আল্লাহর দিকে অগ্রসর হল। আল্লাহও তাকে আশ্রয় দিলেন। দ্বিতীয় ব্যাক্তি লজ্জা করলো, আর আল্লাহ তা’আলাও তাকে (বঞ্চিত করতে) লজ্জাবোধ করলেন। তৃতীয় ব্যাক্তি মুখ ফিরিয়ে নিলো, কাজেই আল্লাহও তাঁর থেকে ফিরে থাকলেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩২৬।',
        name: ' মসজিদে চিত হয়ে শোয়া ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৪৬১।  ',
            name:
                'আবদুল্লাহ ইবনু মাসলামা (রহঃ) ... আব্বাদ ইবনু তামীম (রহঃ) তাঁর চাচা থেকে বর্ণনা করেন, তিনি (তাঁর চাচা) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে মসজিদে চিত হয়ে এক পায়ের উপর আরেক পা রেখে শুয়ে থাকতে দেখেছেন। ইবনু শিহাব (রহঃ) সা’ঈদ ইবনু মূসায়্যাব (রহঃ) থেকে বর্ণনা করেন যে, উমর ও উসমান (রাঃ) এরূপ করতেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩২৭।',
        name: ' লোকের অসুবিধা না হলে রাস্তায় মসজিদ বানানো বৈধ। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                ' وَبِهِ قَالَ الْحَسَنُ وَأَيُّوبُ وَمَالِكٌ হাসান বসরী, আইয়্যুব এবং মালিক (রহঃ) এরূপ বলেছেন। ৪৬২। ইয়াহইয়া ইবনু বুকায়র (রহঃ) .... নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহধর্মিণী আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেছেনঃ আমার জ্ঞানমতে আমি আমার পিতা মাতাকে সব সময় দ্বীনের অনুসরণ করতে দেখেছি। আর আমাদের এমন কোন দিন যায়নি যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সে দিনের উভয় প্রান্তে সকাল-সন্ধ্যায় আমাদের কাছে আসেন নি। তারপর আবূ বকর (রাঃ) এর মসজিদ নির্মাণের প্রয়োজন দেখা দিল। তিনি তাঁর ঘরের আঙ্গিনায় একটি মসজিদ তৈরী করলেন। তিনি এতে সালাত (নামায/নামাজ) আদায় করতেন ও কুরান তিলাওয়াত করতেন। মুশরিকদের মহিলা ও ছেলেমেয়েরা সেখানে দাঁড়াত এবং তারা বিস্মিত হয়ে তাঁর দিকে তাকিয়ে থাকতো। আবূ বকর (রাঃ) ছিলেন একজন অধিক রোদনকারী ব্যাক্তি। তিনি কুরআন পড়া শুরু করলে অশ্রু সংবরণ করতে পারতেন না। তাঁর এ অবস্থা নেতৃস্থানীয় মুশরিক কুরাইশদের শঙ্কিত করে তুলল।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩২৮। ',
        name: '  বাজারের মসজিদে সালাত আদায়।',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'وَصَلَّى ابْنُ عَوْنٍ فِي مَسْجِدٍ فِي دَارٍ يُغْلَقُ عَلَيْهِمُ الْبَابُ ইবনে আওন (রহঃ) ঘরের মসজিদে সালাত আদায় করতেন যার দরজা বন্ধ করা হতো। ৪৬৩। মূসা’দ্দাদ (রহঃ) ... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ জামা’আতের সাথে সালাত (নামায/নামাজ) আদায় করলে ঘর বা বাইরে সালাত আদায় করার চাইতে পঁচিশগুণ সওয়াব বৃদ্ধি পায়। কেননা, তোমাদের কেউ যদি ভাল করে উযূ (ওজু/অজু/অযু) করে কেবল সালাতের উদ্দেশ্যেই মসজিদে আসে, সে মসজিদে প্রবেশ করা পর্যন্ত যতবার কদম রাখে তার প্রতিটির বিনিময়ে আল্লাহ তা’আলা তার মর্যাদা ক্রমান্বয়ে উন্নীত করবেন এবং তার একটি করে গুনাহ মাফ করবেন। আর মসজিদে প্রবেশ করে যতক্ষণ পর্যন্ত সালাতের অপেক্ষায় থাকে ততক্ষণ তাকে সালাতই গণ্য করা হয়। আর সালাতের শেষে সে যতক্ষণ ঐ স্থানে থাকে ততক্ষণ ফিরিশতাগণ তার জন্য এ বলে দুয়া করেন: ইয়া আল্লাহ! তাকে ক্ষমা করুন, ইয়া আল্লাহ! তাকে রহম করুন, যতক্ষণ সে কাউকে কষ্ট না দেয়, সেখানে উযূ ভঙ্গের কাজ না করে। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩২৯।',
        name:
            '  মসজিদ ও অন্যান্য স্থানে এক হাতের আঙুল অন্য হাতের আঙুল প্রবেশ করানো',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                ' ৪৬৪। হামিদ ইবনু উমর (রহঃ) .... ইবনু উমর বা ইবনু আমর (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক হাতের আঙুল অন্য এক হাতের আঙুলে প্রবেশ করান। আসিম ইবনু আলী (রহঃ) থাকে বর্ণিত, আসিম ইবনু মুহাম্মদ (রহঃ) বলেনঃ আমি এ হদীস আমার পিতা থেকে শুনেছিলাম, কিন্তু আমি তা স্মরণ রাখতে পারিনি। এরপর এ হাদীসটি আমাকে ঠিকভাবে বর্ণনা করেন ওয়াকিদ (রহঃ) তাঁর পিতা থেকে। তিনি বলেনঃ আমার পিতাকে বলতে শুনেছি যে, আবদুল্লাহ ইবনু আমর (রাঃ) বলেছেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেনঃ হে আবদুল্লাহ ইবনু আমর! যখন তুমি নিকৃষ্ট লোকদের সাথে অবস্থান করবে, তখন তোমার অবস্থা কি হবে? হুমায়দী (রহঃ) তাঁর আল জাম’উ বাইনাস সাহিহাইন গ্রন্তে ইবনে উমর (রাঃ) থেকে বর্ণিত হদীসে এরূপ বর্ণনা করেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক হাতের আঙুল আর এক হাতের আঙুলে প্রবেশ করান এবং বলেনঃ হে আবদুল্লাহ! যখন তুমি নিকৃষ্ট লোকদের মধ্যে অবস্থান করবে তখন তোমার অবস্থা কি হবে? তাদের অঙ্গীকার পূরণ করা হবে না ও আমানতে খেয়ানত করা হবে এবং তাদের মতানৈক্য দেখা দিবে। আর তার এরূপ হয়ে যাবে এবং তিনি এক হাতের আঙুল আরেক হাতে প্রবেশ করান। আবদুল্লাহ (রাঃ) বললেনঃ ইয়া রাসূলাল্লাহ! তখন আমি কি করব? তিনি বললেন, যা তুমি শরী’আত সম্মত বলে জান তা গ্রহণ কর, আর যা শরী’আত বিরোধী বলে মনে করবে তা বর্জন করবে। আর তুমি নিজকে নিজে বাঁচাবে, আর সাধারণ লোককে তাদের অবস্থার উপর ছেড়ে দিবে। (উমাদাতুল ক্বারী, ৪খ,পৃ-২২৬)',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩২৯।  ',
        name:
            ' মসজিদ ও অন্যান্য স্থানে এক হাতের আঙুল অন্য হাতের আঙুল প্রবেশ করানো',
        hadisNumberList: [
          HadisNumberModel(
            id: '৪৬৫ ',
            name:
                '। খাল্লাদ ইবনু ইয়াহইয়া (রহঃ) .... আবূ মূসা (রাঃ) থেকে বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ একজন মু’মিন আরেকজন মু’মিনের জন্য ইমারততুল্য, যার এক অংশ অপর অংশকে শক্তিশালী করে থাকে। এ বলে তিনি এক হাতের আঙুল অপর হাতের আঙ্গুলের মধ্যে প্রবেশ করালেন। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '৪৬৬। ',
            name:
                ' ইসহাক (রহঃ) .... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একবার আমাদের বিকালে সালাতে ইমামতি করলেন। ইবনু সীরীন (রহঃ) বলেনঃ তিনি আমাদের নিয়ে দু’রাকা’আত সালাত (নামায/নামাজ) আদায় করে সালাম ফিরালেন। তারপর মসজিদে রাখা এক টুকরা কাঠের উপর ভর দিয়ে দাঁড়ালেন। তাঁকে রাগান্বিত মনে হচ্ছিল। তিনি তাঁর ডান হাত বাঁ হাতের উপর রেখে এক হাতের আঙুল অপর হাতের আঙুলের মধ্যে প্রবেশ করালেন। আর তাঁর ডান গাল বাম হাতের পিঠের উপর রাখলেন। যাঁদের তাড়া ছিল তাঁরা মসজিদের দরজা দিয়ে বাইরে চলে গেলেন। সাহাবীগণ বললেনঃ সালাত কি সংক্ষিপ্ত হয়ে গেছে? উপস্থিত লোকজনের মধ্যে আবূ বকর (রাঃ) এবং উমর (রাঃ)-ও ছিলেন। কিন্তু তাঁরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে কথা বলতে ভয় পেলেন। আর লোকজনের মধ্যে লম্বা হাত বিশিষ্ট এক ব্যাক্তি ছিলেন, যাকে “যুল-ইয়াদাইন” বলা হতো, তিনি বললেনঃ ইয়া রাসুলাল্লাহ! আপনি কি ভুলে গেছেন, নাকি সালাত সংক্ষিপ্ত করা হয়েছে? তিনি বললেনঃ আমি ভুলিনি এবং সালাত সংক্ষেপও করা হয়নি। এরপর (অন্যদের) জিজ্ঞাসা করলেনঃ যুল-ইয়াদাইনের কথা কি ঠিক? তাঁরা বললেন, হ্যাঁ। তারপর তিনি এগিয়ে এলেন এবং সালাতের বাদপড়া অংশটুকু আদায় করলেন। তারপর সালাম ফিরালেন ও তাকবীর বললেন এবং স্বাভাবিকভাবে সিজদার মতো বা একটু দীর্ঘ সিজদা করলেন। তারপর তাকবীর বলে মাথা উঠালেন। পরে আবার তাকবীর বললেন এবং স্বাভাবিকভাবে সিজদার মতো বা একটু দীর্ঘ সিজদা করলেন। তারপর তাকবীর বলে মাথা উঠালেন। লোকেরা প্রায়ই ইবনু সীরীন (রহঃ)-কে জিজ্ঞাসা করতো “পরে কি তিনি সালাম ফিরিয়েছিলেন?” তখন ইবনু সীরীন (রহঃ) বলতেনঃ আমার কাছে বর্ণনা করা হয়েছে যে, ইমরান ইবনু হুসাইন (রাঃ) বলেছেনঃ তারপর তিনি সালাম ফিরিয়েছিলেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩৩০।  ',
        name:
            'মদীনার রাস্তার মসজিদসমূহ এবং যে সকল স্থানে নবী (ﷺ) সালাত আদায় করেছিলেন ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ৪৬৭। ',
            name:
                ' মুহাম্মদ ইবনু আবূ বকর মুকাদ্দামী (রহঃ) ..... মূসা ইবনু উকবা (রহঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি সালিম ইবনু আবদুল্লাহ (রাঃ)-কে রাস্তার বিশেষ স্থান অনুসন্ধান করে সে সব স্থানে সালাত (নামায/নামাজ) আদায় করতে দেখেছি এবং তিনি বর্ণনা করতেন যে, তাঁর পিতাও এসব স্থানে সালাত আদায় করতেন। আর তিনিও রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে এসব স্থানে সালাত আদায় করতে দেখেছেন। মূসা ইবনু উকবা (রহঃ) বলেনঃ নাফি (রহঃ)-ও আমার কাছে ইবনু উমর (রাঃ) থেকে বর্ণনা করেছেন যে, তিনি সেসব স্থানে সালাত আদায় করতেন। তারপর আমি সালিম (রহঃ) কে জিজ্ঞাসা করি। আমার জানামতে তিনিও সেসব স্থানে সালাত আদায়ের ব্যাপারে নাফী (রহঃ) এর সাথে একমত পোষণ করেছেন; তবে ‘শারাফুর-রাওহা’ নামক স্থানের মসজিদের ব্যাপারে তাঁরা ভিন্ন মত প্রকাশ করেছেন।',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ',
            name:
                ' ৪৬৮। ইবরাহীম ইবনু মুনযির আল-হিযামী (রহঃ) .... আবদুল্লাহ ইবনু উমর (রাঃ) থেকে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উমরা ও হজ্জের জন্য রওয়ানা হলে ‘যুল-হুলায়ফায়’ অবতরণ করতেন, বাবলা গাছের নীচে যুল-হুলায়ফার মসজিদের স্থানে। আর যখন কোন যুদ্ধ থেকে অথবা হাজ্জ (হজ্জ) বা উমরা করে সেই পথে ফিরতেন, তখন উপত্যকার মাঝখানে অবতরণ করতেন। যখন উপত্যকার মাঝখান থেকে উপরের দিকে আসতেন, তখন উপত্যকার তীরে অবস্থিত পূর্ব নিম্নভূমিতে উট বসাতেন। সেখানে তিনি শেষ রাত থেকে ভোর পর্যন্ত বিশ্রাম করতেন। এ স্থানটি পাথরের উপর নির্মিত মসজিদের কাছে নয় এবং যে মসজিদ টিলার উপর, তার নিকটেও নয়। এখানে ছিল একটি ঝিল, যার পাশে আবদুল্লাহ (রাঃ) সালাত (নামায/নামাজ) আদায় করতেন। এর ভিতরে কতগুলো বালির স্তূপ ছিল। আর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এখানেই সালাত আদায় করতেন। তারপর নিম্নভূমিতে পানির প্রবাহ হয়ে আবদুল্লাহ (রাঃ) যে স্থানে সালাত আদায় করতেন তা সমান করে দিয়েছে। আবদুল্লাহ ইবনু উমর (রাঃ) [নাফি (রহঃ) কে] বলেছেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম শারাফুর-রাওহা’র মসজিদের কাছে ছোট মসজিদের স্থানে সালাত আদায় করেছিলেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যেখানে সালাত আদায় করেছিলেন, আবদুল্লাহ (রাঃ) সে স্থানের পরিচয় দিতেন এই বলে যে, যখন তুমি মসজিদে সালাতে দাঁড়াবে তখন তা তোমার ডানদিকে। আর সেই মসজিদটি হল যখন তুমি (মদিনা থেকে) মক্কা যাবে তখন তা ডানদিকের রাস্তার এক পাশে থাকবে। সে স্থান ও বড় মসজিদের মাঝখানে ব্যবধান হল একটি ঢিল নিক্ষেপ পরিমাণ অথবা তার কাছাকাছি। আর ইবনু উমর (রাঃ) রাওহার শেষ মাথায় ‘ইরক’ (ছোট পাহাড়) এর কাছে সালাত আদায় করতেন। সেই ‘ইরক’ এর শেষ প্রান্ত হল রাস্তার পাশে মসজিদের কাছাকাছি মক্কা যাওয়ার পথে রাওহা ও মক্কার মধ্যবর্তী স্থানে অবস্থিত। এখনে একটি মসজিদ নির্মিত হয়েছে। আবদুল্লাহ ইবনু উমর (রাঃ) এই মসজিদে সালাত করতেন না, বরং সেটাকে তিনি বামদিকে ও পেছনে ফেলে অগ্রসর হয়ে ‘ইরক’ এর নিকটে সালাত (নামায/নামাজ) আদায় করতেন। আর আবদুল্লাহ (রাঃ) রাওহা থেকে বেরিয়ে ঐ স্থানে পৌছার আগে যোহরের সালাত আদায় করতেন না। সেখানে পৌঁছে যোহর আদায় করতেন। মক্কা থেকে আসার সময় এ পথে ভোরের এক ঘণ্টা আগে বা শেষ রাতে আসলে তথায় অবস্থান করে ফজরের সালাত আদায় করতেন। আবদুল্লাহ (রাঃ) আরো বর্ণনা করেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রুওয়ায়ছা\'র নিকটে রাস্তার ডানদিকে রাস্তা সংলগ্ন প্রশস্ত সমতল ভূমিতে একটা বিরাট গাছের নীচে অবস্থান করতেন। তারপর তিনি রুওয়ায়ছা\'র ডাকঘরের দু’মাইল দূরে টিলার পাশ দিয়ে রওয়ানা হতেন। বর্তমানে গাছটির উপরের অংশ ভেঙ্গে গিয়ে মাঝখানে ঝুঁকে গেছে। গাছের কাণ্ড এখনো দাঁড়িয়ে আছে। আর তার আশেপাশে অনেকগুলো বালির স্তূপ বিস্তৃত রয়েছে। আবদুল্লাহ ইবনু উমর (রাঃ) আরো বর্ণনা করেছেনঃ আরজ গ্রামের পরে পাহাড়ের দিকে যেতে যে উচ্চভূমি রয়েছে, তার পাশে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সালাত আদায় করেছেন। এই মসজিদের পাশে দু’তিনটি কবর আছে। এসব কবরে পাথরের বড় বড় খণ্ড পড়ে আছে। রাস্তার ডান পাশে গাছের নিকটেই তা অবস্থিত। দুপুরের পর সূর্য ঢলে পড়লে আবদুল্লাহ (রাঃ) ‘আরজ’ এর দিকে থেকে এসে গাছের মধ্য দিয়ে যেতেন এবং ঐ মসজিদে যোহরের সালাত আদায় করতেন। আবদুল্লাহ ইবনু উমর (রাঃ) আরো বর্ণনা করেছেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সে রাস্তার বাঁ দিকে বিরাট গাছগুলির কাছে অবতরণ করেন যা ‘হারশা’ পাহাড়ের নিকটবর্তী নিম্নভূমির দিকে চলে গেছে। সেই নিম্নভূমিটি ‘হারশা’-এর এক প্রান্তের সাথে মিলিত। এখানে থেকে সাধারণ সড়কের দূরত্ব প্রায় এক তীর নিক্ষেপের পরিমাণ। আবদুল্লাহ ইবনু উমর (রাঃ) সেই গাছগুলির মধ্যে একটির কাছে সালাত আদায় করতেন, যা ছিল রাস্তার নিকটবর্তী এবং সবচাইতে উঁচু। আবদুল্লাহ ইবনু উমর (রাঃ) আরো বর্ণনা করেছেন যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অবতরণ করতেন ‘মাররুয যাহরান’ উপত্যকার শেষ প্রান্তে নিম্নভূমিতে, যা মদিনার দিকে যেতে ছোট পাহাড়গুলোর নীচে অবস্থিত। তিনি সে নিম্নভূমির মাঝখানে অবতরণ করতেন। এটা মক্কা যাওয়ার পথে বাম পাশে থাকে। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর মনযিল ও রাস্তার মাঝে দূরত্ব এক পাথর নিক্ষেপ পরিমাণ। আবদুল্লাহ ইবনু উমর (রাঃ) আরো বলেছেন যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ‘যূ-তুওয়া’য় অবতরণ করতেন এবং এখানেই রাত যাপন করতেন আর মক্কায় আসার পথে এখানেই ফজরের সালাত আদায় করতেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সালাত আদায়ের সেই স্থানটা ছিল একটা বড় টিলার উপরে। যেখানে মসজিদ নির্মিত হয়েছে, সেখানে নয় বরং তার নীচে একটা বড় টিলার উপর। আবদুল্লাহ ইবনু উমর (রাঃ) তাদের কাছে আরো বর্ণনা করেছেন যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পাহাড়ের দু’টো প্রবেশপথ সামনে রাখতেন যা তার ও দীর্ঘ পাহাড়ের মাঝখানে কাবার দিকে রয়েছে। বর্তমানে সেখানে যে মসজিদ নির্মিত করা হয়েছে, সেটিকে তিনি [ইবনু উমর (রাঃ)] টিলার প্রান্তের মসজিদের বাম পাশে রাখতেন। আর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সালাতের স্থান ছিল এর নীচে কাল টিলার উপরে। টিলা থেকে প্রায় দশ হাত দূরে দু’টো পাহাড়ের প্রবেশপথ যা তোমার ও কাবার মাঝখানে রয়েছে—সামনে রেখে তুমি সালাত আদায় করবে। হাদিস নং - ৪৮৪, ৪৮৫, ৪৮৬, ৪৮৭, ৪৮৮,৪৮৯, ৪৯০, ৪৯১, ৪৯২',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩৩১। ',
        name: ' ইমামের সুতরাই মুকতাদীর জন্য যথেষ্ট ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৪৬৯। ',
            name:
                ' আবদুল্লাহ ইবনু ইউসুফ (রহঃ) ..... আবদুল্লাহ ইবনু আব্বাস (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি একটা মাদী গাধার উপর সওয়ার হয়ে এলাম, তখন আমি ছিলাম সাবালক হওয়ার নিকটবর্তী। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সামনে দেওয়াল ব্যতীত অন্য কিছুকে সুতরা বানিয়ে মিনায় লোকদের নিয়ে সালাত (নামায/নামাজ) আদায় করছিলেন। কাতারের কিছু অতিক্রম করে আমি সওয়ারী থেকে অবতরণ করলাম। গাধীটিকে চরাতে দিয়ে আমি কাতারের শামিল হয়ে গেলাম। আমাকে কেউই এ কাজে বাধা দেয়নি। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩৩১। ',
        name: ' ইমামের সুতরাই মুকতাদীর জন্য যথেষ্ট ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৪৭০।  ',
            name:
                'ইসহাক (রহঃ) .... ইবনু উমর (রাঃ) থেকে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঈদের দিন যখন বের হতেন তখন তাঁর সামনে ছোট নেযা (বল্লম) পুঁতে রাখতে নির্দেশ দিতেন। সেদিকে মুখ করে তিনি সালাত (নামায/নামাজ) আদায় করতেন। আর লোকজন তাঁর পেছনে দাঁড়াত। সফরেও তিনি তাই করতেন। এ থেকে শাসকগণও এটা অবলম্বন করেছেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩৩১।',
        name: '  ইমামের সুতরাই মুকতাদীর জন্য যথেষ্ট',
        hadisNumberList: [
          HadisNumberModel(
            id: '৪৭১। ',
            name:
                '  আবূল ওয়ালীদ (রহঃ) ..... আওন ইবনু জুহায়ফা (রহঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি আমার পিতাকে বলতে শুনেছি যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সাহাবীগণকে নিয়ে ‘বাতহা’ নামক স্থানে যোহরের দু’রাকা’আত ও আসরের দু’রাকা’আত সালাত (নামায/নামাজ) আদায় করেন। তখন তাঁর সামনে ছড়ি পুঁতে রাখা হয়েছিল। তাঁর সম্মুখ দিয়ে (সুতরার বাইরে) মহিলা ও গাধা চলাচল করতো।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩৩২। ',
        name: ' মুসল্লী ও সুতরার মাঝখানে কি পরিমাণ দূরত্ব থাকা উচিত ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ৪৭২।',
            name:
                ' আমর ইবনু যূরারা (রহঃ) ..... সাহল ইবনু সা’দ (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সালাতের স্থান ও দেওয়ালের মাঝখানে একটা বকরী চলার মত ব্যবধান ছিল। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩৩২। ',
        name: ' মুসল্লী ও সুতরার মাঝখানে কি পরিমাণ দূরত্ব থাকা উচিত ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৪৭৩। ',
            name:
                ' মাক্কী ইবনু ইবরাহীম (রহঃ) .... সালমা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ মসজিদের দেওয়াল ছিল মিম্বরের এত কাছে যে, মাঝখান দিয়ে একটা বকরীরও চলাচল কঠিন ছিল। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩৩৩।',
        name: '  বর্শা সামনে রেখে সালাত আদায়',
        hadisNumberList: [
          HadisNumberModel(
            id: '৪৭৪।  ',
            name:
                ' মুসাদ্দাদ (রহঃ) .... আবদুল্লাহ ইবনু উমর (রাঃ) থেকে বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সামনে বর্শা পুঁতে রাখা হতো, আর তিনি সেদিকে সালাত (নামায/নামাজ) আদায় করতেন।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩৩৪।',
        name: ' লৌহযুক্ত ছড়ি সামনে রেখে সালাত আদায় ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৪৭৫। ',
            name:
                ' আদম (রহঃ) ..... আওন ইবনু আবূ জুহায়ফা (রহঃ) থেকে বর্ণিত, তিনি বলেন, আমি আমার পিতার কাছ থেকে শুনেছি, তিনি বলেছেনঃ একদিন দুপুরে আমাদের সামনে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাশরীফ আনলেন। তাঁকে উযূর পানি দেওয়া হল। তিনি উযূ (ওজু/অজু/অযু) করলেন এবং আমাদের নিয়ে যোহর ও আসরের সালাত (নামায/নামাজ) আদায় করলেন। সালাতের সময় তাঁর সামনে ছিল লৌহযুক্ত ছড়ি, যার বাইরের দিক দিয়ে মহিলা ও গাধা চলাচল করতো। ',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ৪৭৬।',
            name:
                ' মুহাম্মদ ইবনু হাতিম ইবনু বযী (রহঃ) ..... আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন প্রাকৃতিক প্রয়োজনে বের হতেন, তখন আমি ও একজন বালক তাঁর পিছনে যেতাম। আর আমাদের সাথে থাকতো একটা লাঠি বা একটা ছড়ি অথবা একটা ছোট নেযা, আরো থাকতো একটা পানির পাত্র। তিনি তাঁর প্রয়োজনে সেরে নিলে আমরা তাঁকে ঐ পাত্রটি দিতাম।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩৩৫।  ',
        name: ' মক্কা ও অন্যান্য স্থানে সুতরা',
        hadisNumberList: [
          HadisNumberModel(
            id: '৪৭৭। ',
            name:
                '  সুলায়মান ইবনু হারব (রহঃ) .... আবূ জুহায়ফা (রাঃ) থেকে বর্ণিত, তিনি বলেন, একদিন দুপুরে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের সামনে তাশরীফ আনলেন। তিনি ‘বাতহা’ নামক স্থানে যোহর ও আসরের সালাত (নামায/নামাজ) দু’রাকা’আত করে আদায় করলেন। তখন তাঁর সামনে একটা লোহযুক্ত ছড়ি পুঁতে রাখা হয়েছিল। তিনি যখন উযূ (ওজু/অজু/অযু) করছিলেন, তখন সাহাবীগণ তাঁর উযূর পানি নিজেদের শরীরে (বরকতের জন্য) মাসেহ করতে লাগলো।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩৩৬।',
        name: '  স্তম্ভ (থাম) সামনে রেখে সালাত আদায়।',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                ' وَقَالَ عُمَرُ الْمُصَلُّونَ أَحَقُّ بِالسَّوَارِي مِنَ الْمُتَحَدِّثِينَ إِلَيْهَا. وَرَأَى عُمَرُ رَجُلاً يُصَلِّي بَيْنَ أُسْطُوَانَتَيْنِ فَأَدْنَاهُ إِلَى سَارِيَةٍ فَقَالَ صَلِّ إِلَيْهَا উমর (রাঃ) বলেনঃ বাক্যালাপে রত ব্যক্তিদের চাইতে মুসল্লীরাই স্তম্ভ সামনে রাখার বেশী অধিকারী। এক সময় ইবনে উমর (রাঃ) দেখলেন, এক ব্যক্তি দুটো স্তম্ভের মাঝখানে সালাত আদায় করছে। তখন তিনি তাকে একটি স্তম্ভের কাছে এনে বললেনঃ এটি সামনে রেখে সালাত আদায় কর ৪৭৮। মক্কী ইবনু ইবরাহীম (রহঃ) ..... ইয়াযিদ ইবনু আবূ উবায়দা (রহঃ) থেকে বর্ণিত, তিনি বলেন: আমি সালামা ইবনুল আকওয়া (রাঃ) এর কাছে আসতাম। তিনি সর্বদা মসজিদে নববীর সেই স্তম্ভের কাছে সালাত (নামায/নামাজ) আদায় করতেন যা ছিল মাসাহাফের নিকটবর্তী। আমি তাঁকে বললাম হে আবূ মুসলিম! আমি আপনাকে সর্বদা এই স্তম্ভ খুজে বের করে সামনে রেখে সালাত আদায় করতে দেখি (এর কারণ কি?) তিনি বললেনঃ আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে এটি খুঁজে বের করে এর কাছে সালাত আদায় করেত দেখেছি।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩৩৬। ',
        name: ' স্তম্ভ (থাম) সামনে রেখে সালাত আদায়। ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৪৭৯। ',
            name:
                '  কাবীসা (রহঃ) .... আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর বিশিষ্ট সাহাবীদের পেয়েছি। তারা মাগরিবের সময় দ্রুত স্তম্ভের কাছে যেতেন। শু’বা (রহঃ) আমর (রহঃ) সূত্রে আনাস (রাঃ) থেকে (এ হাদীসে) অতিরিক্ত বলেছেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বেরিয়ে আসা পর্যন্ত।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩৩৭। ',
        name: '  জামা’আত ব্যতীত স্তম্ভসমূহের মাঝখানে সালাত আদায় করা',
        hadisNumberList: [
          HadisNumberModel(
            id: '  ৪৮০।',
            name:
                ' মূসা ইবনু ইসমাঈল (রহঃ) .... ইবনু উমর (রাঃ) থেকে বর্ণিত, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বায়তুল্লাহ-এ প্রবেশ করেছিলেন। আর তাঁর সঙ্গে ছিলেন উসামা ইবনু যায়েদ (রাঃ), উসমান ইবনু তালহা (রাঃ) এবং বিলাল (রাঃ)। তিনি অনেকক্ষণ ভিতরে ছিলেন। তারপর বের হলেন। আর আমিই প্রথম ব্যাক্তি যে তাঁর পরে প্রবেশ করেছে। আমি বিলাল (রাঃ)-কে জিজ্ঞাসা করলামঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কোথায় সালাত (নামায/নামাজ) আদায় করেছেন? তিনি জবাব দিলেনঃ সামনের দুই স্তম্ভের মাঝে।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩৩৭। ',
        name: 'জামা’আত ব্যতীত স্তম্ভসমূহের মাঝখানে সালাত আদায় করা ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৪৮১। ',
            name:
                '  আবদুল্লাহ ইবনু ইউসুফ (রহঃ) .... আবদুল্লাহ ইবনু উমর (রাঃ) থেকে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আর উসামা ইবনু যায়েদ, বিলাল এবং উসমান ইবনু তালহা হাজাবী (রাঃ) কা’বায় প্রবেশ করলেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর প্রবেশের সাথে সাথে উসমান (রাঃ) কাবার দরজা বন্ধ করে দিলেন। তাঁরা কিছুক্ষণ ভিতরে ছিলেন। বিলাল (রাঃ) বের হলে আমি তাকে জিজ্ঞাসা করলামঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কি করলেন? তিনি জওয়াব দিলেনঃ একটা স্তম্ভ বামদিকে, আর স্তম্ভ ডানদিকে আর তিনটা স্তম্ভ পেছনে রাখলেন। আর তখন বায়তুল্লাহ ছিল ছয় স্তম্ভ বিশিষ্ট। তারপর তিনি সালাত (নামায/নামাজ) আদায় করলেন। [ইমাম বুখারী (রহঃ) বলেন] ইসমাঈল (রহঃ) আমার কাছে বর্ণনা করেন যে, ইমাম মালিক (রহঃ) বলেছেন যে, তাঁর (নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর) ডান পাশে দুটো স্তম্ভ ছিল।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩৩৮। ',
        name: '  পরিচ্ছেদ নাই।',
        hadisNumberList: [
          HadisNumberModel(
            id: '৪৮২। ',
            name:
                ' ইবরাহিম ইবনু মুনযির (রহঃ) .... নাফি (রহঃ) থেকে বর্ণিত, আবদুল্লাহ (রাঃ) যখন কা’বা গৃহে প্রবেশ করতেন তখন সামনের দিকে চলতে থাকতেন এবং দরজা পেছনে রাখতেন। এভাবে এগিয়ে গিয়ে যেখানে তাঁর ও দেয়ালের মাঝে প্রায় তিন হাত পরিমাণ ব্যবধান থাকতো, সেখানে তিনি সালাত (নামায/নামাজ) আদায় করতেন। তিনি সে স্থানেই সালাত আদায় করতে চাইতেন, যেখানে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সালাত আদায় করেছিলেন বলে বিলাল (রাঃ) তাঁকে খবর দিয়েছিলেন। তিনি বলেনঃ কা’বা ঘরের যে-কোন প্রান্তে ইচ্ছা, সালাত আদায় করায় আমাদের কারো কোন দোষ নেই। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩৩৯। ',
        name: '  উটনী, উট, গাছ ও হাওদা সামনে রেখে সালাত',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ৪৮৩।',
            name:
                ' মুহাম্মদ ইবনু আবূ বকর মুকাদ্দামী বসরী (রহঃ) .... ইবনু উমর (রাঃ) থেকে বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর উটনীকে সামনে রেখে সালাত (নামায/নামাজ) আদায় করতেন। (রাবী রাফি (রহঃ) বলেন) আমি (আবদুল্লাহ ইবনু উমর (রাঃ) কে) জিজ্ঞাসা করলামঃ যখন সওয়ারী নড়াচড়া করতো তখন (তিনি কি করতেন)? তিনি বলেনঃ তিনি তখন হাওদা নিয়ে সোজা করে নিজের সামনে রাখতেন, আর তার শেষাংশের দিকে সালাত আদায় করতেন। (নাফি (রহঃ) বলেন) ইবনু উমর (রাঃ)-ও এরূপ করতেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩৪০।',
        name: ' চৌকি সামনে রেখে সালাত আদায় করা ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৪৮৪। ',
            name:
                '  উসমান ইবনু আবূ শায়বা (রহঃ) .... আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ তোমরা আমাদেরকে কুকুর, গাধার সমান করে ফেলেছ! আমি নিজে এ অবস্থায় ছিলাম যে, আমি চৌকির উপর শুয়ে থাকতাম আর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এসে চৌকির মাঝ বরাবর দাঁড়িয়ে সালাত (নামায/নামাজ) আদায় করতেন। এভাবে আমি সামনে থাকা পছন্দ করতাম না। তাই আমি চৌকির পায়ের দিকে সরে গিয়ে চুপি চুপি নিজের থেকে বেরিয়ে পড়তাম।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩৪১। ',
        name: 'সম্মুখ দিয়ে অতিক্রমকারীকে মুসল্লীর বাধা দেয়া উচিত। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'وَرَدَّ ابْنُ عُمَرَ فِي التَّشَهُّدِ وَفِي الْكَعْبَةِ وَقَالَ إِنْ أَبَى إِلاَّ أَنْ تُقَاتِلَهُ فَقَاتِلْهُ ইবনে উমর (রাঃ) তাশাহহুদে বসা অবস্থায় এবং কা’বাকেও (অতিক্রমকারীকে) বাধা দিয়েছেন এবং তিনি বলেন, সে অতিক্রম করা থেকে বিরত থাকতে অস্বীকার করে লড়তে চাইলে মুসল্লী তার সাথে লড়বে। ৪৮৫। আবূ মা’মার (রহঃ) ও আদম ইবনু আবূ ইয়াস (রহঃ) .... আবূ সালেহ সম্মান (রহঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি আবূ সা’ঈদ খুদরী (রাঃ)-কে দেখেছি। তিনি জুম্মার দিন লোকদের জন্য সুতরা হিসাবে কোন কিছু সামনে রেখে সালাত (নামায/নামাজ) আদায় করছিলেন। আবূ মু’আইত গোত্রের এক যুবক তাঁর সামনে দিয়ে যেতে চাইল। আবূ সা’ঈদ খুদরী (রাঃ) তার বুকে ধাক্কা মারলেন। যুবকটি লক্ষ্য করে দেখলো যে তাঁর সামনে দিয়ে যাওয়া ছাড়া আর কোন পথ নেই। এজন্য সে পুনরায় তাঁর সামনে দিয়ে যেতে চাইল। এবার আবূ সা’ঈদ খুদরী (রাঃ) প্রথম বারের চাইতে জোরে ধাক্কা দিলেন। ফলে আবূ সা’ঈদ (রাঃ)-কে তিরস্কার করে সে মারওয়ানের কাছে গিয়ে আবূ সা’ঈদ (রাঃ)-এর ব্যবহারের বিরুদ্ধে অভিযোগ দায়ের করল। এদিকে তার পরপরই আবূ সা’ঈদ (রাঃ)-ও মারওয়ানের কাছে গেলেন। মারওয়ান তাঁকে বললেনঃ হে আবূ সা’ঈদ! তোমার এই ভাতিজার কি ঘটেছে? তিনি জবাব দিলেনঃ আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি যে, তোমাদের কেউ যদি লোকদের জন্য সামনে সুতরা রেখে সালাত আদায় করে, আর কেউ যদি তার সামনে দিয়ে যেতে চায়, তাহলে যেন সে তাকে বাধা দেয়। সে যদি না মানে, তবে সে ব্যাক্তি (মুসল্লী) যেন তার সাথে মুকাবিলা করে, কারণ সে শয়তান। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩৪২। ',
        name: '  মুসল্লীর সম্মুখ দিয়ে গমন কারীর গুনাহ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৪৮৬। ',
            name:
                ' আবদুল্লাহ ইবনু ইউসুফ (রহঃ) ..... বুসর ইবনু সা’ঈদ (রহঃ) থেকে বর্ণিত যে, যায়েদ ইবনু খালিদ (রাঃ) তাঁকে আবূ জুহায়ম (রাঃ) এর কাছে পাঠালেন, যেন তিনি তাঁকে জিজ্ঞাসা করেন যে, মুসল্লীর সামনে দিয়ে অতিক্রমকারী সম্পর্কে তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে কি শুনেছেন। তখন আবূ জুহায়ম (রাঃ) বললেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যদি মুসল্লীর সামনে অতিক্রমকারী জানতো এটা তার কত বড় অপরাধ, তাহলে সে মুসল্লীর সামনে দিয়ে অতিক্রম করার চাইতে চল্লিশ দিন/মাস/বছর দাঁড়িয়ে থাকা উত্তম মনে করতো। আবূন-নাযর (রহঃ) বলেনঃ আমার জানানেই তিনি কি চল্লিশ দিন বা চল্লিশ মাস বা চল্লিশ বছর বলেছেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩৪৩।',
        name: ' কারো দিকে মুখ করে সালাত আদায়। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'وَكَرِهَ عُثْمَانُ أَنْ يُسْتَقْبَلَ الرَّجُلُ وَهُوَ يُصَلِّي، وَإِنَّمَا هَذَا إِذَا اشْتَغَلَ بِهِ، فَأَمَّا إِذَا لَمْ يَشْتَغِلْ فَقَدْ قَالَ زَيْدُ بْنُ ثَابِتٍ مَا بَالَيْتُ إِنَّ الرَّجُلَ لاَ يَقْطَعُ صَلاَةَ الرَّجُلِ উসমান (রাঃ) সালাতরত অবস্থায় কাউকে সামনে রাখা মাকরূহ মনে করতেন। এ হুকুম তখনই প্রযোজ্য যখন তা মুসল্লীকে অন্যমনস্ক করে দেয়। কিন্তু যখন অন্যমনস্ক করে না, তখন যায়েদ ইবনে সাবিত (রাঃ) এর মতানুসারে কোন ক্ষতি নেই। তিনি বলেনঃ একজন আরেক জনের সালাত নষ্ট করতে পারে না। ৪৮৭। ইসমা’ঈল ইবনু খলীল (রহঃ) .... আয়িশা (রাঃ) থেকে বর্ণিত, একবার তাঁর সামনে সালাত (নামায/নামাজ) নষ্টকারী জিনিসের আলোচনা করা হল। লোকেরা বললোঃ কুকুর, গাধা ও মহিলা সালাত নষ্ট করে দেয়। আয়িশা (রাঃ) বললেনঃ তোমরা আমাদের কুকুরের সমান করে দিয়েছ! আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে দেখেছি, সালাত আদায় করেছেন আর আমি তাঁর ও কিবলার মাঝে চৌকির উপর কাত হয়ে শুয়ে থাকতাম। কোন কোন সময় আমার বের হওয়ার দরকার হতো এবং তাঁর সামনের দিকে যাওয়া অপছন্দ করতাম। এজন্য আমি চুপি চুপি সরে পড়তাম। আ’মাশ (রহঃ) আয়িশা (রাঃ) থেকে অনুরূপ বর্ণনা করেছেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩৪৪। ',
        name: ' ঘুমন্ত ব্যক্তির পেছনে সালাত আদায়',
        hadisNumberList: [
          HadisNumberModel(
            id: '৪৮৮। ',
            name:
                ' মুসাদ্দাদ (রহঃ) .... আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সালাত (নামায/নামাজ) আদায় করতেন আর আমি তখন তাঁর বিছানায় আড়াআড়ি ভাবে শুয়ে থাকতাম। বিতর পড়ার সময় তিনি আমাকেও জাগাতেন, তখন আমিও বিতর পড়তাম। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩৪৫।',
        name: '  মহিলার পেছন থেকে নফল সালাত আদায়',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ৪৮৯।',
            name:
                '  আবদুল্লাহ ইবনু ইউসুফ (রহঃ) ..... নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সধর্মিণী আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সামনে শুয়ে থাকতাম আর আমার পা দুটো থাকত তাঁর কিবলার দিকে। তিনি যখন সিজদা করতেন তখন আমাকে টোকা দিতেন, আর আমি আমার পা সরিয়ে নিতাম। তিনি দাঁড়িয়ে গেলে পুনরায় পা দুটো প্রসারিত করে দিতাম। আয়িশা (রাঃ) বলেন তখন ঘরে কোন বাতি ছিল না।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩৪৬। ',
        name: 'কোন কিছু সালাত নষ্ট করে না বলে যিনি মত পোষণ করেন ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                '৪৯০। উমর ইবনু হাফস (রহঃ) ..... আয়িশা (রাঃ) থেকে বর্ণিত, তাঁর সামনে সালাত নষ্টকারী, কুকুর, গাধা ও মহিলা সম্বন্ধে আলোচনা চলছিল। আয়িশা (রাঃ) বললেনঃ তোমরা আমাদেরকে গাধা ও কুকুরের সাথে তুলনা করছ? আল্লাহর কসম! আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে সালাত (নামায/নামাজ) আদায় করতে দেখেছি। তখন আমি চৌকির উপরে তাঁর ও কিবলার মাঝখানে শায়িত ছিলাম। আমার প্রয়োজন হলে আমি উঠে বসা পছন্দ করতাম না। কেননা, তাতে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কষ্ট হতে পারে। আমি তাঁর পায়ের পাশ দিয়ে চুপে চুপে বের হয়ে পড়তাম। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩৪৬।  ',
        name: ' কোন কিছু সালাত নষ্ট করে না বলে যিনি মত পোষণ করেন',
        hadisNumberList: [
          HadisNumberModel(
            id: '৪৯১। ',
            name:
                ' ইসহাক ইবনু ইবরাহীম (রহঃ) ..... নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহধর্মিণী আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রাতে উঠে সালাতে দাঁড়াতেন আর আমি তাঁর ও কিবলার মাঝখানে আড়াআড়িভাবে তাঁর পারিবারিক বিছানায় শুয়ে থাকতাম। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩৪৭। ',
        name: ' সালাতে নিজের ঘাড়ে কোন ছোট মেয়েকে তুলে নেয়া ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                '৪৯২। আবদুল্লাহ ইবনু ইউসুফ (রহঃ) ..... আবূ কাতাদা আনসারী (রাঃ) থেকে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর মেয়ে যয়নবের গর্ভজাত ও আবূল আস ইবনু রাবী’য়া ইবনু আবদে শামস (রহঃ) এর ঔরসজাত কন্যা উমামা (রাঃ)-কে কাঁধে নিয়ে সালাত (নামায/নামাজ) আদায় করতেন। তিনি যখন সিজদায় যেতেন তখন তাকে রেখে দিতেন আর যখন দাঁড়াতেন তখন তাকে তুলে নিতেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩৪৮। ',
        name: ' এমন বিছানা সামনে রেখে সালাত আদায় করা যাতে ঋতুবতী মহিলা রয়েছে ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৪৯৩।  ',
            name:
                ' আমর ইবনু যুরারা (রহঃ) .... মায়মুনা বিনতে হারিস (রাঃ) থেকে বর্ণিত, তিনি বলেন, আমার বিছানা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর মুসল্লার বরাবর ছিল। আর আমি আমার বিছানায় থাকা অবস্থায় কোন কোন সময় তাঁর কাপড় আমার গায়ের উপর এসে পড়তো।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩৪৮।  ',
        name: 'এমন বিছানা সামনে রেখে সালাত আদায় করা যাতে ঋতুবতী মহিলা রয়েছে ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ৪৯৪। ',
            name:
                'আবূ নু’মান (রহঃ) ..... মায়মুনা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সালাত (নামায/নামাজ) আদায় করতেন আর আমি তাঁর পাশে শুয়ে থাকতাম। তিনি যখন সিজদা করতেন তখন তাঁর কাপড় আমার গায়ের উপর পড়তো। সে সময় আমি হায়েয অবস্থায় ছিলাম। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩৪৯। ',
        name: ' সিজদার সুবিধার্থে নিজ স্ত্রীকে সিজদার সময় স্পর্শ করা ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৪৯৫।  ',
            name:
                ' আমর ইবনু আলী (রহঃ) .... আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ তোমরা আমাদেরকে কুকুর ও গাধার সমান করে বড়ই খারাপ করেছ। অথচ আমি নিজেকে এ অবস্থায় দেখেছি যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সালাত (নামায/নামাজ) আদায়ের সময় আমি তাঁর ও কিবলার মাঝখানে শুয়ে থাকতাম। তিনি যখন সিজদা করার ইচ্ছা করতেন তখন আমার পা দু’টোতে টোকা দিতেন। আমি তখন আমার পা দু’টো গুটিয়ে নিতাম।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩৫০।',
        name: '  মুসল্লীর দেহ থেকে মহিলা কর্তৃক নাপাকী পরিষ্কার করা',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                '৪৯৬। আহমদ ইবনু ইসহাক সারমারী (রহঃ) .... আবদুল্লাহ [ইবনু মাস’উদ (রাঃ)] থেকে বর্ণিত, তিনি বলেন, একবার রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কাবার নিকটে দাঁড়িয়ে সালাত (নামায/নামাজ) আদায় করছিলেন। আর কুরাইশের একদল তাদের মজলিসে ছিল। এমন সময় তাদের একজন বললঃ তোমরা কি এই রিয়াকারকে দেখনি? তোমাদের এমন কে আছে, যে অমুক গোত্রের উট যবেহ করার স্থান পর্যন্ত যেতে রাযী? সেখানে থেকে গোবর, রক্ত ও গর্ভাশয় নিয়ে এসে অপেক্ষায় থাকবে যখন এ ব্যাক্তি সিজদায় যাবে, তখন এগুলো তার দুই কাঁধের মাঝখানে রেখে দিবে। এ কাজের জন্য চরম হতভাগ্য ব্যাক্তি (উকবা ইবনু আবূ মু’আইত) উঠে দাঁড়াল (এবং তা নিয়ে আসলো)। যখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সিজদায় গেলেন তখন সে তাঁর দু\'কাঁধের মাঝখানে সেগুলো রেখে দিল। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সিজদায় স্থির রয়ে গেলেন। এতে তারা হাসাহাসি করতে লাগলো। একজন আরেক জনের উপর লুটিয়ে পড়তে লাগল। (এই অবস্থা দেখে) এক ব্যাক্তি ফাতিমা (রাঃ) এর কাছে গেল। তিনি তখন ছোট বালিকা ছিলেন। তিনি দৌড়ে চলে আসলেন। তখনও নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সিজদারত ছিলেন। ফাতিমা (রাঃ) সেগুলো তাঁর উপর থেকে ফেলে দিলেন এবং মুশরিকদের লক্ষ্য করে গালমন্দ করতে লাগলেন। যখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সালাত শেষ করলেন তখন তিনি বললেনঃ “আল্লাহ! তুমি কুরাইশদের ধ্বংস কর”। তারপর তিনি নাম ধরে বললেন, হে আল্লাহ! তুমি আমর ইবনু হিশাম, উতবা ইবনু রাবী’য়া, শায়বা ইবনু রাবী’য়া, ওয়ালীদ ইবনু উতবা, উমাইয়া ইবনু খালাফ, উকবা ইবনু আবূ মু’আইত এবং উমারা ইবনু ওয়ালিদকে ধ্বংশ কর”। আবদুল্লাহ ইবনু মাস’উদ (রাঃ) বলেনঃ আল্লাহর কসম! আমি এদের সবাইকে বদর যুদ্ধের দিন নিহত লাশ হয়ে পড়ে থাকতে দেখেছি। তারপর তাদের হিঁচড়ে বদরের কুয়ায় নিক্ষেপ করা হয়। তারপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলতেনঃ এই কুয়াবাসীদের উপর চিরকালের জন্য অভিশাপ। ',
            ref: '',
          ),
        ]),
  ];
  List<PorichedModel> chapterNine = [
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩৫১।',
        name: ' সালাতের সময় ও তার ফযীলত। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'وَقَوْلِهِ: (إِنَّ الصَّلاَةَ كَانَتْ عَلَى الْمُؤْمِنِينَ كِتَابًا مَوْقُوتًا) وَقَّتَهُ عَلَيْهِمْ আল্লাহ্‌ তা\'আলার বাণীঃ নিশ্চয়ই সালাত মু\'মিনদের উপর নির্ধারত ফরয। আয়াতে ব্যাবহৃত (مَوْقُوتًا) মাওকুতান শব্দটি (مُؤَقَّتاً) মুয়াক্কাতান এর অর্থে ব্যবহৃত অর্থাৎ নির্ধারিত সময়ে ফরয — যা আল্লাহ্‌ তায়ালা তাদের জন্য নির্ধারিত করে দিয়েছেন।৪৯৭। আবদুল্লাহ্ ইবনু মাসলামা (রহঃ) ..... ইবনু শিহাব (রহঃ) থেকে বর্ণিত, উমর ইবনু আবদুল আযীয (রহঃ) একদিন কোন এক সালাত (নামায/নামাজ) আদায়ে বিলম্ব করলেন। তখন উরওয়া ইবনু যুবাইর (রাঃ) তাঁর কাছে গেলেন এবং তাঁর কাছে বর্ণনা করলেন যে, ইরাকে অবস্থানকালে মুগীরা ইবনু শু’বা (রাঃ) একদিন এক সালাত আদায়ে বিলম্ব করেছিলেন। ফলে আবূ মাসঊদ আনসারী (রাঃ) তাঁর নিকট গিয়ে বললেন, হে মুগীরা! একি? তুমি কি অবগত নও যে, জিবরীল (আঃ) অবতরণ করে সালাত (নামায/নামাজ) আদায় করলেন, আর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামও সালাত আদায় করলেন। আবার তিনি সালাত আদায় করলেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামও সালাত আদায় করলেন। পুনরায় তিনি সালাত আদায় করলেন এবং রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামও সালাত আদায় করলেন। আবার তিনি সালাত আদায় করলেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামও সালাত আদায় করলেন। পুনরায় তিনি সালাত আদায় করলেন এবং রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামও সালাত আদায় করলেন। তারপর জিবরীল (আঃ) বললেন, এরই জন্য আমি আদিষ্ট হয়েছি।* উমর ইবনু আবদুল আযীয) (রহঃ) উরওয়া (রহঃ)-কে বললেন, “তুমি যা রিওয়ায়াত করছ তা একটু ভেবে দেখ। জিবরীলই কি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর জন্য সালাত এর ওয়াক্ত নির্ধারণ করে দিয়েছিলেন?” উরওয়া (রহঃ) বললেন, বাশীর ইবনু আবূ মাসউদ (রহঃ) তার পিতা থেকে এরূপই বর্ণনা করতেন। উরওয়া (রহঃ) বলেনঃ অবশ্য আয়িশা (রাঃ) আমার কাছে বর্ননা করেছেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এমন মুহূর্তে আসরের সালাত (নামায/নামাজ) আদায় করতেন যে, সূর্যেরশ্মি তখনও তাঁর হুজরার মধ্যে বিরাজমান থাকত। তবে তা উপরের দিকে উঠে যাওয়ার আগেই। * অর্থাৎ যে সময়ে সালাত আদায় করা হয়েছে, ঠিক সে সময়ে সে সালাত আদায় করার জন্য আমি আদিষ্ট হয়েছি। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩৫২। ',
        name:
            '  আল্লাহ্‌ তায়ালার বাণীঃ আল্লাহর প্রতি নিবিষ্ট চিত্ত হয়ে এবং তোমরা তাঁকে ভয় করো আর সালাত কায়িম করো, এবং মুশরিকদের অন্তর্ভুক্ত হয় না।',
        hadisNumberList: [
          HadisNumberModel(
            id: '৪৯৮। ',
            name:
                ' কুতাইবা ইবনু সায়ীদ (রহঃ) .... ইবনু আব্বাস (রাঃ) থেকে বর্ণিত, তিনি বলেন, একবার আবদুল কায়স গোত্রের একটি প্রতিনিধি দল রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকটে এসে বলল, আপনার ও আমাদের মাঝে সে ‘রাবীআ’ গোত্র থাকায় শাহ্‌রে হারাম (নিষিদ্ধ মাসসমূহ) ছাড়া অন্য কোন সময় আমরা আপনার নিকট আসতে পারি না। কাজেই আপনি আমাদের এমন কিছু নির্দেশ দিন যা আমরা নিজেরাও গ্রহণ করব এবং যারা পিছনে রয়ে গেছে তাদের প্রতিও আহবান জানাব। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ আমি তোমাদের চারটি বিষয়ে নির্দেশ দিচ্ছি, আর চারটি বিষয় থেকে তোমাদের নিষেধ করছি। নির্দেশিত বিষয়ের মাঝে একটি হল ‘ঈমান বিল্লাহ্’ (আল্লাহর প্রতি বিশ্বাস স্থাপন করা)। তারপর তিনি তাদেরকে ব্যাখ্যা করে বুঝালেন যে, ‘ঈমান বিল্লাহ্‌’ অর্থ হল, এ কথার সাক্ষ্য দেওয়া যে, এক আল্লাহ্ ব্যাতিত অন্য কোন ইলাহ্ নেই আর আমি আল্লাহর রাসূল, সালাত (নামায/নামাজ) কায়েম করা, য়াকাত দেওয়া, আর গনীমতের মালের এক-পঞ্চমাংশ দান করা। আর তোমাদের নিষেধ করছি কদুর পাত্র, সবুজ রঙের মাটির পাত্র, বিশেষ ধরনের তৈলাক্ত পাত্র ও গাছের গুড়ি খোদাই করে তৈরী পাত্র ব্যবহার করতে। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩৫৩।',
        name: ' সালাত কায়েমের বায়\'আত গ্রহণ। ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৪৯৯। ',
            name:
                ' মুহাম্মাদ ইবনুল মুছান্না (রহঃ) .... জারীর ইবনু আবদুল্লাহ (রাঃ) থেকে বর্ণিত, তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট সালাত (নামায/নামাজ) আদায়, যাকাত প্রদান এবং প্রত্যেক মুসলিমকে নসীহত করার বায়আত গ্রহন করেছি। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩৫৪।',
        name: ' সালাত হল (গুনাহর) কাফফারা। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ৫০০।  ',
            name:
                'মুসাদ্দাদ (রহঃ) ... হুযাইফা (রাঃ) থেকে বর্ণিত, তিনি বলেন, একদা আমরা উমর (রাঃ) এর কাছে বসা ছিলাম। তখন তিনি বললেন, ফিতনা সম্পর্কে রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর বক্তব্য তোমাদের মধ্যে কে স্মরণ রেখেছ? হুযাইফা (রাঃ) বললেন, যেমনি তিনি বলেছিলেন হুবহু তেমনই আমি মনে রেখেছি। উমর (রাঃ) বললেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর বাণী স্মরণ রাখার ব্যপারে তুমি খুব দৃঢ়তার পরিচয় দিচ্ছ। আমি বললাম, (রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছিলেন) মানুষ নিজের পরিবার-পরিজন, ধন-সম্পদ, সন্তান-সন্ততি, পাড়া-প্রতিবেশীদের ব্যাপারে যে ফেতনায় পতিত হয় -সালাত (নামায/নামাজ), সিয়াম, সাদাকা, (ন্যায়ের) আদেশ ও (অন্যায়ের) নিষেধ তা দূরীভূত করে দেয়। উমর (রাঃ) বললেন, তা আমার উদ্দেশ্যে নয়। বরং আমি সেই ফিতনার কথা বলছি, যা সমুদ্র তরঙের ন্যায় ভয়াল হবে। হুযাইফা (রাঃ) বললেন, হে আমীরুল মু’মিনীন! সে ব্যাপারে আপনার ভয়ের কোন কারন নেই। কেননা, আপনার ও সে ফিতনার মাঝখানে একটি বন্ধ দরজা রয়েছে। উমর (রাঃ) জিজ্ঞাসা করলেন, সে দরজাটি ভেঙ্গে ফেলা হবে, না খুলে দেওয়া হবে? হুযাইফা (রাঃ) বললেন, ভেঙ্গে ফেলা হবে। উমর (রাঃ) বললেন, তাহলে তো আর কোন দিন তা বন্ধ করা যাবে না। [হুযাইফা (রাঃ) এর ছাত্র শাকীক (রহঃ) বললেন], আমরা জিজ্ঞাসা করলাম, উমর (রাঃ)-কি সে দরজাটি সম্পর্কে জানতেন? হুযাইফা (রাঃ) বললেন, হ্যাঁ, দিনের পূর্বে রাতের আগমন যেমন সুনিশ্চিত, তেমনি নিশ্চিতভাবে তিনি জানতেন। কেননা আমি তার কাছে এমন একটি হাদিস বর্ণনা করেছি, যা মোটেও ভুল নয়। (দারজাটি কী) এ বিষয়ে হুযাইফা (রাঃ)-কে জিজ্ঞাসা করতে আমরা ভয় পাছিলাম। তাই, আমরা মাসরূক (রহঃ)-কে বললাম এবং তিনি তাঁকে জিজ্ঞাসা করলেন। তিনি বললেন, দরজাটি উমর (রাঃ) নিজেই।',
            ref: '',
          ),
          HadisNumberModel(
            id: '৫০১। ',
            name:
                ' কুতাইবা (রহঃ) ..... আবদুল্লাহ ইবনু মাসঊদ (রাঃ) থেকে বর্ণিত, তিনি বলেন, এক ব্যাক্তি জনৈক মহিলাকে চুম্বন করে বসে। পরে সে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর আছে এসে বিষয়টি তাঁর গোচরীভূত করে। তখন আল্লাহ তা’আলা আয়াত নাযিল করেনঃ “দিনের দু’প্রান্তে-সকাল ও সন্ধ্যায় এবং রাতের প্রথম অংশে সালাত (নামায/নামাজ) কায়েম কর। নিশ্চয়ই ভাল কাজ পাপাচারকে মিটিয়ে দেয়”। লোকটি জিজ্ঞাস করল, ইয়া রাসুলাল্লাহ! এ কি শুধু আমার বেলায়? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমার সকল উম্মাতের জন্যই। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩৫৫। ',
        name: '  যথাসময়ে সালাত আদায়ের ফযীলত।',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                '৫০২। আবূল ওয়ালীদ হিশাম ইবনু আবদুল মালেক (রহঃ) .... আবূ আমর শায়বানী (রহঃ) থেকে বর্ণিত, তিনি আবদুল্লাহ ইবনু মাসঊদ (রাঃ)-এর বাড়ীর দিকে ইশারা করে বলেন, এ বাড়ীর মালিক আমাদের কাছে বর্ণনা করেছেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে জিজ্ঞাসা করলাম, কোন্ আমল আল্লাহর নিকট অধিক প্রিয়? তিনি বললেন, যথাসময়ে সালাত (নামায/নামাজ) আদায় করা। ইবনু মাসঊদ (রাঃ) পুনরায় জিজ্ঞাসা করলেন, এরপর কোনটি? তিনি বললেন, এরপর পিতা-মাতার প্রতি সদ্ব্যবহার। ইবনু মাসঊদ (রাঃ) আবার জিজ্ঞাসা করলেন, এরপর কোনটি? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, এরপর জিহাদ ফী সাবীলিল্লাহ্ (আল্লাহর পথে জিহাদ)। ইবনু মাসঊদ (রাঃ) বলেন, এগুলো তো রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে বলেছেনই, যদি আমি আরও বেশী জানতে চাইতাম, তাহলে তিনি আরও বলতেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩৫৬। ',
        name: '  পাঁচ ওয়াক্তের সালাত (গুনাসমূহের) কাফ্‌ফারা।',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ৫০৩। ',
            name:
                ' ইব্রাহীম ইবনু হামযা (রহঃ) .... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছেন, “বলত যদি তোমাদের কারো বাড়ীর সামনে একটি নদী থাকে, আর সে তাতে প্রত্যহ পাঁচবার গোসল করে, তাহলে কি তার দেহে কোন ময়লা থাকবে?” তারা বললেন, তার দেহে কোনরূপ ময়লা বাকী থাকবে না। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ এ হল পাঁচ ওয়াক্ত সালাত (নামায/নামাজ)-এর উদাহরণ। এর মাধ্যমে আল্লাহ তা’আলা (বান্দার) গুনাহসমূহ মিটিয়ে দেন।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩৫৭।',
        name: '  নির্ধারিত সময় থেকে বিলম্বে সালাত আদায় করে তার হক নষ্ট করা।',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ৫০৪। ',
            name:
                ' মূসা ইবনু ইসমাঈল (রহঃ) .... আনাস (রাঃ) থেকে বর্ণিত, তিনি বলেন, আজকাল কোন জিনিসই সে অবস্থায় পাই না, যেমন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর যুগে ছিল। প্রশ্ন করা হল, সালাত (নামায/নামাজ)ও কি? তিনি বললেন, সে ক্ষেত্রেও যা হক নষ্ট করার তা-কি তোমরা করনি?',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ৫০৫।  ',
            name:
                'আমর্ ইবনু যুরারা (রহঃ) .... যুহরী (রহঃ) থেকে বর্ণিত, তিনি বলেন, আমি দামেশ্‌কে আনাস ইবনু মালিক (রাঃ)-এর নিকট উপস্থিত হলাম, তিনি তখন কাঁদছিলেন। আমি তাঁকে জিজ্ঞাসা করলাম, আপনি কাঁদছেন কেন? তিনি বললেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর যুগে যা কিছু পেয়েছি তার মধ্যে কেবলমাত্র সালাত (নামায/নামাজ) ছাড়া আর কিছুই বহাল নেই। কিন্তু সালাতকেও নষ্ট করে দেওয়া হয়েছে। বাকর (রহঃ) বলেন, আমার কাছে মুহাম্মাদ ইবনু বকর বুরসানী (রহঃ) উসমান ইবনুু্ আবূ রাওওয়াদ (রহঃ) সূত্রে অনুরূপ বর্ণনা করেছেন।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩৫৮।',
        name: ' মুসল্লী সালাতে তার মহান প্রতিপালকের সাথে গোপনে কথা বলে। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ৫০৬।  ',
            name:
                'মুসলিম ইবনুু্ ইবরাহিম (রহঃ) .... আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের কেউ যখন সালাতে (নামায/নামাজ) দাঁড়ায়, তখন সে তার প্রতিপালকের সঙ্গে গোপনে কথা বলে। কাজেই, সে যেন ডানদিকে থুথু না ফেলে, তবে (প্রয়োজনে) বাম পায়ের নীচে ফেলতে পারে। আর শু\'বা (রহঃ) বলেন, সে যেন কিবলার দিকে অথবা ডান দিকে থুথু না ফেলে, কিন্তু বামদিকে অথবা পায়ের তলায় ফেলতে পারে।',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ৫০৭।',
            name:
                ' হাফস ইবনু উমর (রহঃ) ..... আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা সিজদায় মধ্যপন্থা অবলম্বন কর। তোমাদের কেউ যেন তার বাহুদ্বয় বিছিয়ে না দেয় কুকুরের মত। আর যদি থুথু ফেলতে হয়, তাহলে সে যেন সামনে বা ডানে না ফেলে। কেননা, সে তখন তার প্রতিপালকের সঙ্গে গোপন কথায় লিপ্ত থাকে। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩৫৯।',
        name: '  প্রচণ্ড গরমের সময় যুহরের সালাত ঠাণ্ডায় আদায় করা।',
        hadisNumberList: [
          HadisNumberModel(
            id: '৫০৮। ',
            name:
                ' আয়্যূব ইবনু সুলাইমান (রহঃ) .... আবূ হুরায়রা ও আবদুল্লাহ ইবনু উমর (রাঃ) থেকে বর্ণিত যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যখন গরমের প্রচণ্ডতা বৃদ্ধি পায়, তখন গরম কমলে সালাত (নামায/নামাজ) আদায় করবে। কেননা, গরমের প্রচণ্ডতা জাহান্নামের নিঃশ্বাসের অংশ। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩৫৯।',
        name: '  প্রচণ্ড গরমের সময় যুহরের সালাত ঠাণ্ডায় আদায় করা।',
        hadisNumberList: [
          HadisNumberModel(
            id: '৫০৯। ',
            name:
                ' মুহাম্মদ ইবনু বাশ্‌শার (রহঃ) .... আবূ যার্র (রাঃ) থেকে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর মুয়ায্‌যীন আযান দিলে তিনি বললেনঃ ঠান্ডা হতে দাও,ঠান্ডা হতে দাও। অথবা তিনি বললেন, অপেক্ষা কর, অপেক্ষা কর। তিনি আরও বলেন, গরমের প্রচণ্ডতা জাহান্নামের নিঃশ্বাসের ফলেই সৃষ্টি হয়। কাজেই গরম যখন বেড়ে যায় তখন গরম কমলেই সালাত (নামায/নামাজ) আদায় করবে। এমনকি (বিলম্ব করতে করতে বেলা এতটুকু গড়িয়ে গিয়েছিল যে) আমরা টিলাগুলোর ছায়া দেখতে পেলাম। ',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ৫১০। ',
            name:
                ' আলী ইবনু আবদুল্লাহ‌ মাদ্বীনী (রহঃ) .... আবূ হূরায়রা (রাঃ) থেকে বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যখন গরম বৃদ্ধি পায় তখন তোমরা তা কমে এলে (যুহরের) সালাত (নামায/নামাজ) আদায় করো। কেননা, গরমের প্রচন্ডতা জাহান্নামের উত্তাপের অংশ। (তারপর তিনি বলেন), জাহান্নাম তার প্রতিপালকের কাছে এ বলে নালিশ করেছিল, হে আমার প্রতিপালক! (দহনের প্রচণ্ডতায়) আমার এক অংশ আরেক অংশকে গ্রাস করে ফেলেছে। ফলে আল্লাহ্ তা’আলা তাকে দু’টি শ্বাস ফেলার অনুমতি দিলেন, একটি শীতকালে আর একটি গ্রীষ্মকালে। আর সে দু’টি হল, তোমরা গ্রীষ্মকালে যে প্রচণ্ঠ উত্তাপ এবং শীতকালে যে প্রচণ্ড ঠান্ডা অনুভব কর তাই।',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ৫১১।',
            name:
                ' উমর ইবনু হাফস (রহঃ) ..... আবূ সাঈদ (রাঃ) থেকে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যুহরের সালাত (নামায/নামাজ) গরম কমলে আদায় কর। কেননা, গরমের প্রচন্ডতা জাহান্নামের উত্তাপ থেকে। সুফিয়ান, ইয়াহ্ইয়া এবং আবূ আওয়ানা (রহঃ) আ’মাশ (রহঃ) থেকে অনুরূপ বর্ণনা করেছেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩৬০। ',
        name: ' সফরকালে গরম কমে গেলে যুহরের সালাত আদায়। ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৫১২। ',
            name:
                '  আদম ইবনু আবূ ইয়াস (রহঃ) ... আবূ যার্র (রাঃ) থেকে বর্ণিত, তিনি বলেন, এক সফরে আমরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে ছিলাম। এক সময় মুয়ায্‌যীন যুহরের আযান দিতে চেয়েছিল। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ গরম কমতে দাও। কিছুক্ষন পর আবার মুয়ায্‌যীন আযান দিতে চাইলে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (পুনরায়) বললেনঃ গরম কমতে দাও। এভাবে তিনি (সালাত আদায়ে) এত বিলম্ব করলেন যে, আমারা টিলাগুলোর ছায়া দেখতে পেলাম। তারপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ গরমের প্রচন্ডতা জাহান্নামের উত্তাপ থেকে। কাজেই গরম প্রচন্ড হলে উত্তাপ কমার পর সালাত (নামায/নামাজ) আদায় করো। ইবনু আব্বাস (রাঃ) বলেন হাদিসেتَتَفَيَّأ শব্দটিتَتَمَيَّلُ ঝুঁকে পড়া, গড়িয়ে পড়ার অর্থে ব্যবহৃত হয়েছে।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩৬১। ',
        name: '  যুহরের ওয়াক্ত হয় সূর্য ঢলে পড়লে।',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'وَقَالَ جَابِرٌ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي بِالْهَاجِرَةِ জাবির (রাঃ) বলেন, দুপুরে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সালাত আদায় করতেন। ৫১৩। আবূল ইয়ামান (রহঃ) .... আনাস ইবনুু্ মালিক (রাঃ) থেকে বর্ণিত, তিনি বলেন, একদিন সূর্য ঢলে পড়লে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বেরিয়ে এলেন এবং যুহরের সালাত (নামায/নামাজ) আদায় করলেন। তারপর মিম্বরে দাঁড়িয়ে কিয়ামত সম্বন্ধে আলোচনা করেন এবং বলেন যে, কিয়ামতে বহু ভয়ঙ্কর ঘটনা ঘটবে। এরপর তিনি বলেন, আমাকে কেউ কোন বিষয়ে প্রশ্ন করতে চাইলে করতে পারে। আমি যতক্ষন এ বৈঠকে আছি, এর মধ্যে তোমরা আমাকে যা কিছু জিজ্ঞাসা করবে আমি তা জানিয়ে দিব। এ শুনে লোকেরা খুব কাঁদতে শুরু করল। আর তিনি বলতে থাকলেনঃ আমাকে প্রশ্ন কর, আমাকে প্রশ্ন কর। এ সময় আবদুল্লাহ্ ইবনু হুযাইফা সাহমী (রাঃ) দাঁড়িয়ে জিজ্ঞাসা করলেন, আমার পিতা কে? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তোমার পিতা ‘হুযাইফা’। এরপর তিনি অনেকবার বললেনঃ আমাকে প্রশ্ন কর। তখন উমর (রাঃ) নতজানোু হয়ে বসে বললেন, “আমরা আল্লাহকে প্রতিপালক হিসাবে, ইসলামকে দ্বীন হিসাবে এবং মুহাম্মদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে নবী হিসাবে গ্রহণ করে সন্তুষ্ট। এরপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নীরব থাকলেন। কিছুক্ষণ পর বললেনঃ এক্ষুনি এ দেওয়ালের পাশে জান্নাত ও জাহান্নাম আমার সামনে তুলে ধরা হয়েছিল; এত উত্তম ও এত নিকৃষ্টের মত কিছু আমি আর দেখিনি। ',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ৫১৪।',
            name:
                '  হাফসা ইবনু উমর (রহঃ) ..... আবূ বারযা (রাঃ) থেকে বর্ণিত, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এমন সময় ফজরের সালাত (নামায/নামাজ) আদায় করতেন, যখন আমাদের একজন তার পার্শ্ববর্তী আপরজনকে চিনতে পারত। আর এ সালাত (নামায/নামাজ) তিনি ষাট থেকে একশ আয়াত তিলাওয়াত করতেন এবং যুহরের সালাত আদায় করতেন যখন সূর্য পশিম দিকে ঢলে পড়ত। তিনি আসরের সালাত আদায় করতেন এমন সময় যে, আমাদের কেউ মদিনার শেষ প্রান্তে পৌছে আবার ফিরে আসতে পারত, তখনও সূর্য সতেজ থাকত। রাবী বলেন, মাগরিব সম্পর্কে তিনি [আবূ বারযা (রাঃ)] কী বলেছিলেন, আমি তা ভুলে গেছি। আর ইশার সালাত রাতের এক-তৃতীয়াংশ পর্যন্ত পিছিয়ে নিতে তিনি কোনরূপ দ্বিধাবোধ করতেন না। তারপর রাবী বলেন, রাতের অর্ধাংশ পর্যন্ত পিছিয়ে নিতে অসুবিধা বোধ করতেন না। আর মু’আয (রহঃ) বর্ণনা করেন যে, শু’বা (রহঃ) বলেছেন, পরে আবূল মিনহালের (রহঃ) সংগে সাক্ষাত হয়েছিল, সে সময় তিনি বলেছেন, রাতের এক তৃতীয়াংশ পর্যন্ত বিলম্ব করতে অসুবিধা বোধ করতেন না।',
            ref: '',
          ),
          HadisNumberModel(
            id: '৫১৫। ',
            name:
                '  মুহাম্মদ ইবনু মুকাতিল (রহঃ) .... আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত, তিনি বলেন, আমরা যখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর পিছনে গরমের সময় সালাত (নামায/নামাজ) আদায় করতাম, তখন উত্তাপ থেকে রক্ষা পাওয়ার জন্য কাপড়ের উপর সিজ্‌দা করতাম।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩৬২।',
        name: '  যুহারের সালাত আসরের ওয়াক্তের আগ পর্যন্ত বিলম্ব করা।',
        hadisNumberList: [
          HadisNumberModel(
            id: '৫১৬।  ',
            name:
                'আবূ নু’মান (রহঃ) ..... ইবনু আব্বাস (রাঃ) থেকে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মদিনা অবস্থানকালে (একবার) যুহর ও আসরের আট রাকাআত এবং মাগরিব ও ইশার সাত রাকাআত একত্রে মিলিয়ে আদায় করেন।* আয়্যূব (রহঃ) বলেন, সম্ভবত এটা বৃষ্টির রাতে হয়েছিল। জাবির (রহঃ) বললেন, সম্ভবত তাই। *ইমাম তিরমিযী (রহঃ) বলেন, বাড়ীতে অবস্থানকালে কোন প্রকার ভয় বা বৃষ্টি না থাকলে এরূপ করা যাবে না। এতে কারো দ্বিমত নেই। তবে ওযর থাকলে, কিংবা সফরের অবস্থায় এরুপ মিলিয়ে পড়া যাবে বলে ইমাম শাফেই, আহমাদ ও মালিক (রহঃ) মনে করেন। ইমাম আবু হানিফা (রহঃ) এর মতে পৃথক পৃথকভাবে আদায় করতে হবে। এক নিয়্যাতে একত্রে আদায় করা জায়িয নয়। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩৬৩। ',
        name: 'আসরের ওয়াক্ত ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৫১৭। ',
            name:
                ' ইবরাহিম ইবনু মুনযির (রহঃ) ..... আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এমন সময় আসরের সালাত (নামায/নামাজ) আদায় করতেন যে, তখনো সূর্যেরশ্মি ঘরের বাইরে যায়নি। ',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ৫১৮। ',
            name:
                'কুতাইবা (রহঃ) .... আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এমন সময় আসরের সালাত (নামায/নামাজ) আদায় করেছেন যে, সূর্যেরশ্মি তখনো তাঁর ঘরের মধ্যে ছিল, আর ছায়া তখনো তাঁর ঘর থেকে বেরিয়ে পড়েনি। ',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ৫১৯।',
            name:
                '  আবূ নু’আইম (রহঃ) .... আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আসরের সালাত (নামায/নামাজ) আদায় করতেন, আর সূর্যকিরণ তখনো আমার ঘরে থাকত। সালাত (নামায/নামাজ) আদায় করার পরও পশ্চিমের ছায়া ঘরে দৃষ্টিগোচর হত না। আবূ আবদুল্লাহ [ইমাম বুখারী (রহঃ)] বলেন, ইমাম মালিক, ইয়াহ্ইয়া ইবনু সাঈদ, শুআইব ও ইবনু আবূ হাফস্ (রহঃ) উক্ত সনদে এ হাদীসটির বর্ণনায় \'সূর্যেরশ্মি আমার ঘরের ভিতরে থাকত, ঘরের মেঝে ছায়া নেমে আসেনি\' এরূপ বলেছেন।',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ৫২০।',
            name:
                ' মুহাম্মদ ইবনু মুকাতিল (রহঃ) .... সায়্যার ইবনু সালামা (রহঃ) থেকে বর্ণিত, তিনি বলেন, একবার আমি ও আমার পিতা আবূ বারযা আসলামী (রাঃ) এর কাছে গেলাম। আমার পিতা তাঁকে জিজ্ঞাসা করলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফরয সালাতসমূহ কিভাবে আদায় করতেন? তিনি বললেন, আল-হাজীর, যাকে তোমরা আল-উলা বা যুহর বলে থাক, তা তিনি আদায় করতেন যখন সূর্য পশ্চিম আকাশে ঢলে পড়ত। আর আসরের সালাত (নামায/নামাজ) এমন সময় আদায় করতেন যে, তারপর আমাদের কেউ মদিনার শেষ প্রান্তে তার ঘরে ফিরে যেতো সূর্য তখনও সতেজ থাকতো। মাগরিব সম্পর্কে তিনি কি বলেছিলেন তা আমি ভুলে গেছি। আর ইশার সালাত যাকে তোমরা ‘আতামা’ বলে থাক, তা তিনি বিলম্বে আদায় করা পছন্দ করতেন। আর তিনি ইশার সালাতের আগে নিদ্রা যাওয়া এবং পরে কথাবার্তা বলা অপছন্দ করতেন। তিনি ফজরের সালাত এমন সময় সমাপ্ত করতেন যখন প্রত্যেকে তার পাশ্ববর্তী ব্যাক্তিকে চিনতে পারত। এ সালাতে তিনি ষাট থেকে একশ’ আয়াত তেলাওয়াত করতেন। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '৫২১। ',
            name:
                ' আবদুল্লাহ ইবনু মাসলামা (রহঃ) .... আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত, তিনি বলেন, আমরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে আসরের সালাত (নামায/নামাজ) আদায় করতাম। সালাতের পর লোকেরা আওফ গোত্রের মহল্লায় গিয়ে তাদেরকে সালাত আদায় করা অবস্থায় পেত। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '৫২২।  ',
            name:
                'মুহাম্মদ ইবনু মুকাতিল (রহঃ) ..... আবূ উমামা (রাঃ) থেকে বর্ণিত, তিনি বলেন, একবার আমরা উমর ইবনু আযীয (রহঃ)-এর সঙ্গে যুহরের সালাত (নামায/নামাজ) আদায় করলাম। তারপর সেখান থেকে বেরিয়ে আনাস ইবনু মালিক (রাঃ) এর কাছে গেলাম। আমরা গিয়ে তাঁকে আসরের সালাত আদায়ে রত পেলাম। আমি তাঁকে বললাম চাচা! এ কোন সালাত যা আপনি আদায় করলেন? তিনি বললেন, আসরের সালাত আর এ হল রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সালাত, যা আমরা তাঁর সাথে আদায় করতাম। ',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ৫২৩। ',
            name:
                'আবদুল্লাহ ইবনু ইউসুফ (রহঃ) .... আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত, তিনি বলেন, আমরা আসরের সালাত (নামায/নামাজ) আদায় করতাম, তারপর আমাদের কোন গমনকারী কুবার দিকে যেত এবং সূর্য যথেষ্ট উপরে থাকতেই সে তাদের কাছে পৌঁছে যেত। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '৫২৪। ',
            name:
                ' আবূল ইয়ামান (রহঃ) .... আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আসরের সালাত (নামায/নামাজ) আদায় করতেন, আর সূর্য তখনও যথেষ্ট উপরে উজ্জ্বল অবস্থায় বিরাজমান থাকত। সালাতের পর কোন গমনকারী আওয়ালির দিকে রওয়ানা হয়ে পৌঁছে যেত, আর তখনও সূর্য উপরে থাকত। আওয়ালার কোন অংশ ছিল মদিনা থেকে চার মাইল বা তার কাছাকাছি দূরত্বে। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩৬৫। ',
        name: '  যে ব্যাক্তির আসরের সালাত ফাউত হল তার গুনাহ।',
        hadisNumberList: [
          HadisNumberModel(
            id: '৫২৫। ',
            name:
                ' আব্দুল্ললাহ্ ইবনু ইউসুফ (রহঃ) .... আবদুল্লাহ ইবনু উমর (রাঃ) থেকে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যদি কোন ব্যাক্তির আসরের সালাত (নামায/নামাজ) ছুটে যায়, তাহলে যেন তার পরিবার-পরিজন ও মাল-সম্পদ সব কিছুই ধ্বংস হয়ে গেল। আবূ আবদুল্লাহ [ইমাম বুখারী (রহঃ)] বলেন, (আরবী পরিভাষায়)وترت الرجل বাক্যটি ব্যবহার করা হয় যখন কেউ কাউকে হত্যা করে অথবা মাল-সম্পদ ছিনিয়ে নেয়। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩৬৬। ',
        name: '  যে ব্যাক্তি আসরের সালাত ছেড়ে দিল তার গুনাহ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ৫২৬।',
            name:
                '  মুসলিম ইবনু ইবরাহীম (রহঃ) .... আবূ মালীহ্ (রহঃ) থেকে বর্ণিত, তিনি বলেন, এক যুদ্ধে আমরা বুরাইদা (রাঃ) এর সঙ্গে ছিলাম। দিনটি ছিল মেঘাচ্ছন্ন। তাই বুরাইদা (রাঃ) বলেন, শীঘ্র আসরের সালাত (নামায/নামাজ) আদায় করে নাও। কারণ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যাক্তি আসরের সালাত ছেড়ে দেয় তার আমল বিনষ্ট হয়ে যায়।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩৬৭। ',
        name: ' আসরের সালাতের ফযীলত ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ৫২৭। ',
            name:
                ' হুমাইদী (রহঃ) ... জরীর ইবনু আবদুল্লাহ (রাঃ) থেকে বর্ণিত, তিনি বলেন, একদা আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট উপস্থিত ছিলাম। তিনি রাতে (পূর্ণিমার) চাঁদের দিকে তাকিয়ে বললেনঃ ঐ চাঁদকে তোমরা যেমন দেখছ, ঠিক তেমনি অচিরেই তোমাদের প্রতিপালককে তোমরা দেখতে পাবে। তাঁকে দেখতে তোমরা কোন ভীড়ের সম্মুখীন হবে না। কাজেই সূর্য উদয়ের এবং অস্ত যাওয়ার আগের সালাত (নামায/নামাজ) (শয়তানের প্রভাবমুক্ত হয়ে) আদায় করতে পারলে তোমরা তাই করবে। তারপর তিনি নিম্নোক্ত আয়াত পাঠ করলেন, “কাজেই তোমার প্রতিপালকের প্রশংসার তাসবীহ্ পাঠ কর সূর্য উদয়ের আগে ও অস্ত যওয়ার আগে।” (৫০ : ৩৯) ইসমাঈল (রহঃ) বলেন, এর অর্থ হলঃ এমনভাবে আদায় করার চেষ্টা করবে যেন কখনো ছুটে না যায়।',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ৫২৮।',
            name:
                '  আবদুল্লাহ ইবনু ইউসুফ (রহঃ) .... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ফেরেশতাগণ পালা বদল করে তোমাদের মাঝে আগমন করেন; একদল দিনে, একদল রাতে। আসর ও ফজরের সালাত (নামায/নামাজ) উভয় দল একত্র হন। তারপর তোমাদের মাঝে রাত যাপনকারী দলটি উঠে যান। তখন তাদের প্রতিপালক তাদের জিজ্ঞাসা করেন, আমার বান্দাদের কোন্ অবস্থায় রেখে আসলে? অবশ্য তিনি নিজেই তাদের ব্যাপারে সর্বাধিক পরিজ্ঞাত। উত্তরে তাঁরা বলেনঃ আমরা তাদের সালাতে রেখে এসেছি, আর আমরা যখন তাদের কাছে গিয়েছিলাম তখনও তারা সালাত রত ছিলেন।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩৬৮।',
        name: ' সূর্যাস্তের পূর্বে যে ব্যাক্তি আসরের এক রাকআত পায়।',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ৫২৯।',
            name:
                ' আবূ ন’আইম (রহঃ) .... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের কেউ যদি সূর্য অস্ত যাওয়ার আগে আসরের সালাতের এক সিজদা পায়, তাহলে সে যেন সালাত (নামায/নামাজ) পূর্ণ করে নেয়। আর যদি সূর্য উদিত হওয়ার আগে ফজরের সালাতর এক সিজদা পায়, তাহলে সে যেন সালাত (নামায/নামাজ) পূর্ণ করে নেয়।* *হাদিসে উল্লিখিত সিজদা শব্দটি রাকআত অর্থে ব্যাবহৃত হয়েছে। ',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ৫৩০।',
            name:
                ' আবদুল আযীয ইবনু আবদুল্লাহ (রহঃ) .... সালিম ইবনু আবদুল্লাহ (রহঃ) তাঁর পিতা থেকে বর্ণনা করেন, তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছেন যে, পূর্বেকার উম্মাতের স্থায়িত্বের তুলনায় তোমাদের স্থায়িত্ব হল আসর থেকে নিয়ে সূর্য অস্ত যাওয়ার মধ্যবর্তী সময়ের অনুরূপ। তাওরাত অনুসারীদেরকে তাওরাত দেওয়া হয়েছিল। তারা তদনুসারে কাজ করতে লাগল; যখন দুপুর হল, তখন তারা অপারগ হয়ে পড়ল। তাদের এক এক ‘কীরাত’ করে পারিশ্রমিক প্রদান করা হয়। তারপর ইনজীল অনুসারীদেরকে ইনজীল দেওয়া হল। তারা আসরের সালাত (নামায/নামাজ) পর্যন্ত কাজ করে অপারগ হয়ে পড়ল। তাদেরকে এক এক ‘কীরাত’ করে পারিশ্রমিক দেওয়া হল। তারপর আমাদেরকে কুরাআন দেওয়া হল। আমরা সূর্যাস্ত পর্যন্ত কাজ করলাম। আমদের দুই দুই ‘কীরাত’ করে দেওয়া হল। এতে উভয় কিতাবী সম্প্রদায় বলল, হে আমাদের প্রতিপালক! তাদের দুই দুই ‘কীরাত’ করে দান করেছেন, আর আমাদেরকে দিয়েছেন এক এক কীরাত করে; অথচ আমলের দিক দিয়ে আমরাই বেশী। আল্লাহ তা’আলা বললেনঃ তোমাদের পারিশ্রমিকের ব্যাপারে আমি কি তোমাদের প্রতি কোনরূপ যুলুম করেছি? তারা বলল, না। তখন আল্লাহ্ তা’আলা বললেনঃ এ হল, আমার অনুগ্রহ যাকে ইচ্ছা তাকে দেই। ',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ৫৩১। ',
            name:
                'আবূ কুরাইব (রহঃ) ... আবূ মূসা (রাঃ) থেকে বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, মুসলিম, ইয়াহূদী ও নাসারাদের উদাহারণ হল এরূপ, এক ব্যাক্তি একদল লোককে কাজে নিয়োগ করল, তারা তার জন্য রাত পর্যন্ত কাজ করবে। কিন্তু অর্ধদিবস পর্যন্ত কাজ করার পর তারা বলল, আপনার পারিশ্রমিকের আমাদের কোন প্রয়োজন নেই। সে ব্যাক্তি অন্য আরেক দল লোককে কাজে নিয়োগ করল এবং বলল, তোমরা দিনের বাকী অংশ কাজ কর, তোমরা আমার নির্ধারিত পারিশ্রমিক পাবে। তারা কাজ করতে শুরু করল। যখন আসরের সালাতের সময় হল, তখন তারা বলল, আমরা যা কাজ করেছি তা আপনার জন্য রেখে গেলাম। তারপর সে ব্যাক্তি আরেক দল লোককে কাজে নিয়োগ করল। তারা সূর্যাস্ত পর্যন্ত দিনের বাকী অংশ কাজ করল এবং সে দুই দলের পূর্ণ পারিশ্রমিক হাসিল করে নিল। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩৬৯। ',
        name:
            ' মাগরিবের ওয়াক্ত। আতা রহঃ বলেন, রুগ্ন ব্যাক্তি মাগরিব ও ইশার সালাত একত্রে আদায় করতে পারে। ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৫৩২। ',
            name:
                ' মুহাম্মদ ইবনু মিহারান (রহঃ) .... রাফি’ ইবনু খাদীজ (রাঃ) থেকে বর্ণিত, তিনি বলেন, আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে মাগরিবের সালাত (নামায/নামাজ) আদায় করে এমন সময় ফিরে আসতাম যে, আমাদের কেউ (তীর নিক্ষেপ করলে) নিক্ষিপ্ত তীর পতিত হওয়ার স্থান দেখতে পেত। ',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ৫৩৩।',
            name:
                ' মুহাম্মদ ইবনু বাশ্‌শার (রহঃ) .... মুহাম্মদ ইবনু আমর ইবনু হাসান ইবনু আলী (রাঃ) থেকে বর্ণিত, মুহাম্মদ ইবনু আমর (রহঃ) বলেন, হাজ্জাজ ইবনু ইউসুফ) (মদিনায়) এলে আমরা জাবির ইবনু আবদুল্লাহ্ (রাঃ)-কে সালাতের ওয়াক্ত সম্বন্ধে জিজ্ঞাসা করলাম, (কেননা, হাজ্জাজ ইবনু ইউসুফ বিলম্ব করে সালাত আদায় করতেন)। তিনি বললেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যুহরের সালাত (নামায/নামাজ) প্রচন্ড গরমের সময় আদায় করতেন। আর আসরের সালাত সূর্য উজ্জল থাকতে আদায় করতেন, মাগরিবের সালাত সূর্য অস্ত যেতেই আর ইশার সালাত বিভিন্ন সময়ে আদায় করতেন। যদি দেখতেন, সবাই সমবেত হয়েছেন, তাহলে সকাল সকাল আদায় করতেন। আর যদি দেখতেন, লোকজন আসতে দেরী করছে, তাহলে বিলম্বে আদায় করতেন। আর ফজরের সালাত তাঁরা কিংবা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অন্ধকার থাকতে আদায় করতেন। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '৫৩৪। ',
            name:
                ' মাক্কী ইবনু ইবরাহিম (রহঃ) ..... সালামা (রাঃ) থেকে বর্ণিত, তিনি বলেন, সূর্য পর্দার আড়ালে ঢাকা পড়ে যাওয়ার সাথে সাথেই আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে মাগরিবের সালাত (নামায/নামাজ) আদায় করতাম। ',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ৫৩৫।',
            name:
                '  আদম (রহঃ) ..... ইবনু আব্বাস (রাঃ) থেকে বর্ণিত, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (মাগরিব ও ইশার) সাত রাকআত ও (যুহর ও আসরের) আট রাকাআত একসাথে আদায় করেছেন।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩৭০।',
        name: '  মাগরিবকে ইশা বলা যিনি পছন্দ করেন না।',
        hadisNumberList: [
          HadisNumberModel(
            id: '৫৩৬। ',
            name:
                ' আবূ মা’মার আবদুল্লাহ ইবনু আমর (রহঃ) ..... আবদুল্লাহ‌ মুযানী (রাঃ) থেকে বর্ণিত, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ বেদুঈনরা মাগরিবের সালাতের নামের ব্যাপারে তোমাদের উপর যেন প্রভাব বিস্তার না করে। রাবী [আবদুল্লাহ‌ মুযানী (রাঃ)] বলেন, বেদুঈনরা মাগরিবকে ইশা বলে থাকে। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩৭১।',
        name: ' ইশা ও আতামা এর বর্ণনা এবং যিনি এতে কোন আপত্তি করেন না। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'قَالَ أَبُو هُرَيْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَثْقَلُ الصَّلاَةِ عَلَى الْمُنَافِقِينَ الْعِشَاءُ وَالْفَجْرُ». وَقَالَ: «لَوْ يَعْلَمُونَ مَا فِي الْعَتَمَةِ وَالْفَجْرِ». قَالَ أَبُو عَبْدِ اللَّهِ وَالاِخْتِيَارُ أَنْ يَقُولَ الْعِشَاءُ لِقَوْلِهِ تَعَالَى: (وَمِنْ بَعْدِ صَلاَةِ الْعِشَاءِ). وَيُذْكَرُ عَنْ أَبِي مُوسَى قَالَ كُنَّا نَتَنَاوَبُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عِنْدَ صَلاَةِ الْعِشَاءِ فَأَعْتَمَ بِهَا. وَقَالَ ابْنُ عَبَّاسٍ وَعَائِشَةُ أَعْتَمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْعِشَاءِ. وَقَالَ بَعْضُهُمْ عَنْ عَائِشَةَ أَعْتَمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْعَتَمَةِ. وَقَالَ جَابِرٌ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي الْعِشَاءَ. وَقَالَ أَبُو بَرْزَةَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُؤَخِّرُ الْعِشَاءَ. وَقَالَ أَنَسٌ أَخَّرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْعِشَاءَ الآخِرَةَ. وَقَالَ ابْنُ عُمَرَ وَأَبُو أَيُّوبَ وَابْنُ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمْ صَلَّى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَغْرِبَ وَالْعِشَاءَ আবু হুরাইরা (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণনা করেছেন যে, মুনাফিকদের জন্য সবচে কষ্টকর সালাত হল ইশা ও ফজর। তিনি আরও বলেছেন যে, তারা যদি জানত, আতামা (ইশা) ও ফজরে কি কল্যান নিহিত আছে। ইমাম বুখারি (রহঃ) বলেন, ইশা শব্দ ব্যাবহার করাই উত্তম। কেননা আল্লাহ্‌ তায়ালা ইরশাদ করেনঃ (وَمِنْ بَعْدِ صَلاَةِ الْعِشَاءِ) আবু মুসা (রাঃ) থেকে বর্ণিত আছে যে, তিনি বলেন, আমরা পালাক্রমে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর এখানে ইশার সালাতের সময় যেতাম। একবার তিনি তা দেরি করে আদায় করেন। ইবন আব্বাস ও আয়িশা (রাঃ) (এরূপ) বর্ণনা করেন যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আতমা দেরি করে আদায় করেন। জাবির (রাঃ) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইশার সালাত আদায় করলেন। আবু বারযা (রাঃ) বলেন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইশার সালাত বিলম্বে আদায় করতেন। আনাস (রাঃ) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম শেষ ইশা বিলম্বে আদায় করলেন। ইবন উমর, আবু আইউব ও ইবন আব্বাস (রাঃ) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মাগরিব ও ইশার সালাত আদায় করেন। ৫৩৭। আবদান (রহঃ) .... আবদুল্লাহ (রাঃ) থেকে বর্ণিত, তিনি বলেন, এক রাতে রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের নিয়ে ইশার সালাত (নামায/নামাজ) আদায় করেন, যে সালাত (নামায/নামাজ)কে লোকেরা ‘আতামা’ বলে থাকে। তারপর তিনি ফিরে আমাদের দিকে মুখ করে বললেন, আজকের এ রাত সম্পর্কে তোমরা জানো কি? এ রাত থেকে নিয়ে একশ’ বছরের শেষ মাথায় আজ যারা ভূপৃষ্ঠে আছে তাদের কেউ অবশিষ্ট থাকবে না। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩৭২।  ',
        name: 'ইশার সালাতের ওয়াক্ত লোকজন জামায়েত হয়ে গেলে বা বিলম্বে এলে',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ৫৩৮। ',
            name:
                'মুসলিম ইবনু ইবরাহিম (রহঃ) .... মুহাম্মাদ ইবনু আমর ইবনু হাসান ইবনু আলী (রাঃ) থেকে বর্ণিত, তিনি বলেন, আমরা জাবির ইব‌ন আবদুল্লাহ (রাঃ)-কে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সালাত (নামায/নামাজ) সম্বন্ধে জিজ্ঞাসা করলাম। তিনি বললেন, মধ্যাহ্ন গড়ালেই নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যুহরের সালাত আদায় করতেন এবং সূর্য সতেজ থাকতেই আসর আদায় করতেন, আর সূর্য অস্ত গেলেই মাগরিব আদায় করতেন, আর লোক বেশী হয়ে গেলে ইশার সালাত তাড়াতাড়ি আদায় করতেন এবং লোক কম হলে দেরী করতেন, আর ফজরের সালাত অন্ধকার থাকতেই আদায় করতেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩৭৩। ',
        name: ' ইশার সালাতের ফযীলত ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ৫৩৯। ',
            name:
                'ইয়াহ্ইয়া ইবনু বুকাইর (রহঃ) .... আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেন, এক রাতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইশার সালাত (নামায/নামাজ) আদায় করতে বিলম্ব করলেন। এ হল ব্যাপকভাবে ইসলাম প্রসারের আগের কথা। (সালাতের জন্য) তিনি বেরিয়ে আসেননি, এমন কি উমর (রাঃ) বললেন, মহিলা ও শিশুরা ঘুমিয়ে পড়েছে। এরপর তিনি বেরিয়ে এলেন এবং মসজিদের লোকদের লক্ষ্য করে বললেনঃ তোমরা ব্যতীত যমীনের অধিবাসীদের কেউ ইশার সালাতের জন্য অপেক্ষায় নেই। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '৫৪০।  ',
            name:
                'মুহাম্মদ ইবনু আলা (রহঃ) ..... আবূ মূসা (রাঃ) থেকে বর্ণিত, তিনি বলেন, আমি ও আমার সঙ্গীরা-যারা (আবিসিনিয়া থেকে) জাহাজ যোগে আমার সঙ্গে প্রত্যাবর্তন করেছিলেন- বাকী’য়ে বুতহানের একটি মুক্ত এলাকায় বসবাসরত ছিলাম। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থাকতেন মদিনায়। বুতহানের অধিবাসীরা পালাক্রমে একদল করে প্রতি রাতে এশার সালাতের সময় রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর খিদমতে আসতেন। পালাক্রমে ইশার সালাতের সময় আমি ও আমার কতিপয় সঙ্গী নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে হাযির হলাম। তখন তিনি কোন কাজে খুব ব্যস্ত ছিলেন, ফলে সালাত (নামায/নামাজ) আদায়ে বিলম্ব করলেন। এমন কি রাত অর্ধেক হয়ে গেল। তারপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বেরিয়ে এলেন এবং সবাইকে নিয়ে সালাত আদায় করলেন। সালাত শেষে তিনি উপস্থিত ব্যাক্তিদেরকে বললেনঃ প্রত্যেকেই নিজ নিজ স্থানে বসে যাও। তোমাদের সুসংবাদ দিচ্ছি যে, আল্লাহর পক্ষ থেকে তোমাদের জন্য এটি এক নিয়ামত যে, তোমরা ব্যতীত মানুষের মধ্যে কেউ এ মুহূর্তে সালাত আদায় করছে না। কিংবা তিনি বলেছিলেনঃ তোমরা ব্যতীত কোন উম্মাত এ সময় সালাত আদায় করেনি। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কোন বাক্যটি বলেছিলেন বর্ণনাকারী তা নিশ্চিত করে বলতে পারেননি। আবূ মূসা (রাঃ) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর এ কথা শুনে আমরা অত্যন্ত আনন্দিত মনে বাড়ী ফিরলাম। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩৭৪। ',
        name: '  ইশার সালাতের আগে ঘুমানো মাকরূহ।',
        hadisNumberList: [
          HadisNumberModel(
            id: '৫৪১।  ',
            name:
                'মুহাম্মদ ইবনু সালাম (রহঃ) .... আবূ বারযা (রাঃ) থেকে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইশার পূর্বে নিদ্রা যাওয়া এবং পরে কথাবার্তা বলা অপছন্দ করতেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩৭৫। ',
        name: ' ঘুম প্রবল হলে ইশার আগে ঘুমানো। ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৫৪২।  ',
            name:
                'আয়্যূব ইবনু সুলাইমান (রহঃ) .... আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেন, একদা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইশার সালাত (নামায/নামাজ) আদায় করতে দেরী করলেন। উমর (রাঃ) তাঁকে বললেন, আস-সালাত। নারী ও শিশুরা ঘুমিয়ে পড়েছে। তারপর তিনি বেরিয়ে আসলেন এবং বললেনঃ তোমরা ব্যতীত পৃথিবীর আর কেউ এ সালাতের জন্য অপেক্ষা করছে না। (রাবী বলেন) তখন মদিনা ব্যতীত অন্য কোথাও সালাত আদায় করা হত না। (তিনি আরও বলেন যে) পশ্চিম আকাশের ‘শাফাক’ অন্তর্হিত হওয়ার পর থেকে রাতের প্রথম এক-তৃতীয়াংশের মধ্যে তাঁরা ইশার সালাত আদায় করতেন। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '৫৪৩।  ',
            name:
                'মাহমূদ (রহঃ) .... আবদুল্লাহ্ ইবনু উমর (রাঃ) থেকে বর্ণিত যে, এক রাতে কর্মব্যস্ততার কারণে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইশার সালাত (নামায/নামাজ) আদায়ে দেরী করলেন, এমন কি আমরা মসজিদে ঘুমিয়ে পড়লাম। তারপর জেগে উঠে আবার ঘুমিয়ে পড়লাম। এরপর আবার জেগে উঠলাম। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের কাছে এলেন, তারপর বললেনঃ তোমরা ব্যতীত পৃথিবীর আর কেউ এ সালাতের জন্য অপেক্ষা করছে না। ঘুম প্রবল হওয়ার কারণে এশার সালাত (নামায/নামাজ) বিনষ্ট হওয়ার আশংকা না থাকলে ইবনু উমর (রাঃ) তা আগেভাগে বা বিলম্ব করে আদায় করতে দ্বিধা করতেন না। কখনও কখনও তিনি ইশার আগে নিদ্রাও যেতেন। ইবনু জুরাইজ (রহঃ) বলেন, এ বিষয়ে আমি আতা (রহঃ)-কে জিজ্ঞাসা করলাম। তিনি বললেন, আমি ইবনু আব্বাস (রাঃ)-কে বলতে শুনেছি যে, এক রাতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইশার সালাত আদায় করতে দেরী করেছিলেন, এমন কি লোকজন একবার ঘুমিয়ে জেগে উঠল, আবার ঘুমিয়ে পড়ে জাগ্রত হল। তখন উমর ইবনু খাত্তাব (রাঃ) উঠে গিয়ে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বললেন, ‘আস-সালাত’। আতা (রহঃ) বলেন যে, ইবনু আব্বাস (রাঃ) বর্ণনা করেছেন, তারপর আল্লাহর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বেরিয়ে এলেন-যেন এখনো আমি তাঁকে দেখছি- তাঁর মাথা থেকে পানি টপকে পড়ছিল এবং তাঁর হাত মাথার উপর ছিল। তিনি এসে বললেনঃ যদি আমার উম্মাতের জন্য কষ্টকর হবে বলে মনে না করতাম, তাহলে তাদেরকে এভাবে (বিলম্ব করে) ইশার সালাত আদায় করার নির্দেশ দিতাম। ইবনু জুরাইজ (রহঃ) বলেন, ইবনু আব্বাস (রাঃ) এর বর্ণনা অনুযায়ী রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যে মাথায় হাত রেখেছিলেন তা কিভাবে রেখেছিলেন, বিষয়টি সুস্পষ্ট করে ব্যাখ্যা করার জন্য আতা (রহঃ)-কে বললাম। আতা (রহঃ) তাঁর আঙ্গুলগুলো সামান্য ফাঁকা করলেন, তারপর সেগুলোর অগ্রভাগ সম্মুখ দিক থেকে (চুলের অভ্যন্তরে) প্রবেশ করালেন। তারপর আঙ্গুলীগুলো একত্রিত করে মাথার উপর দিয়ে এভাবে টেনে নিলেন যে, তার বৃদ্ধাঙ্গুলী কানের সে পার্শ্বকে স্পর্শ করে গেল যা মুখমন্ডল সংলগ্ন চোয়ালের হাড্ডির উপর শ্মশ্রুর পাশে অবস্থিত। তিনি (নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) চুলের পানি ঝরাতে কিংবা চুল চাপড়াতে এরূপই করতেন। এবং তিনি বলেছিলেনঃ যদি আমার উম্মাতের জন্য কষ্টকর হবে বলে মনে না করতাম, তাহলে তাদেরকে এভাবেই (বিলম্ব করে) সালাত আদায় করার নির্দেশ দিতাম। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩৭৬।',
        name: ' রাতের অর্ধাংশ পর্যন্ত ইশার ওয়াক্ত।',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'وَقَالَ أَبُو بَرْزَةَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْتَحِبُّ تَأْخِيرَهَا আবু বারযা (রাঃ) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইশার সালাত দেরীতে আদায় করা পছন্দ করতেন। ৫৪৪। আবদুর রহীম মুহারিবী (রহঃ) .... আনাস (রাঃ) থেকে বর্ণিত, তিনি বলেন, একরাতে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইশার সালাত (নামায/নামাজ) অর্ধেক রাত পর্যন্ত বিলম্ব করলেন। তারপর সালাত আদায় করে তিনি বললেনঃ লোকেরা নিশ্চয়ই সালাত আদায় করে ঘুমিয়ে পড়েছে। শোন! তোমরা যতক্ষণ সালাতের অপেক্ষায় ছিলে ততক্ষণ তোমরা সালাতেই ছিলে। ইবনু আবূ মারইয়াম (রহঃ)-এর বর্ণনায় আরও আছে, তিনি বলেন, ইয়াহ্ইয়া ইবনু আইউব (রহঃ) হুমাইদ (রহঃ) থেকে বর্ণনা করেছেন যে, তিনি (হুমাইদ) আনাস (রাঃ)-কে বলতে শুনেছেন, সে রাতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর আংটির উজ্জলতা আমি যেন এখনও দেখতে পাচ্ছি। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩৭৭। ',
        name: ' ফজরের সালাতের ফযীলত ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৫৪৫।  ',
            name:
                'মূসা’দ্দাদ (রহঃ) .... জারীর ইবনু আবদুল্লাহ্ (রাঃ) থেকে বর্ণিত, তিনি বলেন, এক রাতে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট ছিলাম। হঠাৎ তিনি পূর্ণিমা রাতের চাঁদের দিকে তাকিয়ে বললেন, শোন! এটি যেমন দেখতে পাচ্ছ– তোমাদের প্রতিপালককেও তোমরা তেমনি দেখতে পাবে। তাঁকে দেখতে তোমরা ভিড়ের সম্মুখীন হবে না। কাজেই তোমরা যদি সূর্য উঠার আগের সালাত (নামায/নামাজ) ও সূর্য ডুবার আগের সালাত আদায়ে সমর্থ হও, তাহলে তাই কর। তারপর তিনি এ আয়াত তিলাওয়াত করলেনঃ “সূর্যোদয় ও সূর্যাস্তের পূর্বে আপনি আপনার প্রতিপালকের প্রশংসার তাসবীহ্ পাঠ করুন।” (৫০ঃ ৩৯)। আবূ আবদুল্লাহ্ (ইমাম বুখারী (রহঃ) বলেন, ইবনু শিহাব (রহঃ) জারীর (রাঃ) থেকে আরো বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা তোমাদের প্রতিপালককে খালি চোখে দেখতে পাবে। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '৫৪৬। ',
            name:
                '  হুদবা ইবনু খালিদ (রহঃ) ..... আবূ বকর ইবনু আবূ মূসা (রহঃ) থেকে তাঁর পিতার সূত্রে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যাক্তি দুই শীতের (ফজর ও আসরের) সালাত (নামায/নামাজ) আদায় করবে, সে জান্নাতে দাখিল হবে। ইবনু রাজা (রহঃ) বলেন, হাম্মাম (রহঃ) আবূ জামরা (রহঃ) থেকে বর্ণনা করেন যে, আবূ বক্‌র ইবনু আবদুল্লাহ ইবনু কায়স (রহঃ) তাঁর নিকট এ হাদীস বর্ণনা করেছেন।',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ৫৪৭।',
            name:
                ' ইসহাক (রহঃ) ..... আবু বকর ইবনু আবদুল্লাহ (রহঃ) তাঁর পিতার সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে অনুরূপ বর্ণনা করেছেন। [দেখুন হাদিস নম্বরঃ ৫৪৬] ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩৭৮। ',
        name: 'ফজরের ওয়াক্ত ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৫৪৮। ',
            name:
                '  আমর ইবনু আসিম (রহঃ) ..... যায়িদ ইবনু সাবিত (রাঃ) থেকে বর্ণিত, তিনি বলেন, তাঁরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে সাহরী খেয়েছেন, তারপর ফজরের সালাতে দাঁড়িয়েছেন। আনাস (রাঃ) বলেন, আমি জিজ্ঞাসা করলাম, এ দু’য়ের মাঝে কতটুকু সময়ের ব্যবধান ছিল? তিনি বললেন, পঞ্চাশ বা ষাট আয়াত তিলাওয়াত করা যায়, এরূপ সময়ের ব্যবধান ছিল।',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ৫৪৯।',
            name:
                '  হাসান ইবনু সাব্বাহ্ (রহঃ) .... আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত, আল্লাহর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও যায়িদ ইবনু সাবিত (রাঃ) একসাথে সাহরী খাচ্ছিলেন, যখন তাঁদের খাওয়া হয়ে গেল– আল্লাহর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (ফজরের) সালাতে দাঁড়িয়ে গেলেন এবং সালাত (নামায/নামাজ) আদায় করলেন। কাতাদা (রহঃ) বলেন, আমরা আনাস (রাঃ)-কে জিজ্ঞাসা করলাম, তাঁদের সাহরী খাওয়া থেকে অবসর হয়ে সালাত শুরু করার মধ্যে কতটুকু সময়ের ব্যবধান ছিল? তিনি বললেন, একজন লোক পঞ্চাশ আয়াত তিলাওয়াত করতে পারে এতটুকু সময়।',
            ref: '',
          ),
          HadisNumberModel(
            id: '৫৫০।  ',
            name:
                ' ইসমায়ীল ইবনু আবূ উওয়াইস (রহঃ) .... সাহল ইবনু সা’দ (রাঃ) থেকে বর্ণিত, তিনি বলেন, আমি আমার পরিবার-পরিজনের সাথে সাহরী খেতাম। খাওয়ার পরে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে ফজরের সালাত (নামায/নামাজ) পাওয়ার জন্য আমাকে খুব তাড়াহুড়া করতে হত।',
            ref: '',
          ),
          HadisNumberModel(
            id: '৫৫১। ',
            name:
                '  ইয়াহ্ইয়া ইবনু বুকাইর (রহঃ) ..... আয়িশা (রাঃ) থেকে বর্ণিত তিনি বলেন, মুসলিম মহিলাগণ সর্বাঙ্গ চাদরে ঢেকে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে ফজরের জামা’আতে হাযির হতেন। তারপর সালাত (নামায/নামাজ) আদায় করে তারা যার যার ঘরে ফিরে যেতেন। আবছা আঁধারে কেউ তাঁদের চিনতে পারত না।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩৭৯। ',
        name: ' যে ব্যাক্তি ফজরের এক রাকআত পেল। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ৫৫২।',
            name:
                '  আবদুল্লাহ্ ইবনু মাসলামা (রহঃ) .... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যাক্তি সূর্য উঠার আগে ফজরের সালাতের এক রাকআত পায়, সে ফজরের সালাত (নামায/নামাজ) পেল। আর যে ব্যাক্তি সূর্য ডুবার আগে আসরের সালাতের এক রাকাআত পেল সে আসরের সালাত পেল।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩৮০। ',
        name: ' যে ব্যাক্তি সালাতের এক রাকআত পেল। ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৫৫৩।  ',
            name:
                'আবদুল্লাহ ইবনু ইউসুফ (রহঃ) .... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ যে ব্যাক্তি কোন সালাতের এক রাকআত পায়, সে সালাত (নামায/নামাজ) পেল। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩৮১। ',
        name: ' ফজরের পর সূর্য উঠার আগে সালাত আদায়। ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৫৫৪।  ',
            name:
                'হাফস ইবনু উমর (রহঃ) ... ইবনু আব্বাস (রাঃ) থেকে বর্ণিত, তিনি বলেন, কয়েকজন আস্থাভাজন ব্যাক্তি আমার কাছে – যাঁদের মধ্যে শ্রেষ্ঠ হলেন উমর (রাঃ) আমাকে বলেছেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফজরের পর সূর্য উজ্জ্বল হয়ে না উঠা পর্যন্ত এবং আসরের পর সূর্য অস্তমিত না হওয়া পর্যন্ত সালাত (নামায/নামাজ) আদায় করতে নিষেধ করেছেন। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '৫৫৫। ',
            name:
                '  মুসাদ্দাদ (রহঃ) .... ইবনু আব্বাস (রাঃ) থেকে বর্ণিত, তিনি বলেন, আমার নিকট কয়েক ব্যাক্তি এরূপ বর্ণনা করেছেন।',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ৫৫৬।',
            name:
                ' মুসাদ্দাদ (রহঃ) .... ইবনু উমর (রাঃ) থেকে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা সূর্যোদয় ও সূর্যাস্তের সময় সালাত (নামায/নামাজ) আদায়ের ইচ্ছা করো না। উরওয়া (রহঃ) বলেন, ইবনু উমর (রাঃ) আমাকে আরও বলেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যদি সূর্যের একাংশ প্রকাশ পেয়ে যায়, তাহলে পূর্ণরূপে উদিত না হওয়া পর্যন্ত সালাত আদায়ে বিলম্ব করো। আর যদি তার একাংশ ডুবে যায় তাহলে সম্পূর্ণরূপে অস্তমিত না হওয়া পর্যন্ত সালাত আদায়ে বিলম্ব করো। আবদাও অনুরূপ বর্ণনা করেছেন। ',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ৫৫৭।  ',
            name:
                'উবায়দ ইবনু ইসমায়ীল (রহঃ) .... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দু’ধরণের বেচা-কেনা করতে, দু’ভাবে পোষাক পরিধান করতে এবং দু’সময়ে সালাত (নামায/নামাজ) আদায় করতে নিষেধ করেছেন। ফজরের পর সূর্য পূর্ণরূপে উদিত না হওয়া পর্যন্ত এবং আসরের পর সূর্য অস্তমিত না হওয়া পর্যন্ত তিনি কোন সালাত আদায় করতে নিষেধ করেছেন। আর পুরো শরীর জড়িয়ে কাপড় পরতে এবং এক কাপড়ে (যেমন লুঙ্গি ইত্যাদি পরে) হাঁটু খাড়া করে এমনভাবে বসতে যাতে লজ্জাস্থান উপরের দিকে খুলে যায় – নিষেধ করেছেন। আর মুনাবাযা* ও মুলামাসা* (এর পন্থায় বেচা-কেনা) নিষেধ করেছেন। *মুনাবাযাঃ বিভিন্ন দরের একাধিক পণ্যদ্রব্য একস্থানে রেখে মূল্য হিসেবে একটি অংক নির্ধারণ করে এ শর্তে বিক্রি করা যে, ক্রেতা নির্দিষ্ট পরিমাণ দূরত্ব থেকে পাথর নিক্ষেপ করে যে পণ্যের গায়ে লাগাতে পারবে, উল্লেখিত মূল্যে তাকে তা বাধ্যতামূলকভাবে গ্রহণ করতে হবে। এ পন্থার বেচা-কেনা “মুনাবাযা” বলে অভিহিত। *মুলাসামাঃ একাধিক পণ্যের প্রত্যেকটির ভিন্ন ভিন্ন ভাবে মূল্য নির্ধারণ করে এভাবে বিক্রি করা যে, ক্রেতা যেটি স্পর্শ করবে, পূর্ব নির্ধারিত মূল্যে তাকে অবশ্যই তা গ্রহণ করতে হবে। এ ধরনের বেচাকেনা শরয়ী পরিভাষায় ‘মুলামাসা’ বলে অভিহিত। যেহেতু এতে পছন্দ অপছন্দের স্বাধীনতা থাকে না, তাই শরীয়াত এ দু’টো পন্থাকে নিষিদ্ধ করেছে।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩৮২। ',
        name: ' সূর্যাস্তের পূর্ব মুহূর্তে সালাত আদায়ের উদ্যোগ নিবে না। ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৫৫৮।  ',
            name:
                'আবদুল্লাহ‌ ইবনু ইউসুফ (রহঃ) ..... ইবনু উমর (রাঃ) থেকে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের কেউ যেন সূর্যোদয় ও সূর্যাস্তের সময় সালাত (নামায/নামাজ) আদায়ের উদ্যোগ না নেয়। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '৫৫৯। ',
            name:
                ' আবদুল আযীয ইবনু আবদুল্লাহ‌ (রহঃ) ..... আবূ সায়ীদ খুদ্‌রী (রাঃ) থেকে বর্ণিত, তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি যে, ফজরের পর সূর্য উদিত হয়ে (একটু) উপরে না উঠা পর্যন্ত এবং আসরের পর সূর্য অস্তমিত না হওয়া পর্যন্ত কোন সালাত (নামায/নামাজ) নেই। ',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ৫৬০ ',
            name:
                '। মুহাম্মদ ইবনু আবান (রহঃ) .... মু’আবিয়া (রাঃ) থেকে বর্ণিত, তিনি বলেন, তোমরা এমন এক সালাত (নামায/নামাজ) আদায় করে থাক - রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাহচর্য লাভ সত্ত্বেও আমরা তাঁকে কখনও তা আদায় করতে দেখিনি। বরং তিনি তা থেকে নিষেধ করেছেন। অর্থাৎ আসরের পর দু’রাকাআত আদায় করতে।',
            ref: '',
          ),
          HadisNumberModel(
            id: '৫৬১। ',
            name:
                '  মুহাম্মদ ইবনু সালাম (রহঃ) ..... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দু’ সময়ে সালাত (নামায/নামাজ) আদায় করতে নিষেধ করেছেন। ফজরের পর সূর্য উদিত হওয়া পর্যন্ত এবং আসরের পর সূর্য অস্ত যাওয়া পর্যন্ত।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩৮৩।',
        name:
            ' যিনি আসরের ও ফজরের পর ব্যাতিত অন্য সাময়ে সালাত আদায় মাকরূহ মনে করেন না। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'رَوَاهُ عُمَرُ وَابْنُ عُمَرَ وَأَبُو سَعِيدٍ وَأَبُو هُرَيْرَةَ উমর, ইবন উমর, আবু সাইদ ও আবু হুরাইরা (রাঃ) এ হাদিস বর্ণনা করেছেন। ৫৬২। আবূ নু’মান (রহঃ) ...... ইবনু উমর (রাঃ) থেকে বর্ণিত, তিনি বলেন, আমি আমার সঙ্গীদের যেভাবে সালাত (নামায/নামাজ) আদায় করতে দেখেছি সেভাবেই আমি সালাত আদায় করি। সূর্যোদয় ও সূর্যাস্তের সময়ে সালাতের ইচ্ছা করা ব্যতীত রাতে বা দিনে যে কোন সময় কেউ সালাত আদায় করতে চাইলে আমি নিষেধ করি না। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩৮৪।',
        name: '  আসরের পর কাযা বা অনুরূপ কোন সালাত আদায় করা।',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ৫৬৩।',
            name:
                ' আবূ নু’আইম (রহঃ)......... আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেন, সে মাহান সত্তার শপথ, যিনি তাঁকে (নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম - কে) উঠিয়ে নিয়েছেন, আল্লাহর সান্নিধ্যে যাওয়ার পূর্ব পর্যন্ত তিনি দু’রাকাআত সালাত (নামায/নামাজ) কখনই ছাড়েননি। আর সালাত (নামায/নামাজ) দাঁড়ানো যখন তাঁর পক্ষে সম্ভব হয়নি, তখন তিনি আল্লাহর সান্নিধ্যে চলে গেছেন। তিনি তাঁর এ সালাত (নামায/নামাজ) অধিকাংশ সময় বসে বসেই আদায় করতেন। আয়িশা (রাঃ) এ সালাত (নামায/নামাজ) দ্বারা আসরের পরবর্তী দু’রাকাআতের কথা বুঝিয়েছেন। রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এ দু’রাকাআত সালাত (নামায/নামাজ) আদায় করতেন, তবে উম্মাতের উপর বোঝা হয়ে পড়ার আশংকায় তা মসজিদে আদায় করতেন না। কেননা, উম্মাতের জন্য যা সহজ হয় তাই তাঁর কাম্য ছিল। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '৫৬৪। ',
            name:
                ' মুসাদ্দাদ (রহঃ) ...... আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেন, হে ভাগিনে! নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার কাছে উপস্থিত থাকার কালে আসরের পরবর্তী দু’রাকাআত কখনও ছাড়েননি। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '৫৬৫।  ',
            name:
                ' মূসা ইবনু ইসমায়ীল (রহঃ) .... আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেন, দু’রাকাআত সালাত (নামায/নামাজ) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম প্রকাশ্যে বা গোপনে কোন অবস্থাতেই ছাড়তেন না। তা হল ফজরের সালাতের আগের দু’রাকাআত ও আসরের পরের দু’রাকাআত।',
            ref: '',
          ),
          HadisNumberModel(
            id: '৫৬৬। ',
            name:
                ' মুহাম্মদ ইবনু আর’আরা (রহঃ) ..... আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যে দিনই আসরের পর আমার কাছে আসতেন সে দিনই দু’রাকাআত সালাত (নামায/নামাজ) আদায় করতেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩৮৫। ',
        name: ' মেঘলা দিনে শীগ্র সালাত আদায় করা ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৫৬৭।  ',
            name:
                'মু’আয ইবনু ফাযালা (রহঃ) ..... আবূ মালীহ্‌ (রহঃ) থেকে বর্ণিত, তিনি বলেন, এক মেঘলা দিনে আমরা বুরাইদা (রাঃ)-এর সঙ্গে ছিলাম। তিনি বললেন, শীঘ্র সালাত (নামায/নামাজ) আদায় করে নাও। কেননা, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যাক্তি আসরের সালাত (নামায/নামাজ) ছেড়ে দেয় তার সমস্ত আমল বিনষ্ট হয়ে যায়। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩৮৬। ',
        name: '  ওয়াক্ত চলে যাওয়ার পর আযান দেওয়া।',
        hadisNumberList: [
          HadisNumberModel(
            id: '৫৬৮।  ',
            name:
                'ইমরান ইবনু মাইসারা (রহঃ) .... আবূ কাতাদা (রাঃ) থেকে বর্ণিত, তিনি বলেন, এক রাতে আমরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে ছিলাম। যাত্রী দলের কেউ কেউ বললেন, ইয়া রাসুলাল্লাহ! রাতের এ শেষ প্রহরে আমাদের নিয়ে যদি একটু বিশ্রাম নিতেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ আমার ভয় হচ্ছে সালাতের সময়ও তোমরা ঘুমিয়ে থাকবে। বিলাল (রাঃ) বললেন, আমি আপনাদের জাগিয়ে দিব। কাজেই সবাই শুয়ে পড়লেন। এ দিকে বিলাল (রাঃ) তাঁর হাওদার গায়ে একটু হেলান দিয়ে বসলেন। এতে তাঁর দু’চোখ মুদে আসল। ফলে তিনি ঘুমিয়ে পড়লেন। সূর্য কেবল উঠতে শুরু করেছে, এমন সময় রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জাগ্রত হলেন এবং বিলাল (রাঃ)-কে ডেকে বললেন, হে বিলাল! তোমার কথা গেল কোথায়? বিলাল (রাঃ) বললেন, আমার এত অধিক ঘুম আর কখনও পায়নি। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ আল্লাহ তা’আলা যখন ইচ্ছা করেছেন তখন তোমাদের রূহ্‌ কব্‌য করে নিয়েছেন; আবার যখন ইচ্ছা করেছেন তখন তা তোমাদের ফিরিয়ে দিয়েছেন। হে বিলাল! উঠ, লোকদের জন্য সালাতের আযান দাও। তারপর তিনি উযূ (ওজু/অজু/অযু) করলেন এবং সূর্য যখন উপরে উঠল এবং উজ্জ্বল হল তখন তিনি দাঁড়ালেন এবং সালাত (নামায/নামাজ) আদায় করলেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩৮৭।',
        name: ' ওয়াক্ত চলে যাওয়ার পর লোকদের নিয়ে জামা\'আতে সালাত আদায় করা। ',
        hadisNumberList: [
          HadisNumberModel(
            id: '  ৫৬৯।',
            name:
                ' মু’আয ইবনু ফাযালা (রহঃ) ..... জাবির ইবনু আবদুল্লাহ্‌ (রাঃ) থেকে বর্ণিত যে, খন্দকের দিন সূর্য অস্ত যাওয়ার পর উমর ইবনু খাত্তাব (রাঃ) এসে কুরাইশ গোত্রীয় কাফিরদের ভর্ৎসনা করতে লাগলেন এবং বললেন, ইয়া রাসুলাল্লাহ! আমি এখনও আসরের সালাত (নামায/নামাজ) আদায় করতে পারিনি, এমন কি সূর্য অস্ত যায় যায়। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ আল্লাহর শপথ! আমিও তা আদায় করিনি। তারপর আমরা উঠে বুতহানের দিকে গেলাম। সেখানে তিনি সালাতের জন্য উযূ (ওজু/অজু/অযু) করলেন এবং আমরাও উযূ (ওজু/অজু/অযু) করলাম; এরপর সূর্য ডুবে গেলে আসরের সালাত আদায় করেন, তারপর মাগরিবের সালাত আদায় করেন।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩৮৮। ',
        name:
            ' কেউ যদি কোন ওয়াক্তের সালাত আদায় করতে ভুলে যায়, তাহলে যখন স্মরণ হবে, তখন সে তা আদায় করে নিবে। সে সালাত ব্যাতিত অন্য সালাত পুনরায় আদায় করতে হবে না। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'وَقَالَ إِبْرَاهِيمُ مَنْ تَرَكَ صَلاَةً وَاحِدَةً عِشْرِينَ سَنَةً لَمْ يُعِدْ إِلاَّ تِلْكَ الصَّلاَةَ الْوَاحِدَةَ ইবরাহীম (রহঃ) বলেন, কেউ যদি বিশ বছরও এক ওয়াক্তের সালাত ছেড়ে দিয়ে থাকে তা হলে তাকে সে ওয়াক্তের সালাতই পুনরায় আদায় করতে হবে। ৫৭০। আবূ নু’আইম ও মূসা ইবনু ইসমায়ীল (রহঃ) .... আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যদি কেউ কোন সালাতের কথা ভুলে যায়, তাহলে যখনই স্মরণ হবে, তখন তাকে তা আদায় করতে হবে। এ ব্যতীত সে সালাতের অন্য কোন কাফ্‌ফারা নেই। (কেননা, আল্লাহ তা’আলা ইরশাদ করেছেন)(‏وَأَقِمِ الصَّلاَةَ لِذِكْرِي‏) “আমাকে স্মরণের উদ্দেশ্যে সালাত কায়েম কর”। মূসা (রহঃ) বলেন, হাম্মাম (রহঃ) বলেছেন যে, আমি তাকে [কাতাদা (রহঃ)] পরে বলতে শুনেছি, “আমাকে স্মরণের উদ্দেশ্যে সালাত (নামায/নামাজ) কায়েম কর।” হাব্বান (রহঃ) আনাস (রাঃ) এর সূত্রে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে অনুরূপ হাদীস বর্ণিত আছে। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩৮৯।',
        name: '  একাধিক সালাতের কাযা ধারাবাহিকভাবে আদায় করা।',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ৫৭১।',
            name:
                ' মুসাদ্দাদ (রহঃ) .... জাবির (রাঃ) থেকে বর্ণিত, তিনি বলেন, খন্দকের যুদ্ধকালে এক সময় উমর (রাঃ) কুরাইশ কাফিরদের ভৎসনা করতে লাগলেন এবং বললেন, সূর্যাস্তের পূর্বে আমি আসরের সালাত (নামায/নামাজ) আদায় করতে পরিনি, (জাবির (রাঃ) বলেন) তারপর আমার বুতহান উপত্যকায় উপস্থিত হলাম। সেখানে তিনি সূর্যাস্তের পর সে সালাত আদায় করলেন, তারপরে মাগরিবের সালাত আদায় করলেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩৯০।',
        name: ' ইশার সালাতের পর গল্প গুজব করা মাকরূহ। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                '(পবিত্র কুরআনে উল্লেখিত) السَّامِرُ শব্দটি السَّمرِ ধাতু হতে নির্গত। এর বহুবচন السُّمَّارُ। এ আয়াতে سامر শব্দ বহুবচনরূপে ব্যবহৃত হয়েছে। ৫৭২। মুসাদ্দাদ (রহঃ) .... আবূ মিনহাল (রহঃ) থেকে বর্ণিত, তিনি বলেন, আমি আমার পিতার সঙ্গে আবূ বারযা আসলামী (রাঃ)-এর নিকট গেলাম। আমার পিতা তাঁকে জিজ্ঞাস করলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফরয সালাতসমূহ কোন সময় আদায় করতেন? তিনি বললেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যুহরের সালাত (নামায/নামাজ) যাকে তোমরা প্রথম সালাত বলে থাক, সূর্য ঢলে পড়লে আদায় করতেন। আর আসরের সালাত এমন সময় আদায় করতেন যে, আমাদের কেউ সূর্য সজীব থাকতেই মদিনার শেষ প্রান্তে নিজ পরিজনের কাছে ফিরে আসতে পারত। মাগরিব সম্পর্কে তিনি কি বলেছিলেন, তা আমি ভুলে গেছি। তারপর আবূ বারযা (রাঃ) বলেন, ইশার সালত একটু বিলম্বে আদায় করাকে তিনি পছন্দ করতেন। আর ইশার আগে ঘুমানো এবং পরে কথাবার্তা বলা তিনি অপছন্দ করতেন। আর এমন মুহূর্তে তিনি ফজরের সালাত শেষ করতেন যে, আমাদের যে কেউ তার পার্শ্ববর্তী ব্যাক্তিকে চিনতে পারত। এ সালাতে তিনি ষাট থেকে একশ’ আয়াত তিলাওয়াত করতেন। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩৯১।',
        name: '  ইশার পর জ্ঞানচর্চা ও কল্যাণকর বিষয়ের আলোচনা।',
        hadisNumberList: [
          HadisNumberModel(
            id: '৫৭৩। ',
            name:
                ' আবদুল্লাহ্‌ ইবনু সাব্বাহ্‌ (রহঃ) ..... কুর্‌রা ইবনু খালিদ (রহঃ) থকে বর্ণিত, তিনি বলেন, একদা আমরা হাসান বসরী (রহঃ) এর অপেক্ষায় ছিলাম। তিনি এত বিলম্বে আসলেন যে, নিয়মিত সালাত (নামায/নামাজ) শেষে চলে যাওয়ার সময় ঘনিয়ে আসল। এরপর তিনি এসে বললেন, আমাদের এ প্রতিবেশীগণ আমাদের ডেকেছিলেন। তারপর তিনি বললেন, আনাস ইবনু মালিক (রাঃ) বর্ণনা করেছেন, এক রাতে আমরা রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর অপেক্ষায় ছিলাম। এমন কি প্রায় অর্ধেক রাত হয়ে গেল, তখন এসে তিনি আমাদের নিয়ে সালাত আদায় করলেন। এরপর আমাদের সম্বোধন করে তিনি বললেনঃ জেনে রাখ! লোকেরা সালাত আদায় করে ঘুমিয়ে পড়েছে, তবে তোমরা যতক্ষন সালাতের অপেক্ষায় ছিলে ততক্ষন সালাতেই রত ছিলে। হাসান বসরী (রহঃ) বলেন, মানুষ যতক্ষন কল্যাণের অপেক্ষায় থাকে, ততক্ষন তারা কল্যাণেই রত থাকে। কুর্‌রা (রহঃ) বলেন, এ উক্তি আনাস (রাঃ) কর্তৃক বর্ণিত রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর হাদিসেরই অংশ। ',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ৫৭৪।',
            name:
                ' আবূল ইয়ামান (রহঃ) ..... আবদুল্লাহ্‌ ইবনু উমর (রাঃ) থকে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একবার তাঁর শেষ জীবনে ইশার সালাত (নামায/নামাজ) আদায় করে সালাম ফিরাবার পর বললেনঃ আজকের এ রাত সম্পর্কে তোমাদের অভিমত কি? আজ থেকে নিয়ে একশ’ বছরের মাথায় আজ যারা ভূ-পৃষ্ঠে আছে তাদের কেউ অবশিষ্ট থাকবে না। কিন্তু সাহাবীগণ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর ‘একশ’ বছরের’ এ উক্তি সম্পর্কে নানাবিধ জল্পনা-কল্পনা করতে থাকেন। প্রকৃতপক্ষে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আজকে যারা জীবিত আছে তাদের কেউ ভূ-পৃষ্ঠে থাকবে না। এর দ্বারা তিনি বুঝাতে চেয়েছেন যে, এ শতাব্দী ঐ যুগের পরিসমাপ্তি ঘটাবে। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩৯২।',
        name: ' পরিবার-পরিজন ও মেহমানদের সাথে রাতে কথাবার্তা বলা। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ৫৭৫।',
            name:
                '  মাহমূদ (রহঃ) .... আবদুর-রাহমান ইবনু আবূ বকর (রাঃ) থেকে বর্ণিত যে, আসহাবে সুফ্‌ফা ছিলেন খুবই দরিদ্র। (একদা) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ যার কাছে দু’জনের আহার আছে সে যেন (তাঁদের থেকে) তৃতীয় জনকে সঙ্গে করে নিয়ে যায়। আর যার কাছে চারজনের আহারের সংস্থান আছে, সে যেন পঞ্চম বা ষষ্ঠজন সঙ্গে নিয়ে যায়। আবূ বকর (রাঃ) তিনজন সাথে নিয়ে আসেন এবং রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দশজন নিয়ে আসেন। আবদুর রাহমান (রাঃ) বলেন, আমাদের ঘরে এবং আবূ বাকরের ঘরে আমি, আমার পিতা ও মাতা (এই তিন জন সদস্য) ছিলাম। রাবী বলেন, আমি জানিনা, তিনি আমার স্ত্রী এবং খাদিম একথা বলেছিলেন কি না? আবূ বাকর (রাঃ) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর ঘরেই রাতের আহার করেন এবং ইশার সালাত (নামায/নামাজ) পর্যন্ত সেখানে অবস্থান করেন। ইশার সালাতের পর তিনি আবার (রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর ঘরে) ফিরে আসেন এবং রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর রাতের আহার শেষ করা পর্যন্ত সেখানেই অবস্থান করেন। আল্লাহর ইচ্ছায় কিছু সময় অতিবাহিত হওয়ার পর বাড়ী ফিরলে তাঁর স্ত্রী তাঁকে বললেন, মেহমানদের কাছে আসতে কিসে আপনাকে ব্যস্ত রেখেছিল? কিংবা তিনি বলেছিলেন, (বর্ণনাকারীর সন্দেহ) মেহমান থেকে। আবূ বকর (রাঃ) বললেন, এখনও তাদের খাবার দাওনি? তিনি বললেন, আপনি না আসা পর্যন্ত তারা খেতে অস্বীকার করেন। তাদের সামনে হাযির করা হয়েছিল, তবে তারা খেতে সম্মত হননি। তিনি (রাগান্বিত হয়ে) বললেন, ওরে বোকা এবং ভর্ৎসনা করলেন। আর (মেহমানদের) বললেন, খেয়ে নিন। আপনারা অস্বস্তিতে ছিলেন। এরপর তিনি বললেন, আল্লাহর কসম! আমি এ কখনই খাব না। আবদুর রাহমান (রাঃ) বলেন, আল্লাহর কসম! আমরা লুক্‌মা উঠিয়ে নিতেই নীচ থেকে তা অধিক পরিমাণে বেড়ে যাচ্ছিল। তিনি বলেন, সকলেই পেট ভরে খেলেন। অথচ আগের চাইতে অধিক খাবার রয়ে গেল। আবূ বকর (রাঃ) খাবারের দিকে তাকিয়ে দেখেতে পেলেন তা আগের সমপরিমাণ কিংবা তার চাইতেও বেশী। তিনি তাঁর স্ত্রীকে বললেন, হে বনূ ফিরাসের বোন। এ কি? তিনি বললেন, আমার চোখের প্রশান্তির কসম! এতো এখন আগের চাইতে তিনগুন বেশী! আবূ বকর (রাঃ)-ও তা থেকে আহার করলেন এবং বললেন, আমার সে শপথ শয়তানের পক্ষ থেকেই হয়েছিল। এরপর তিনি আরও লুক্‌মা মুখে দিলেন এবং অবশিষ্ট খাবার নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকটে নিয়ে গেলেন। ভোর পর্যন্ত সে খাদ্য রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সেখানেই ছিল। এদিকে আমাদের ও অন্য একটি গোত্রের মাঝে সে সন্ধি ছিল তার সময়সীমা পূর্ন হয়ে যায়। (এবং তারা মদিনায় আসে) আমরা তাদের বারজনের নেতৃত্বে ভাগ করে দেই। তাদের প্রত্যকের সংগেই কিছু কিছু লোক ছিল। তবে প্রত্যকের সঙ্গে কতজন ছিল তা আল্লাহই জানেন। তারা সকলেই সেই খাদ্য থেকে আহার করেন। (রাবী বলেন) কিংবা আবদুর রাহমান (রাঃ) যেভাবে বর্ণনা করেছেন।',
            ref: '',
          ),
        ]),
  ];
  List<PorichedModel> chapterTen = [
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩৯৩। ',
        name: ' আযানের সূচনা। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'وَقَوْلُهُ عَزَّ وَجَلَّ: (وَإِذَا نَادَيْتُمْ إِلَى الصَّلاَةِ اتَّخَذُوهَا هُزُوًا وَلَعِبًا ذَلِكَ بِأَنَّهُمْ قَوْمٌ لاَ يَعْقِلُونَ) وَقَوْلُهُ: (إِذَا نُودِيَ لِلصَّلاَةِ مِنْ يَوْمِ الْجُمُعَةِ) আল্লাহ্‌ তায়ালার বাণীঃ যখন তোমরা সালাতের দিকে আহবান করো, তখন তারা (মুশরিকরা) এ নিয়ে ঠাট্রা-বিদ্রুপ ও কৌতুক করে। তা এ জন্য যে, তারা এমন এক সম্প্রদায় যারা উপলব্ধি করে না" (সুরা মায়েদাঃ ৫৮) আল্লাহ্‌ তায়ালা আরও ইরশাদ করেছেনঃ আর যখন জুমার দিনে সালাতের জন্য আহবান করা হয় .... (সুরা জুমু\'আঃ ৯) ৫৭৬। ইমরান ইবনু মাইসারা (রহঃ) ... আনাস (রাঃ) থেকে বর্ণিত, তিনি বলেন, (সালাতে সমবেত হওয়ার জন্য) সাহাবা-ই কিরাম (রাঃ) আগুন জ্বালানো অথবা নাকূস বাজানোর কথা আলোচনা করেন। আবার এগুলোকে (যথাক্রমে) ইয়াহূদী ও নাসারাদের প্রথা বলে উল্লেখ করা হয়। তারপর বেলাল (রাঃ) কে আযানের বাক্য দু’বার করে ও ইকামতের বাক্য বেজোড় করে বলার নির্দেশ দেওয়া হয়। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '৫৭৭।  ',
            name:
                'মাহমূদ ইবন গায়লান (রহঃ) ... নাফি (রহঃ) থেকে বর্ণিত, তিনি বলেন, ইবনু উমর (রাঃ) বলতেন যে, মুসলিমগন যখন মদিনায় আগমন করেন, তখন তাঁরা সালাতের সময় অনুমান করে সমবেত হতেন। এর জন্য কোন ঘোষণা দেওয়া হতো না। একদিন তাঁরা এ বিষয়ে আলোচনা করলেন। কয়েকজন সাহাবী বললেন, নাসারাদের ন্যায় নাকূস বাজানোর ব্যবস্থা করা হোক। আর কয়েকজন বললেন, ইয়াহূদীদের শিঙ্গার ন্যায় শিঙ্গা ফোকানোর ব্যবস্থা করা হোক। উমর (রাঃ) বললেন, সালাতের ঘোষণা দেওয়ার জন্য তোমরা কি একজন লোক পাঠাতে পার না? তখন রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ হে বেলাল, উঠ এবং সালাত (নামায/নামাজ)-এর জন্য ঘোষণা দাও। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩৯৪।  ',
        name: 'দু\' দু\'বার আযানের শব্দ বলা। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ৫৭৮। ',
            name:
                ' সুলাইমান ইব্‌ন হারব্‌ (রহঃ) ... আনাস (রাঃ) থেকে বর্ণিত, তিনি বলেন, বিলাল (রাঃ) কে আযানের শব্দ দু’বার এবং قد قامت الصلاة ব্যতীত ইকামাতের শব্দগুলো বেজোড় করে বলার নির্দেশ দেওয়া হয়েছিল।',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ৫৭৯।',
            name:
                ' মুহাম্মদ (রহঃ) ... আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত, তিনি বলেন, মুসলিমগণের সংখ্যা বৃদ্ধি পেলে তাঁরা সালাতের সময়ের জন্য এমন কোন সংকেত নির্ধারণ করার প্রস্তাব দিলেন, যার সাহায্যে সালাত (নামায/নামাজ)-এর সময় উপস্থিত এ কথা বুঝা যায়। কেউ কেউ বললেন, আগুন জ্বালানো হোক, কিংবা ঘণ্টা বাজানো হোক। তখন বিলাল (রাঃ)-কে আযানের শব্দগুলো দু দু’বার এবং ইকামতের শব্দগুলো বেজোড় বলার নির্দেশ দেওয়া হল। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩৯৫। ',
        name: ' কাদ কামাতিস - সালাতু ব্যাতিতি ইকামাতের শব্দগুলো একবার করে বলা।',
        hadisNumberList: [
          HadisNumberModel(
            id: '৫৮০।  ',
            name:
                'আলী ইবনু আবদুল্লাহ‌ (রহঃ) .... আনাস (রাঃ) থেকে বর্ণিত, তিনি বলেন, বিলাল (রাঃ)-কে আযানের বাক্যগুলো দু’ দু’বার এবং ইকামতের শব্দগুলো বেজোড় বলার নির্দেশ দেওয়া হল। ইসমায়ীল (রহঃ) বলেন, আমি এ হাদীস আইয়্যূবের নিকট বর্ণনা করলে তিনি বলেন, তবে ‘কাদ্‌কামাতিস্‌ সালাত’ ব্যতীত। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩৯৬।',
        name: '  আযানের ফযীলত।',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ৫৮১।',
            name:
                ' আবদুল্লাহ‌ ইবনু ইউসুফ (রহঃ) .... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যখন সালাতের জন্য আযান দেওয়া হয়, তখন শয়তান হাওয়া ছেড়ে পলায়ণ করে, যাতে সে আযানের শব্দ না শোনে। যখন আযান শেষ হয়ে যায়, তখন সে আবার ফিরে আসে। আবার যখন সালাতের জন্য ইকামত বলা হয়, তখন আবার দূরে সরে যায়। ইকামত শেষ হলে সে পুনরায় ফিরে এসে লোকের মনে কুমন্ত্রণা দেয় এবং বলে এটা স্মরণ কর, ওটা স্মরণ কর, বিস্মৃত বিষয়গুলো সে স্মরণ করিয়ে দেয়। এভাবে লোকটি এমন পর্যায়ে পৌছে যে, সে কয় রাকাআত সালাত (নামায/নামাজ) আদায় করেছে তা মনে করতে পারে না। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩৯৭। ',
        name: ' আযানের স্বর উচ্চ করা। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                ' وَقَالَ عُمَرُ بْنُ عَبْدِ الْعَزِيزِ أَذِّنْ أَذَانًا سَمْحًا وَإِلاَّ فَاعْتَزِلْنَا উমর ইবন আবদুল আযিয (রহঃ) (মুয়াজ্জিনকে) বলতেন, স্বাভাবিক কণ্ঠে সাদাসিধাভাবে আযান দাও, নতুবা এ পদ ছেড়ে দাও। ৫৮২। আবদুল্লাহ‌ ইবনু ইউসুফ (রহঃ) ... আবদুল্লাহ‌ ইবনু আবদুর রহমান আনসারী মাযিনী (রহঃ) থেকে বর্ণিত, যে আবূ সায়ীদ খুদ্‌রী (রাঃ) তাঁকে বললেন, আমি দেখছি তুমি বক্‌রী চরানো এবং বন-জঙ্গলকে ভালবাস। তাই তুমি যখন বক্‌রী নিয়ে থাক, বা বন-জঙ্গলে থাক এবং সালাত (নামায/নামাজ)-এর জন্য আযান দাও, তখন উচ্চকণ্ঠে আযান দাও। কেননা, জ্বীন, ইনসান বা যে কোন বস্তুই যতদূর পর্যন্ত মুয়াযযিনের আওয়াজ শুনবে, সে কিয়ামতের দিন তার পক্ষে সাক্ষ্য দিবে। আবূ সায়ীদ (রাঃ) বলেন, একথা আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে শুনেছি।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৩৯৮। ',
        name: ' আযানের কারণে রক্তপাত থেকে নিরাপত্তা পাওয়া। ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৫৮৩।  ',
            name:
                'কুতাইবা ইবনু সায়ীদ (রহঃ) ... আনাস (রাঃ) থেকে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখনই আমাদের নিয়ে কোন গোত্রের বিরুদ্ধে যুদ্ধ করতে যেতেন, ভোর না হওয়া পর্যন্ত অভিযান পরিচালনা করতেন না বরং লক্ষ্য রাখতেন, যদি তিনি তখন আযান শুনতে পেতেন, তাহলে তাদের বিরুদ্ধে অভিযান পরিচালনা করা থেকে বিরত থাকতেন। আর যদি আযান শুনতে না পেতেন, তাহলে অভিযান চালাতেন। আনাস (রাঃ) বলেন, আমরা খায়বারের উদ্দেশ্যে রওয়ানা হলাম এবং রাতের বেলায় তাদের সেখানে পৌছলাম। যখন প্রভাত হল এবং তিনি আযান শুনতে পেলেন না; তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সাওয়ার হলেন। আমি আবূ তালহা (রাঃ)-এর পিছনে সাওয়ার হলাম। আমার পা, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কদম মুবারকের সাথে লেগে যাচ্ছিল। আনাস (রাঃ) বলেন, তারা তাদের থলে ও কোদাল নিয়ে বেরিয়ে আমাদের দিকে আসল। হঠাৎ তারা যখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে দেখতে পেল, তখন বলে উঠল, ‘এ যে মুহাম্মদ, আল্লাহর শপথ! মুহাম্মদ তাঁর পঞ্চ বাহিনী সহ!’ আনাস (রাঃ) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের দেখে বলে উঠলেনঃ ‘আল্লাহু আকবর, আল্লাহু আকবর, খায়বার ধ্বংস হোক। আমরা যখন কোন কাওমের আঙ্গিনায় অবতরণ করি, তখন সতর্কীকৃতদের প্রভাত হবে কত মন্দ!’ ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৩৯৯। ',
        name: 'মুয়াজ্জিনের আযান শুনলে যা বলতে হয়। ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৫৮৪। ',
            name:
                ' আব্দুল্লহাহ্‌ ইবনু ইউসুফ (রহঃ) ... আবূ সায়ীদ খুদরী (রাঃ) থেকে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যখন তোমরা আযান শুনতে পাও তখন মুয়ায্‌যিন যা বলে তোমরাও তার অনুরূপ বলবে। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '  ৫৮৫।',
            name:
                ' মু’আয ইবনু ফাযালা (রহঃ) ... ঈসা ইবনু তালহা (রাঃ) থেকে বর্ণিত, একদিন তিনি মু’আবিয়া (রাঃ)-কে (আযানের জবাব দিতে) শুনেছেন যে, তিনি ‘আশ্‌হাদু আন্না মুহাম্মাদার রাসূলুল্লাহ’ পর্যন্ত মুয়ায্‌যিনের অনুরূপ বলেছেন।',
            ref: '',
          ),
          HadisNumberModel(
            id: '৫৮৬।  ',
            name:
                ' ইসহাক ইবনু রাহওয়াই (রহঃ) ... ইয়াহ্‌ইয়া (রহঃ) থেকে অনুরূপ বর্ণিত আছে। ইয়াহ্‌ইয়া (রহঃ) বলেছেনঃ আমার কোন ভাই আমার নিকট বর্ণনা করেছেন যে, মুয়ায্‌যিন যখনحَىَّ عَلَى الصَّلاَةِ‏ বলল, তখন তিনি [মু’আবিয়া (রাঃ)]لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ বললেন। তারপর তিনি বললেন, তোমাদের নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে আমরা এরূপ বলতে শুনেছি।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: 'পরিচ্ছেদঃ ৪০০।  ',
        name: ' আযানের দু\'আ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৫৮৭। ',
            name:
                ' আলী ইবনু আইয়্যাশ (রহঃ) ... জাবির ইবনু আবদুল্লাহ‌ (রাঃ) থেকে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যাক্তি আযান শুনে দু’আ করেঃ ‘হে আল্লাহ-এ পরিপূর্ণ আহবান ও সালাতের প্রতিষ্ঠিত মালিক, মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে ওয়াসীলা ও সর্বোচ্চ মর্যাদার অধিকারী করুন এবং তাঁকে সে মাকেমে মাহমূদে পৌছিয়ে দিন যার অঙ্গিকার আপনি করেছেন’- কিয়ামতের দিন সে আমার শাফা’আত লাভের অধিকারী হবে। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৪০১।',
        name: '  আযানের ব্যাপারে কুরআহর মাধ্যমে নির্বাচন।',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'وَيُذْكَرُ أَنَّ أَقْوَامًا اخْتَلَفُوا فِي الأَذَانِ فَأَقْرَعَ بَيْنَهُمْ سَعْدٌ উল্লেখ করা হয়েছে যে, একদল লোক আযান দেয়ার ব্যাপারে প্রতিযোগিতা করল। সা\'দ (রাঃ) তাদের মধ্যে কুরআহর মাধ্যমে নির্বাচন করলেন। ৫৮৮। আবদুল্লাহ‌ ইবনু ইউসুফ (রহঃ) ... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আযানে ও প্রথম কাতারে কী (ফযীলত) রয়েছে, তা যদি লোকেরা জানত, কুরআহর মাধ্যমে নির্বাচন ব্যতীত এ সুযোগ লাভ করা যদি সম্ভব না হত, তাহলে অবশ্যই তারা কুরআহর মাধ্যমে সিদ্ধান্ত নিত। যুহরে সালাত (নামায/নামাজ) আউয়াল ওয়াক্তে আদায় করার মধ্যে কী (ফযীলত) রয়েছে, যদি তারা জানত, তাহলে তারা এর জন্য প্রতিযোগিতা করত। আর ইশা ও ফজরের সালাত (জামা’আতে) আদায়ের কী ফযীলত তা যদি তারা জানত, তাহলে নিঃসন্দেহে হামাগুঁড়ি দিয়ে হলেও তারা উপস্থিত হত। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৪০২',
        name: '। আযানের মধ্যে কথা বলা। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name:
                'وَتَكَلَّمَ سُلَيْمَانُ بْنُ صُرَدٍ فِي أَذَانِهِ. وَقَالَ الْحَسَنُ لاَ بَأْسَ أَنْ يَضْحَكَ وَهْوَ يُؤَذِّنُ أَوْ يُقِيمُ সুলাইমান ইবন সুরাদ (রহঃ) আযানের মধ্যে কথা বলেছেন। হাসান বসরী (রহঃ) বলেন, আযান বা ইকামত দেওয়ার সময় হেঁসে ফেললে কোন দোষ নেই। ৫৮৯। মুসাদ্দাদ (রহঃ) ... আবদুল্লাহ‌ ইব্‌ন হারিস (রহঃ) থেকে বর্ণিত, তিনি বলেন, একবার বর্ষণ সিক্ত দিনে ইব্‌ন আব্বাস (রাঃ) আমাদের উদ্দেশ্যে খুত্‌বা দিচ্ছিলেন। এ দিকে মুয়আয্‌যিন আযান দিতে গিয়ে যখনحَىَّ عَلَى الصَّلاَةِ এ পৌছল, তখন তিনি তাকে এ ঘোষণা দেওয়ার নির্দেশ দিলেন যে, লোকেরা যেন আবাসে (নিজ নিজ ঘরে) সালাত (নামায/নামাজ) আদায় করে নেয়। এতে লোকেরা একে অপরের দিকে তাকাতে লাগল। তখন ইব্‌ন আব্বাস (রাঃ) বললেন, তাঁর চাইতে যিনি অধিক উত্তম ছিলেন (রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) তিনিই এরূপ করেছেন। অবশ্য জুমু’আর সালাত ওয়াজিব। (তবে ওযরের কারণে নিজ আবাসে সালাত আদায় করার অনুমতি রয়েছে)। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৪০৩।',
        name: ' সময় বলে দেওয়ার লোক থাকলে অন্ধ ব্যাক্তি আযান দিতে পারে। ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৫৯০।  ',
            name:
                'আবদুল্লাহ‌ ইবনু মাসলামা (রহঃ) ... আবদুল্লাহ‌ ইবনু উমর (রাঃ) থেকে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ বিলাল (রাঃ) রাত থাকতেই আযান দেন। কাজেই ইবনু উম্মে মাকতূম (রাঃ) আযান না দেওয়া পর্যন্ত তোমরা (সাহ্‌রীর) পানাহার করতে পার। আবদুল্লাহ‌ (রাঃ) বলেন, ইবনু উম্মে মাকতূম (রাঃ) ছিলেন অন্ধ। যতক্ষন না তাঁকে বলে দেওয়া হত যে, ‘ভোর হয়েছে, ভোর হয়েছে’-ততক্ষণ পর্যন্ত তিনি আযান দিতেন না। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: '৪০৪',
        name: 'পরিচ্ছেদঃ ৪০৪। ফজরের ওয়াক্ত হওয়ার পর আযান দেওয়া। ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৫৯১',
            name:
                ' আবদুল্লাহ‌ ইবনু ইউসুফ (রহঃ) ... হাফসা (রাঃ) থেকে বর্ণিত, তিনি বলেন, যখন মুআয্‌যিন সুব্‌হে সা’দিকের প্রতীক্ষায় থাকত (ও আযান দিত) এবং ভোর স্পষ্ট হতো- জামা’আত দাঁড়ানোর আগে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সংক্ষেপে দু’রাকাআত সালাত (নামায/নামাজ) আদায় করে নিতেন। ',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ৫৯২',
            name:
                ' আবূ নু’আইম (রহঃ) .... আয়িশা (রাঃ) থেকে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফজরের আযান ও ইকামতের মাঝে দু’রাকাত সালাত (নামায/নামাজ) সংক্ষেপে আদায় করতেন।',
            ref: '',
          ),
          HadisNumberModel(
            id: ' ৫৯৩',
            name:
                'আবদুল্লাহ‌ ইবনু ইউসুফ (রহঃ) ... আবদুল্লাহ‌ ইবনু উমর (রাঃ) থেকে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ বিলাল (রাঃ) রাত থাকতে আযান দিয়ে থাকেন। কাজেই তোমরা (সাহ্‌রী) পানাহার করতে থাক; যতক্ষণ না ইবনু উম্মে মাক্‌তূম (রাঃ) আযান দেন।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: '৪০৫',
        name: 'পরিচ্ছেদঃ ৪০৫।  ফজরের ওয়াক্ত হওয়ার আগে আযান দেওয়া।',
        hadisNumberList: [
          HadisNumberModel(
            id: '৫৯৪',
            name:
                ' আহ্‌মদ ইব্‌ন ইউনুস (রহঃ) ... আবদুল্লাহ‌ ইব্‌ন মাসঊদ (রাঃ) থেকে বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরাশাদ করেছেনঃ বিলালের আযান যেন তোমাদের কাউকে সাহ্‌রী খাওয়া থেকে বিরত না রাখে। কেননা, সে রাত থাকতে আযান দেয়-যেন তোমাদের মধ্যে যারা তাহাজ্জুদের সালাতরত তারা ফিরে যায় আর যারা ঘুমন্ত তাদেরকে জাগিয়ে দেয়। তারপর তিনি আঙ্গুল দিয়ে ইশারা করে বললেনঃ ফজর বা সুবহে সা’দিক বলা যায় না, যখন এরূপ হয়-তিনি একবার আঙ্গুল উপরের দিকে উঠিয়ে নীচের দিকে নামিয়ে ইশারা করলেন, যতক্ষন না এরূপ হয়ে যায়। বর্ণনাকারী যুহাইর (রহঃ) তাঁর শাহাদাত আঙ্গুলদ্বয় একটি আপরটির উপর রাখার পর তাঁর ডানে ও বামে প্রসারিত করে দেখালেন। ',
            ref: '',
          ),
          HadisNumberModel(
            id: '৫৯৫',
            name:
                ' ইসহাক ইউসুফ ইবনু ঈসা (রহঃ) ... আয়িশা (রাঃ) সুত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণিত, তিনি বলেন, বিলাল (রাঃ) রাত থাকতে আযান দিয়ে থাকেন। কাজেই, ইবনু উম্মে মাকতূম (রাঃ) যতক্ষণ আযান না দেয়, ততক্ষন তোমরা পানাহার করতে পার। ',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৪০৬।',
        name: ' আযান ইকামতের মধ্যে ব্যাবধান কতটুকু। ',
        hadisNumberList: [
          HadisNumberModel(
            id: '৫৯৬। ',
            name:
                '  ইসহাক ওয়াসিতী (রহঃ) ... আবদুল্লাহ‌ ইব্‌ন মুগাফ্‌ফাল মুযানী (রাঃ) থেকে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ প্রত্যেক আযান ও ইকামতের মধ্যে সালাত (নামায/নামাজ) রয়েছে। একথা তিনি তিনবার বলেন। (তারপর বলেন) যে চায় তার জন্য।',
            ref: '',
          ),
        ]),
    PorichedModel(
        id: ' পরিচ্ছেদঃ ৪০৭।',
        name: ' ইকামতের জন্য অপেক্ষা করা। ',
        hadisNumberList: [
          HadisNumberModel(
            id: ' ',
            name: ' ',
            ref: '',
          ),
        ]),
    PorichedModel(id: ' ', name: ' ', hadisNumberList: [
      HadisNumberModel(
        id: ' ',
        name: ' ',
        ref: '',
      ),
    ]),
    PorichedModel(id: ' ', name: ' ', hadisNumberList: [
      HadisNumberModel(
        id: ' ',
        name: ' ',
        ref: '',
      ),
    ]),
    PorichedModel(id: ' ', name: ' ', hadisNumberList: [
      HadisNumberModel(
        id: ' ',
        name: ' ',
        ref: '',
      ),
    ]),
    PorichedModel(id: ' ', name: ' ', hadisNumberList: [
      HadisNumberModel(
        id: ' ',
        name: ' ',
        ref: '',
      ),
    ]),
    PorichedModel(id: ' ', name: ' ', hadisNumberList: [
      HadisNumberModel(
        id: ' ',
        name: ' ',
        ref: '',
      ),
    ]),
    PorichedModel(id: ' ', name: ' ', hadisNumberList: [
      HadisNumberModel(
        id: ' ',
        name: ' ',
        ref: '',
      ),
    ]),
    PorichedModel(id: ' ', name: ' ', hadisNumberList: [
      HadisNumberModel(
        id: ' ',
        name: ' ',
        ref: '',
      ),
    ]),
    PorichedModel(id: ' ', name: ' ', hadisNumberList: [
      HadisNumberModel(
        id: ' ',
        name: ' ',
        ref: '',
      ),
    ]),
    PorichedModel(id: ' ', name: ' ', hadisNumberList: [
      HadisNumberModel(
        id: ' ',
        name: ' ',
        ref: '',
      ),
    ]),
    PorichedModel(id: ' ', name: ' ', hadisNumberList: [
      HadisNumberModel(
        id: ' ',
        name: ' ',
        ref: '',
      ),
    ]),
    PorichedModel(id: ' ', name: ' ', hadisNumberList: [
      HadisNumberModel(
        id: ' ',
        name: ' ',
        ref: '',
      ),
    ]),
    PorichedModel(id: ' ', name: ' ', hadisNumberList: [
      HadisNumberModel(
        id: ' ',
        name: ' ',
        ref: '',
      ),
    ]),
    PorichedModel(id: ' ', name: ' ', hadisNumberList: [
      HadisNumberModel(
        id: ' ',
        name: ' ',
        ref: '',
      ),
    ]),
    PorichedModel(id: ' ', name: ' ', hadisNumberList: [
      HadisNumberModel(
        id: ' ',
        name: ' ',
        ref: '',
      ),
    ]),
  ];
}
