{
    "items": [
      {
        "id": "1",
        "name": "শ্রাবণের পুরো ভাদ্রের বারো। এর মধ্যে যত পারো।        ",
        "description": "Description 1",
        "poriched":[
          {
            "id":"1",
            "name":"poriched one"
          }
        ]
      },
      {
        "id": "ইসলামিক ফাউন্ডেশন নাম্বারঃ ৪৭, আন্তর্জাতিক নাম্বারঃ ৪৯",
        "name": "পরিচ্ছেদঃ ৩৬/ অজ্ঞাতসারে মুমিনের আমল নষ্ট হওয়ার আশংকা",
        "description": "৪৭। কুতায়বা ইবনু সা’ঈদ (রহঃ) ... ‘উবাদা ইবনু সামিত (রাঃ) বর্ণনা করেন যে, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম লায়লাতুল কদ্‌র সম্পর্কে খবর দেওয়ার জন্য বের হলেন। তখন দু’জন মুসলিম পরস্পর বিবাদ করছিল। তিনি বললেনঃ আমি তোমাদের লায়লাতুল কদ্‌র সম্পর্কে খবর দেওয়ার জন্য বেরিয়েছিলাম; কিন্তু তখন অমুক অমুক বিবাদে লিপ্ত থাকায় তা (নির্দিষ্ট তারিখ সম্পর্কিত জ্ঞান) উঠিয়ে নেওয়া হয়েছে। আর হয়তো বা এটাই তোমাদের জন্য কল্যাণকর হবে। তোমরা তা অনুসন্ধান কর ২৭, ২৯ ও ২৫ তম রাতে।"
      },
      {
        "id": "ইসলামিক ফাউন্ডেশন নাম্বারঃ ৪৮, আন্তর্জাতিক নাম্বারঃ ৫০",
        "name": "পরিচ্ছেদঃ ৩৭/ জিবরীল (আঃ) কর্তৃক রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে ঈমান, ইসলাম, ইহসান ও কিয়ামতের জ্ঞান সম্পর্কে প্রশ্ন",
        "description": " জিবরীল (আঃ) কর্তৃক রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে ঈমান, ইসলাম, ইহসান ও কিয়ামতের জ্ঞান সম্পর্কে প্রশ্ন আর তাকে দেওয়া রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর উত্তর। তারপর তিনি বললেনঃ জিবরীল (আঃ) তোমাদের দ্বীন শিক্ষা দিতে এসেছিলেন। তিনি এসব বিষয়কে দ্বীন বলে আখ্যায়িত করেছেন। ঈমান সম্পর্কে আব্দুল কায়স গোত্রের প্রতিনিধি দলকে রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যে বিবরন দিয়েছেন এবং আল্লাহ্‌ তা'আলা ইরশাদ করেছেনঃ (وَمَنْ يَبْتَغِ غَيْرَ الإِسْلاَمِ دِينًا فَلَنْ يُقْبَلَ مِنْهُ) কেউ ইসলাম ব্যাতিত অন্য কোন দ্বীন গ্রহন করতে চাইলে তা কখনো কবুল করা হবে না (৩ঃ ৮৫)৪৮। মূসা’দ্দাদ (রহঃ) ... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত, তিনি বলেন, একদিন রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জনসমুক্ষে বসা ছিলেন, এমন সময় তাঁর কাছে এক ব্যাক্তি এসে জিজ্ঞাসা করলেন ‘ঈমান কি?’ তিনি বললেনঃ ‘ঈমান হল, আপনি বিশ্বাস রাখবেন আল্লাহর প্রতি, তাঁর ফিরিশতাগণের প্রতি, (কিয়ামতের দিন) তাঁর সঙ্গে সাক্ষাতের প্রতি এবং তাঁর রাসূলগণের প্রতি। আপনি আরো বিশ্বাস রাখবেন পুনরুত্থানের প্রতি। তিনি জিজ্ঞাসা করলেন, ‘ইসলাম কি?’ তিনি বললেনঃ ‘ইসলাম হল, আপনি আল্লাহর ইবাদত করবেন এবং তাঁর সঙ্গে শরীক করবেন না, সালাত (নামায/নামাজ) কায়েম করবেন, ফরয যাকাত আদায় করবেন এবং রমযানের সাওম (রোযা/রোজা/সিয়াম/ছিয়াম) পালন করবেন। ঐ ব্যাক্তি জিজ্ঞাসা করলেন, ‘ইহসান কি?’ তিনি বললেনঃ ‘আপনি এমন ভাবে আল্লাহর ইবাদত করবেন যেন আপনি তাঁকে দেখছেন, আর যদি আপনি তাঁকে দেখতে না পান তবে (বিশ্বাস রাখবেন যে,) তিনি আপনাকে দেখছেন। ঐ ব্যাক্তি জিজ্ঞাসা করলেন, ‘কিয়ামত কবে?’ তিনি বললেনঃ ‘এ ব্যাপারে যাকে জিজ্ঞাসা করা হচ্ছে, তিনি জিজ্ঞাসাকারী অপেক্ষা বেশি জানেন না। তবে আমি আপনাকে কিয়ামতের আলামতসমূহ বলে দিচ্ছিঃ বাঁদী যখন তার প্রভুকে প্রসব করবে এবং উটের নগণ্য রাখালেরা যখন বড় বড় অট্টালিকা নির্মাণে প্রতিযোগিতা করবে। (কিয়ামতের বিষয়) সেই পাঁচটি জিনিসের অন্তর্ভূক্ত, যা আল্লাহ্ ছাড়া কেউ জাননা। এরপর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এই আয়াতটি শেষ পর্যন্ত তিলাওয়াত করলেনঃ (إِنَّ اللَّهَ عِنْدَهُ عِلْمُ السَّاعَةِ‏) “কিয়ামতের জ্ঞান কেবল আল্লাহই নিকট।” (৩১ : ৩৪) এরপর ঐ ব্যাক্তি চলে গেলে তিনি বললেনঃ ‘তোমরা তাকে ফিরিয়ে আন।’ তারা কিছুই দেখতে পেল না। তখন তিনি বললেন, ‘ইনি জিবরীল আলাইহিস সালাম। লোকদের দ্বীন শেখাতে এসেছিলেন। আবূ আব্দুল্লাহ বুখারী (রহঃ) বলেন, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এসব বিষয়কে ঈমানের অন্তর্ভুক্ত করেছেন৷      "
      },
      {
        "id": "পরিচ্ছেদঃ ৩৯/ দ্বীন রক্ষাকারীর ফজিলত",
        "name": "ইসলামিক ফাউন্ডেশন নাম্বারঃ ৫০, আন্তর্জাতিক নাম্বারঃ ৫২",
        "description": "৫০। আবূ নু’আয়ম (রহঃ) ... নু’মান ইবনু বশীর (রাঃ) থেকে বর্ণিত, তিনি বলেনঃ আমি রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি যে, ‘হালালও স্পষ্ট এবং হারামও স্পষ্ট। আর এ দু’য়ের মাঝে রয়েছে বহু সন্দেহজনক বিষয়- যা অনেকেই জানেনা। যে ব্যাক্তি সেই সন্দেহজনক বিষয়সমূহ থেকে বেঁচে থাকবে, সে তার দ্বীন ও মর্যাদা রক্ষা করতে পারবে। আর যে সন্দেহজনক বিষয়সমূহে লিপ্ত হয়ে পড়ে, উদহারন সে রাখালের ন্যায়, যে তার পশু বাদশাহ্‌র সংরক্ষিত চারণভুমির আশে পাশে চরায়, অচিরেই সেগুলো সেখানে ঢুকে পড়ার আশংকা রয়েছে। জেনে রাখ যে, প্রত্যেক বাদশাহ্‌রই একটি সংরক্ষিত এলাকা রয়েছে। আরো জেনে রাখ যে, আল্লাহর যমীনে তাঁর সংরক্ষিত এলাকা হল তাঁর নিষিদ্ধ কাজসমূহ। জেনে রাখ, শরীরের মধ্যে একটি গোশতের টুকরা আছে, তা যখন ঠিক হয়ে যায়, গোটা শরীরই তখন ঠিক হয়ে যায়। আর তা যখন খারাপ হয়ে যায়, গোটা শরীরই তখন খারাপ হয়ে যায়। জেনে রাখ, সে গোশতের টুকরোটি হল কলব।t"
      },
      {
        "id": "p4",
        "name": "অকাররন রকছুই ঘরি না।",
        "description": "paragraph sets up what information is to come as your audience reads on. Even in fiction, the introduction of a paragraph either establishes an idea or scenario or continues one from the paragraph before. Regardless of what format or genre you’re writing for, every good paragraph starts with a central focus that the rest of the paragraph will aim to support"
      },
      {
        "id": "p5",
        "name": "Flutter Developer Details",
        "description": "paragraph sets up what information is to come as your audience reads on. Even in fiction, the introduction of a paragraph either establishes an idea or scenario or continues one from the paragraph before. Regardless of what format or genre you’re writing for, every good paragraph starts with a central focus that the rest of the paragraph will aim to support"
      },
      {
        "id": "p6",
        "name": "Flutter Developer Details",
        "description": "Provide support via the middle sentences. These sentences include follow-up information to your key sentence or previous paragraph. Whatever idea you aim to convey, these sentences are where you convince your reader to believe or envision what you do, and give them everything they need to see your point of view.Make your last sentence a conclusion or transition. Even if it’s not at the end of the piece, a conclusive sentence can refer to the last line of its own paragraph, which concludes a particular idea or train of thought before moving on to start a new line for the next paragraph. This next paragraph can continue on the same idea, but the ending of each paragraph should briefly summarize the information that was provided before moving on. Know when to start a new paragraph. A paragraph break is necessary when starting a new topic, introducing a new speaker, contrasting other POVs or ideas, or providing white space to give readers a pause from a longer paragraph. For example, in a novel, you may start a new paragraph when bringing in a new character, or specify when a different character is speaking, which can help the reader separate action text from dialogue more readily. Paragraph breaks can control the pacing of your writing, and generate particular feelings or moods for your reader. While there is no set amount of sentences required per paragraph, in some instances, a single paragraph may consist of a single sentence, but it is acceptable as long as it supports your central idea, and doesn’t overwhelm your audience with too much information. Use transition words. Transition words help tie together separate paragraphs, connecting them to form a coherent idea. Phrases like “in addition” or “moreover” can help readers track your ideas and understand how they relate to each other, making for a smoother, more pleasant reading experience. This is especially useful for essay writers and bloggers, who often focus on a singular idea at a time to share with their audience"
      }
    ]
  }